{
  "meta.json": "{\n  \"rank\": 26,\n  \"title\": \"The CEO Paying Everyone $70,000 Salaries Has Something to Hide\",\n  \"url\": \"http://www.bloomberg.com/features/2015-gravity-ceo-dan-price/\",\n  \"hn_url\": \"https://news.ycombinator.com/item?id=10657913\",\n  \"points\": 118,\n  \"author\": \"whatok\",\n  \"comment_count\": 88\n}",
  "article.txt": "The CEO Paying Everyone $70,000 Salaries Has Something to Hide Bloomberg the Company & its Products Bloomberg Anywhere Remote Login Bloomberg Terminal Request a Demo The CEO Paying Everyone $70,000 Salaries Has Something to Hide Inside the viral story of Gravity CEO Dan Price. By Karen Weise | December 1, 2015 Photographs by Nathaneal Turner From It seemed too good to be true. On AprilÂ 13, with reporters from the New York Times and NBC News hovering nearby, Dan Price, the young chief executive officer of Gravity Payments , a Seattle-based credit card processing company, told his staff he was raising their minimum salary to $70,000 a year. Some employees would see their wages double. There was more: He planned to cut his own $1.1Â million compensation to help cover the cost. The idea came to him, heâ\u0080\u0099d later tell the media , after talking to a friend who earned less than he did. Heâ\u0080\u0099d read about a study showing that extra income improves the happiness of people who earn less than about $75,000. â\u0080\u009cItâ\u0080\u0099s not about making money; itâ\u0080\u0099s about making a difference,â\u0080\u009d Price told the Today Show , one of two dozen TV interviews he did in the days following the announcement. Priceâ\u0080\u0099s story rocketed around the world, a capitalist fairy tale to counter growing inequality. With his tousled long hair and dark brown eyes, Price combined Brad Pittâ\u0080\u0099s smolder and Boo Boo Bearâ\u0080\u0099s aw-shucks demeanor to become an articulate and attractive messenger. Rush Limbaugh denounced him as a socialist. Jesse Ventura christened him Robin Hood. In late summer, the New York Times ran a longer piece on Price, now 31, showing that raising wages wasnâ\u0080\u0099t so simple. Job applicants had overwhelmed his company, and two employees quit, saying the increase wasnâ\u0080\u0099t fair to higher earners. â\u0080\u009cPotentially the worst blow of all,â\u0080\u009d the Times wrote, was that about two weeks after the announcement, Price was sued by his older brother Lucas, who owns about 30Â percent of Gravity, alleging Price paid himself too much in the first place. Price insinuated that his brother may have sued in reaction to the generous pay increase. â\u0080\u009cI know the decision to pay everyone a living wage is controversial,â\u0080\u009d he told the Seattle Times , which first reported the lawsuit. â\u0080\u009cI deeply regret the rift this has caused in my relationship with my brother.â\u0080\u009d An expensive lawsuit, filed possibly in response to his kind act, made Price seem more of an underdog. When I met him at Gravityâ\u0080\u0099s headquarters in mid-October, he wasnâ\u0080\u0099t even supposed to be in Seattle. Heâ\u0080\u0099d been scheduled to join Planned Parenthood President Cecile Richards and General David Petraeus on a panel titled â\u0080\u009cLeading Under Pressureâ\u0080\u009d at the Chicago Ideas Week festival. But Price had canceled at the last minute, saying heâ\u0080\u0099d hit a wall of exhaustion. â\u0080\u009cI think Iâ\u0080\u0099m just standing in for a bunch of other people doing great stuff,â\u0080\u009d he said. â\u0080\u009cTo me the responsibility is to be the best spokesperson I can.â\u0080\u009d As we talked about his wild six months, I brought up the lawsuit, asking if Price thought Gravityâ\u0080\u0099s spending on the raises triggered his brotherâ\u0080\u0099s suit, as heâ\u0080\u0099d implied. â\u0080\u009cI have no idea,â\u0080\u009d he slowly shrugged, looking right at me. â\u0080\u009cThe quote in the Seattle Times from his attorney was, â\u0080\u0098It wasnâ\u0080\u0099t only because of that.â\u0080\u0099â\u0080\u008aâ\u0080\u009d He twisted his beard between two fingers, contemplating the statement by Lucasâ\u0080\u0099s attorney, Greg Hollon. â\u0080\u009cThat one singular quote in the paper is the only information I have about if they were connected or not.â\u0080\u009d Itâ\u0080\u0099s a poignant story, one that I almost wrote. Until I realized Price knew more than he was letting on. The lawsuit couldnâ\u0080\u0099t have been prompted by the pay raiseâ\u0080\u0094if anything, it may have been the other way around. And his salary before the big announcement was unusually high. As I read through the court record and media reports, I began to see how Price was writing his own origin myth one interview at a time. With what he says is a $500,000 book deal, heâ\u0080\u0099s solidifying his place as the next do-gooder businessman, joining the CEOs of bigger companies, such as Zapposâ\u0080\u0099s Tony Hsieh and Whole Foods Marketâ\u0080\u0099s John Mackey. In the process, heâ\u0080\u0099s surely become the only credit card processing executive to be feted by Esquire , courted by literary agents, and swooned at by women on social media who declared him â\u0080\u009c yum .â\u0080\u009d But how it all happened is a little more complicated. Gravity staffers plank during meetings to encourage each other to speak quickly. Photographer: Nathaneal Turner for Bloomberg Businessweek The day-to-day work at Gravity Payments is pretty unglamorous. Gravity is a middleman between merchants and payment networks, namely Visa and MasterCard, which in turn connect to banks that issue credit cards. If you use a credit card to pay for a Habanero Soft Chicken Burrito at a Taco Time in Seattle, itâ\u0080\u0099s Gravity that helps move $6.29 from your bank to the restaurantâ\u0080\u0099s, keeping a sliver for its service along the way. As Price tells it, he started thinking about credit cards when his middle school band, Straightforword, was gigging around Idaho. He grew up in a religious family outside Boise, the fourth of six kids. The â\u0080\u009c teenage rock star ,â\u0080\u009d as his speaking-circuit agent now bills him, frequently performed at a local coffee shop and got to know the owner. Price says she complained about how much she had to pay for credit card processing and inadvertently taught him about swipe fees. â\u0080\u009cShe let us do a show and gave us 100Â percent of the door, but when someone wanted to pay their entrance with a credit card, we had to pay the fee,â\u0080\u009d he says. About that time, Priceâ\u0080\u0099s father began consulting for the credit card industry. Price learned the ropes from his dad and helped businesses negotiate with processing vendors. In 2003, Price started college in Seattle, and he and Lucas founded Gravity the next year. The brothers initially split the company evenly. In 2005, at 21, Price married Kristie Lewellyn, and the next year he became Gravityâ\u0080\u0099s CEO. Gravity works to keep merchants happy with low prices and good service. Thatâ\u0080\u0099s expensive, but acquiring new clients can be even more so. Gravity says it historically has lost only about 9Â percent of its customers a year. â\u0080\u009cTypically, thereâ\u0080\u0099s more than 30Â percent attrition per year in our industry,â\u0080\u009d Price says. Not quite: A 2012 study for Discover Financial Services found the rate averages 16Â percent, and other sources indicate attrition rates well below 30 percent. When the financial crisis hit in 2008, consumers cut their spending, and about 20Â percent of Gravityâ\u0080\u0099s business disappeared within weeks, Price says. â\u0080\u009cIt changed us from being mildly profitable to where we were losing money every month.â\u0080\u009d He called a company meeting, and â\u0080\u009cI said, â\u0080\u0098In seven months we will be out of business, so letâ\u0080\u0099s hold expenses and get into the black,â\u0080\u0099â\u0080\u0089â\u0080\u009d he recalls. It worked. In 2012, Price began raising staff pay in steps. Each raise, he says, brought a surge in profit. In February 2012, he and Lewellyn divorced, â\u0080\u009camicably,â\u0080\u009d the New York Times and Inc. wrote. Priceâ\u0080\u0099s own pay grew rapidly. In 2011 he was making â\u0080\u009cprobably $50,000 a year,â\u0080\u009d he said at the Aspen Ideas Festival this summer. In 2012 his compensation jumped to $1Â million, he says. That August, records show, he paid cash for a $900,000 house with a poolâ\u0080\u0094a rarity in Seattle. In 2013, Price says, Gravity hired compensation consultant Towers Watson to look at his salary. â\u0080\u009cThe Towers Watson recommendation allowed for significant raises over the $1.1Â million, but I elected to not raise my pay,â\u0080\u009d he says. Hollon, Lucasâ\u0080\u0099s attorney, says Price is â\u0080\u009cmischaracterizingâ\u0080\u009d the findings. When Price made his $70,000 announcement, he told his staff, â\u0080\u009cMy pay is set based on market rates and kinda what it would take to replace me. And because of this growing inequality, as a CEO that amount is really, really high. I make, uh, you know, a crazy, uh, my compensation is really, really high.â\u0080\u009d â\u0080\u009cI have never given myself a raise without unanimous, full board approvalâ\u0080\u009d Whether judged by gross or net revenue, Priceâ\u0080\u0099s pay was atypical for a company its size. Gravityâ\u0080\u0099s finances arenâ\u0080\u0099t public, but Price says gross revenue was $150Â million in 2014 and will rise to an estimated $200Â million in 2015. But Gravity doesnâ\u0080\u0099t get to keep the bulk of that revenue; it must automatically pass most of it on to credit card networks and issuers. The amount the company retainsâ\u0080\u0094net revenue, which Price calls â\u0080\u009cprobably a more relevant figureâ\u0080\u009dâ\u0080\u0094was $16Â million in 2014, he says. Gravityâ\u0080\u0099s 2014 profit was $2.2Â million, Price adds. At private companies with sales like Gravityâ\u0080\u0099s total revenue, salary and bonus for the top quartile of CEOs is $710,000, according to Chief Executive magazineâ\u0080\u0099s annual compensation survey . At companies with sales like Gravityâ\u0080\u0099s net revenue, the top quartile pay falls to about $373,000. At companies with a similar number of employees as Gravity, the top quartile of CEOs makes $470,000 in salary and bonus. The CEO of JetPay, a publicly traded competitor that processes a similar volume as Gravity, received $355,000 in 2014. After meeting Price and researching the figures, I called to ask if he thought his $1.1Â million pay was fair, given those benchmarks. He replied: â\u0080\u009cI appreciate you asking the question. Iâ\u0080\u0099m happy to answer any other questions you might have. Iâ\u0080\u0099m way over time, and thereâ\u0080\u0099s a bunch of people waiting for me.â\u0080\u009d When we spoke later, he said, â\u0080\u009cI have never given myself a raise without unanimous, full board approval.â\u0080\u0089â\u0080¦â\u0080\u0089That means we both voted the same way. Lucas Price and Daniel Price, the two board members.â\u0080\u009d Hollon says thatâ\u0080\u0099s â\u0080\u009cinaccurateâ\u0080\u009d and that Price â\u0080\u009cpaid himself excessive compensation for a number of yearsâ\u0080\u0089â\u0080¦â\u0080\u0089over Lucasâ\u0080\u0099s objections.â\u0080\u009d Photographer: Nathaneal Turner for Bloomberg Businessweek As heâ\u0080\u0099s recounted over and over, Price says his aha moment about pay came in late March, on a hike with his friend. â\u0080\u009cI realized that there were people I was working withâ\u0080\u0094that I said I valued as partners, I said I really want to invest inâ\u0080\u0094and they were making less than her,â\u0080\u009d he told The Daily Show â\u0080\u0099s Trevor Noah. Price says he thought back to a 2010 paper by Nobel prize winners Daniel Kahneman and Angus Deaton, who found that peopleâ\u0080\u0099s emotional well-being improves as their earnings rise, until their pay reaches about $75,000 a year. Priceâ\u0080\u0099s hiking friend, Valerie Molina, remembers their exchange. â\u0080\u009cDan said, â\u0080\u0098Iâ\u0080\u0099m going to pay all my employees minimum $70,000,â\u0080\u0099â\u0080\u0089â\u0080\u009d Molina said in an e-mail. â\u0080\u009câ\u0080\u0089â\u0080\u0098Iâ\u0080\u0099m not sure exactly how Iâ\u0080\u0099m going to do it, I need to run the numbers, but I am. Is that crazy?â\u0080\u0099â\u0080\u0089â\u0080\u009d Gravity had about 120 employees, and they earned a little less than $50,000 on average. He found it would cost about $1.8Â million to increase wages to $70,000 in steps over three years. Cutting his own pay would cover much of that, and if the wage hikes made his staff more productive, he figured, the whole move just might work. Price had gotten publicity for a previous pay increase, telling the Seattle Times in 2013 that he was raising salaries 2Â percent to make up for a federal hike in the employee payroll tax. Ryan Pirkle, who runs Gravityâ\u0080\u0099s communications, says with the bigger 2014 raise, Price told him, â\u0080\u009cI want the right people to tell the right story. I want exclusivity.â\u0080\u009d Thatâ\u0080\u0099s why they invited the New York Times and NBC News to the announcement. â\u0080\u009cIâ\u0080\u0099m just doing the math, and Iâ\u0080\u0099m like, â\u0080\u0098Wow,â\u0080\u0099â\u0080\u0089â\u0080\u009d Price told me. He figured he could get as many as 700 new customers from the publicity. â\u0080\u009cThat could pay for 10Â percent of this crazy thing that Iâ\u0080\u0099m doing.â\u0080\u0089â\u0080¦â\u0080\u0089Of course, it became about something way bigger than that in hindsight, but at the time I was thinking so tactically.â\u0080\u009d By 3 a.m. the morning after the announcement, Priceâ\u0080\u0099s phone was buzzing. The Today Show wanted him the next morning, as did Good Morning America . He hopped a plane to New York. â\u0080\u009cI did something like 25 live TV interviews in three days,â\u0080\u009d he says. â\u0080\u009cWe are really passionate about reforming credit card processing. This seemed like an opportunityâ\u0080\u0094we could have a really big impact doing that.â\u0080\u009d Fox News pilloried him. Actor Russell Brand, in a laudatory YouTube video, joked, â\u0080\u009cItâ\u0080\u0099s difficult to ignore the fact that Dan Price looks a lot like Jesus.â\u0080\u009d Price says heâ\u0080\u0099s been courted by TV producers including Ryan Seacrest and Mark Burnett, who created Survivor and The Apprentice . A spokesman for Seacrest says he â\u0080\u009cdoes not recall ever speaking with Mr. Priceâ\u0080\u009d; Burnettâ\u0080\u0099s press representatives didnâ\u0080\u0099t return requests for comment. Price signed with the talent agency William Morris Endeavor Entertainment and now charges as much as $20,000 per speech, Pirkle says. When I visited Gravityâ\u0080\u0099s office in October, Price told his team that the company was getting free booth space at Inc. magazineâ\u0080\u0099s annual conference, in addition to a speaking fee. â\u0080\u009cIn terms of what theyâ\u0080\u0099re paying us for a one-hour talk, weâ\u0080\u0099re looking at well over $100,000,â\u0080\u009d he said. Inc. put him on its November cover. (Inc. didnâ\u0080\u0099t respond to requests for comment.) Price told me the hoopla has him feeling torn. â\u0080\u009cThis might sound weird, because I do a lot of stuff, but Iâ\u0080\u0099m so sick of attention,â\u0080\u009d he said. â\u0080\u009cIt just feels like a lot of investment of yourself, you know?â\u0080\u009d He recalled when he was on the cover of Entrepreneur magazine last December and the relief he felt when the next issue went on sale. â\u0080\u009cI was so happy when they changed issues and I wasnâ\u0080\u0099t on the cover anymore,â\u0080\u009d he said. â\u0080\u009cIâ\u0080\u0099m in the airport a lot, and I was just so happy to not see myself.â\u0080\u009d Yet for all the relief, Price and his team asked six times if heâ\u0080\u0099d be on Bloomberg Businessweek â\u0080\u0099s cover. â\u0080\u009cIâ\u0080\u0099m just so sick of attention ... It just feels like a lot of investment of yourselfâ\u0080\u009d Two weeks after returning from the April media blitzkrieg in New York, Price told me, he was settling in at home to finally unwind. â\u0080\u009cI was going to watch my first soccer game since this had all happened,â\u0080\u009d he recalled. â\u0080\u009cMy doorbell rang, and there was a legal courier. â\u0080\u0098Are you Dan Price?â\u0080\u0099 â\u0080\u0098Yes.â\u0080\u0099â\u0080\u0089â\u0080\u009d Price said he was served with Lucasâ\u0080\u0099s lawsuit. â\u0080\u009cI was shocked,â\u0080\u009d he said. â\u0080\u009cThe soccer game got turned off pretty quickly.â\u0080\u009d It was during this recounting that Price told me how the comment from Lucasâ\u0080\u0099s lawyer in the Seattle Times was the â\u0080\u009conly information I have about if they were connected or not.â\u0080\u009d The possible retaliatory nature of the suit only adds to the drama of Priceâ\u0080\u0099s wage hike. â\u0080\u009cThis is all speculation on my part,â\u0080\u009d Pirkle said in late September, before explaining how, as minority shareholder, Lucas gets paid dividends from Gravityâ\u0080\u0099s profits. â\u0080\u009cThose profits are obsolete when you raise the wages.",
  "comments.json": "[\n  {\n    \"author\": \"orliesaurus\",\n    \"text\": \"tl;dr anyone?\",\n    \"points\": null,\n    \"depth\": 0,\n    \"children\": [\n      {\n        \"author\": \"soperj\",\n        \"text\": \"It's a hit piece. Basically the lawsuit from his brother seems to have come about before the pay hike for employees. Also put a smattering of he beat his ex-wife in at the end, but we have no real evidence.\",\n        \"points\": null,\n        \"depth\": 1\n      }\n    ]\n  },\n  {\n    \"author\": \"asdfologist\",\n    \"text\": \"TL;DR: he raised the salaries after he was sued for overpaying himself.\",\n    \"points\": null,\n    \"depth\": 0,\n    \"children\": [\n      {\n        \"author\": \"lingben\",\n        \"text\": \"Thank you :) I don't know how to write this comment in a short time span without coming across as a snarky a-hole but seriously, why are such piss-poor writers allowed to write for such serious publications? where the hell are editors and what are they doing? when did it become acceptable to hit 'publish' on such a shoddy amateurish article? sigh\",\n        \"points\": null,\n        \"depth\": 1,\n        \"children\": [\n          {\n            \"author\": \"grossvogel\",\n            \"text\": \"\\\"Bloomberg Businessweek\\\" does sound like the name of a serious publication...\",\n            \"points\": null,\n            \"depth\": 2\n          },\n          {\n            \"author\": \"shawn-furyan\",\n            \"text\": \"This is a bit off topic, but I see this bafflement over the general decline in editing quality a lot. It's really not so surprising given the way the news landscape has changed in the last couple decades. Editing is expensive[1]. The internet ripped the heart out of the print news business. Accordingly, editing has been cut back drastically pretty much across the board in response to increasingly tight budgets. [1] Much more expensive than one might assume without having experienced the process. Coordinating among multiple people plus the back and forth iterative process that editing generates adds a lot of overhead to the writing process. Self editing is much faster (and therefore cheaper), but you get blind to errors that would jump out at someone else, and so errors slip through much more readily. Plus, other people are capable of challenging your assumptions in a way that you just aren't capable of since you aren't even always aware of your own assumptions. Source: I've written informally at the margins for a reasonably, but not tremendously, high trafficked niche blog, and have participated a little in both edited and self-edited articles from both the writing and editing side. This was never industrial strength editing, so I imagine the cost to actual news outlets with higher standards is a lot higher than I have experienced.\",\n            \"points\": null,\n            \"depth\": 2\n          }\n        ]\n      }\n    ]\n  },\n  {\n    \"author\": \"wahsd\",\n    \"text\": \"Was anyone else caught off guard by the sexy yoga ball pose? Edit: Someone else says it's a hit piece, makes sense that the picture seems off if it is some filthy animal squandering the internet's time on savagery.\",\n    \"points\": null,\n    \"depth\": 0,\n    \"children\": [\n      {\n        \"author\": \"guiomie\",\n        \"text\": \"I'd say the pictures are kinda creepy.\",\n        \"points\": null,\n        \"depth\": 1\n      }\n    ]\n  },\n  {\n    \"author\": \"zymhan\",\n    \"text\": \"> Gravity\\u2019s 2014 profit was $2.2 million, Price adds. > At private companies with sales like Gravity\\u2019s total revenue, salary and bonus for the top quartile of CEOs is $710,000, according to Chief Executive magazine\\u2019s annual compensation survey. At companies with sales like Gravity\\u2019s net revenue, the top quartile pay falls to about $373,000. At companies with a similar number of employees as Gravity, the top quartile of CEOs makes $470,000 in salary and bonus. The CEO of JetPay, a publicly traded competitor that processes a similar volume as Gravity, received $355,000 in 2014. $1.1 million on CEO salary sounds ridiculous given a $2.2m profit.\",\n    \"points\": null,\n    \"depth\": 0,\n    \"children\": [\n      {\n        \"author\": \"crpatino\",\n        \"text\": \"Not if he were the managing partner (and majoritary owner). But agreed. If this were a public company, stockholders would probably be very unhappy that half of their earnings are being poached by some profesional executive with no skin in the game.\",\n        \"points\": null,\n        \"depth\": 1,\n        \"children\": [\n          {\n            \"author\": \"jonknee\",\n            \"text\": \"But since he is the majority stockholder it makes perfect sense. It's his money one way or the other.\",\n            \"points\": null,\n            \"depth\": 2\n          }\n        ]\n      },\n      {\n        \"author\": \"jonknee\",\n        \"text\": \"Why? He was also the majority shareholder.\",\n        \"points\": null,\n        \"depth\": 1,\n        \"children\": [\n          {\n            \"author\": \"zymhan\",\n            \"text\": \"Because taking 50% of the money your company has to invest in itself as pay seems awfully selfish and short-sighted.\",\n            \"points\": null,\n            \"depth\": 2,\n            \"children\": [\n              {\n                \"author\": \"jonknee\",\n                \"text\": \"50% of the profit after business expenses... There are tons of small businesses run this way, nothing especially wrong with it. You can do things differently when you control the shares instead of a bunch of VCs who want to pump it up so they can exit big or go home early.\",\n                \"points\": null,\n                \"depth\": 3\n              }\n            ]\n          }\n        ]\n      },\n      {\n        \"author\": \"you_eeeeeediot\",\n        \"text\": \"Glad you posted that, I knew something was clearly out of whack with his compensation just based on revenue alone it did not make sense. The article tries to paint an elaborate picture, but ultimately fails on all counts to point out the most basic problem with this story and that might have shed additional light on his motivations.\",\n        \"points\": null,\n        \"depth\": 1\n      },\n      {\n        \"author\": \"emiranda\",\n        \"text\": \"Where did you get $1.1 million?\",\n        \"points\": null,\n        \"depth\": 1,\n        \"children\": [\n          {\n            \"author\": \"zymhan\",\n            \"text\": \"From the article, did you read it?\",\n            \"points\": null,\n            \"depth\": 2\n          }\n        ]\n      }\n    ]\n  },\n  {\n    \"author\": \"tunesmith\",\n    \"text\": \"Man, with the way the sharks have been in the water around this guy, you'd think he was running Theranos or something. So what if he was initially overpaid, and so what if the lawsuit predated the decision? The domestic violence allegations are another matter, but still, if he's guilty of that does that mean that his employees have to give half their salaries back to him just to appease the Ayn Rand acolytes?\",\n    \"points\": null,\n    \"depth\": 0,\n    \"children\": [\n      {\n        \"author\": \"deelowe\",\n        \"text\": \"> just to appease the Ayn Rand acolytes? huh? You had me up until this point.\",\n        \"points\": null,\n        \"depth\": 1,\n        \"children\": [\n          {\n            \"author\": \"smt88\",\n            \"text\": \"S/he means people who believe that society and individuals are better off serving themselves without any concern for the well-being of others. If this experiment, of giving up a bunch of profit (and his own pay), were to succeed and make the company more profitable, it would undermine the idea that selfishness is the best way to serve yourself. See also: enlightened self-interest[1]. 1. https://en.wikipedia.org/wiki/Enlightened_self-interest\",\n            \"points\": null,\n            \"depth\": 2,\n            \"children\": [\n              {\n                \"author\": \"deelowe\",\n                \"text\": \"I'm familiar with libertarianism and Rand's books. The OP's ad homonym is extremely out of place in this thread. That was my point.\",\n                \"points\": null,\n                \"depth\": 3\n              }\n            ]\n          },\n          {\n            \"author\": \"WorldMaker\",\n            \"text\": \"Possibly more confusing, but have you played BioShock? It's kind of an Objectivism Pitfalls for Dummies. Ayn Rand founded/advocated a strong, determined branch of Libertarianism called Objectivism. In an over-generalizing nutshell, it's a philosophy, often economic, of individual freedoms over community needs (a strong negative over-reaction to bad socialism).\",\n            \"points\": null,\n            \"depth\": 2,\n            \"children\": [\n              {\n                \"author\": \"Plough_Jogger\",\n                \"text\": \"Though this isn't the proper forum for this discussion, Ayn Rand wouldn't have objected to the CEO choosing to pay his employees an above-market wage.\",\n                \"points\": null,\n                \"depth\": 3,\n                \"children\": [\n                  {\n                    \"author\": \"WorldMaker\",\n                    \"text\": \"Good point, and one that is lost in a lot of modern political discourse. I once had some very cool discussions with a (very) early fan of Objectivism, when it was more a religion than a economic philosophy, and his perspective on what the modern Libertarian Thinktanks have done to co-opt Objectivism was fascinating. Unfortunately for him, although the economics adherents have lost a lot of the nuance of the original Rand vision in addition to the stronger religious views, they certainly haven't fallen that far from the tree and have kept the religious sort of fervent devotion to their version of its ideals.\",\n                    \"points\": null,\n                    \"depth\": 4,\n                    \"children\": [\n                      {\n                        \"author\": \"soperj\",\n                        \"text\": \"You could say the same about a lot of the Marxist adherents.\",\n                        \"points\": null,\n                        \"depth\": 5\n                      }\n                    ]\n                  }\n                ]\n              },\n              {\n                \"author\": \"tunesmith\",\n                \"text\": \"Objectivists argue about what branch of normative ethics it is. I like to see it as a branch of Consequentialism, like a cousin of Utilitarianism, except where the utility function is not what outcome is best for the greater good, but what outcome is best for the self. They tend to believe that what is best for the self is by definition best for everyone. Debates usually get hung up on Tragedy of the Commons, and whether it actually exists as a meaningful concept or whether it can always be solved via private property ownership.\",\n                \"points\": null,\n                \"depth\": 3\n              },\n              {\n                \"author\": \"jldugger\",\n                \"text\": \"Bioshock isn't really a critique of Objectivism. Part of Ayn Rand's philosophy as demonstrated in her books is that charity and philanthropy are used as PR stunts to cover up some nefarious deeds, like Bernie Madoff donating millions of other people's money to charity. The first half of the game sets up the Founder Capitalist Figure as villan, and the second half portrays him as victim to a Bootlegger/Baptist Figure. I haven't read her stuff, but I seem to recall this plot being closer to a re-enactment, based second hand descriptions of the books. The later games do a somewhat better job though. In that light, he is absolutely buying the loyalty of his employees, and being a private company, we really have no idea how sustainable the system really is. Worse, these things are path dependent. Getting a raise from 28k->32k will feel a lot different than going from 28k->70k->32k, even though the end state is the same. This is the sort of thing that can wreck companies.\",\n                \"points\": null,\n                \"depth\": 3,\n                \"children\": [\n                  {\n                    \"author\": \"Joof\",\n                    \"text\": \"I wonder if such a jump is actually bad for people. Many would allow lifestyle bloat and have difficulty going back down to market value when they transfer jobs.\",\n                    \"points\": null,\n                    \"depth\": 4\n                  }\n                ]\n              }\n            ]\n          }\n        ]\n      },\n      {\n        \"author\": \"smt88\",\n        \"text\": \"He might have had selfish motivations, and he might be a bad guy. But neither of those things changes the fact that he did an experiment with giving employees equal salaries, and that experiment had positive results on the company. I think sharks are circling because people have a zeal for debunking the idea that someone is selfless. If you Google it, you can even find people who criticize Mother Theresa for having secret, selfish ulterior motives. I personally believe people who help others always get something out of it (even if it's just private satisfaction), and that's OK. A good act is a good act, regardless of the internal thoughts that triggered it.\",\n        \"points\": null,\n        \"depth\": 1,\n        \"children\": [\n          {\n            \"author\": \"tptacek\",\n            \"text\": \"The pay raise made it easy for Gravity to recruit, but the retention benefits are unclear (some employees left due to the raise). It does not appear to have improved customer retention. It's unclear whether the raise was a net positive for the company. The subtext of the story is that the raise was an unqualified win for one person, though: Dan Price.\",\n            \"points\": null,\n            \"depth\": 2,\n            \"children\": [\n              {\n                \"author\": \"whatok\",\n                \"text\": \"You could actually make a decent comparison between Gravity and companies appeasing Wall Street by juicing quarterly earnings or buying back stock. If Gravity is spending an inordinate amount on employee pay and it's not accompanied by corresponding growth... well we all know what happens then.\",\n                \"points\": null,\n                \"depth\": 3\n              },\n              {\n                \"author\": \"isleyaardvark\",\n                \"text\": \">(some employees left due to the raise) 2 employees out of 120.\",\n                \"points\": null,\n                \"depth\": 3,\n                \"children\": [\n                  {\n                    \"author\": \"tptacek\",\n                    \"text\": \"That's how many left because of the raise. We don't know what their overall employee turnover is.\",\n                    \"points\": null,\n                    \"depth\": 4\n                  }\n                ]\n              }\n            ]\n          },\n          {\n            \"author\": \"stevesearer\",\n            \"text\": \"Did he actually give all employees equal pay, or did he just raise the starting salaries to $70k/year? those two things are quite different.\",\n            \"points\": null,\n            \"depth\": 2\n          },\n          {\n            \"author\": \"DanBC\",\n            \"text\": \"People criticise mother theresa because she believed that suffering was a gift from god and because of that she didn't allow pain medication to be used in her \\\"hospices\\\". And her hospices didn't separate the curable from the untreatable, so a bunch of people died needlessly.\",\n            \"points\": null,\n            \"depth\": 2,\n            \"children\": [\n              {\n                \"author\": \"smt88\",\n                \"text\": \"That's very interesting! I haven't seen that specific (and horrifying) criticism. What I've seen was from Christopher Hitchens, who said that she wasn't a \\\"good\\\" person because her primary motivation was to proselytize, as she believed Jesus instructed her to do. My comment was creating an analogy between those two: Dan Price doing something awesome for his employees because of a lawsuit is something like Mother Theresa serving the poor because she believed it was how she would have a good afterlife. I don't know if either of those motivations are true. It's impossible to know someone's motivations with certainty. That's why I think an action and its consequences are the thing to focus on. If it's true, as the article says, that Dan Price is creating the cult of Dan Price (a do-gooder-CEO kind of thing), great! Even if he's just some narcissist who wants people to love him, I'm happy that another wealthy person is pursuing some form of humanitarianism. All the really \\\"good\\\" people might be narcissists, for all we know!\",\n                \"points\": null,\n                \"depth\": 3,\n                \"children\": [\n                  {\n                    \"author\": \"stuaxo\",\n                    \"text\": \"Did you see the Christopher Hitchens documentary? There seems to be quite a lot of detail in it beyond just her motivation being to proselytize..\",\n                    \"points\": null,\n                    \"depth\": 4\n                  }\n                ]\n              }\n            ]\n          }\n        ]\n      },\n      {\n        \"author\": \"whatok\",\n        \"text\": \"He's parading around as an altruistic person when the evidence seems to suggest he's not. Many people argued that giving arbitrary raises is a bad way to run a business and probably unsustainable. If the raises were given for reasons besides he claimed, it gives much more credence to those arguments.\",\n        \"points\": null,\n        \"depth\": 1,\n        \"children\": [\n          {\n            \"author\": \"smt88\",\n            \"text\": \"I'm not sure I understand. How does his motivation for giving the raises have an effect on whether this is a good way to run a business or whether it's sustainable?\",\n            \"points\": null,\n            \"depth\": 2,\n            \"children\": [\n              {\n                \"author\": \"whatok\",\n                \"text\": \"Because businesses are usually run with the business in mind; not the CEO's personal lawsuits.\",\n                \"points\": null,\n                \"depth\": 3,\n                \"children\": [\n                  {\n                    \"author\": \"smt88\",\n                    \"text\": \"I agree that a CEO's decision based on personal issues is bad for a company. For Gravity specifically, is there evidence that it extends beyond this one issue? And, in the context of this one issue at Gravity, it seems to have been a good move (at least what's been made public). Pretty much every long-standing, famous CEO has done something for a personal reason (Jobs' personal vendetta against Samsung/Android for \\\"ripping off\\\" iOS is an example). That doesn't mean most of their decisions are personal, or that they can't run a company incredibly well.\",\n                    \"points\": null,\n                    \"depth\": 4,\n                    \"children\": [\n                      {\n                        \"author\": \"whatok\",\n                        \"text\": \"Jobs' personal vendetta can easily be interpreted as public theatrics for business reasons. Making a business decision because you are personally getting sued is completely different. Let me frame it this way. Let's say I was working there and thought I was getting underpaid. I started interviewing, found a job paying 65k, and was about to take it. There's some grand announcement about how everyone will get 70k and I decide, great, I'll stay. Had I been provided with what looks to be the real reason behind the raise, I may have elected to jump ship for less money.\",\n                        \"points\": null,\n                        \"depth\": 5\n                      }\n                    ]\n                  }\n                ]\n              }\n            ]\n          },\n          {\n            \"author\": \"timbuckley\",\n            \"text\": \"It matters very little if he is on the whole \\\"a good person\\\" (I make no claim one way or the other). What is interesting to most including myself is how his 70k minimum salary works for the company. That act alone, whatever the reason, is likely a \\\"good\\\" thing in that he is sacrificing his own income to help others less fortunate for himself. If there are ulterior motives, or if he has had a lifetime of bad deeds until now I'm not terribly interested.\",\n            \"points\": null,\n            \"depth\": 2,\n            \"children\": [\n              {\n                \"author\": \"whatok\",\n                \"text\": \"Can't say for certain without seeing the financials but having the real reason for pay increases raises red flags for me. I view it as a short-term gamble that could potentially lead to future layoffs/bankruptcy. In a worst case scenario, would it still be okay to you if the pay increases were granted because of personal circumstance and later led to people losing their jobs?\",\n                \"points\": null,\n                \"depth\": 3\n              }\n            ]\n          }\n        ]\n      },\n      {\n        \"author\": \"merpnderp\",\n        \"text\": \"Ayn Rand would have been pleased that a CEO decided what was a fair deal between the company and its employees, based on whatever reason they decided was important to the success of the company.\",\n        \"points\": null,\n        \"depth\": 1\n      }\n    ]\n  },\n  {\n    \"author\": \"eljimmy\",\n    \"text\": \"I read about 60% of that article and had to stop. It felt like I was reading some sort of pseudo-soap opera script.\",\n    \"points\": null,\n    \"depth\": 0,\n    \"children\": [\n      {\n        \"author\": \"deelowe\",\n        \"text\": \"I read the whole thing, but I agree, this style of journalistic writing can't end soon enough.\",\n        \"points\": null,\n        \"depth\": 1,\n        \"children\": [\n          {\n            \"author\": \"grp\",\n            \"text\": \"Yep, it seems to me that it's only an ad (hidden in the last paragraph) for the book about that salary thing. Basically, this guy want to use the Paris Hilton Syndrom to growth. I'll be famous coz I'm rich coz I'm famous coz...\",\n            \"points\": null,\n            \"depth\": 2\n          }\n        ]\n      }\n    ]\n  },\n  {\n    \"author\": \"aswanson\",\n    \"text\": \"The plank meeting idea seems good.\",\n    \"points\": null,\n    \"depth\": 0\n  },\n  {\n    \"author\": \"brianlweiner\",\n    \"text\": \"I can't imagine being forced to 'plank' during an office meeting.\",\n    \"points\": null,\n    \"depth\": 0\n  },\n  {\n    \"author\": \"adharmad\",\n    \"text\": \"The Twentieth century motor company\",\n    \"points\": null,\n    \"depth\": 0\n  },\n  {\n    \"author\": \"littletimmy\",\n    \"text\": \"I'd be skeptical of this piece. There's been one hit piece after another against this guy from the conservative/business media. It is possibly that he's a shady character, but it is also possible that some people are Really upset at him establishing a pay floor of $70k a year. We should suspend judgment until we have further evidence.\",\n    \"points\": null,\n    \"depth\": 0\n  },\n  {\n    \"author\": \"AznHisoka\",\n    \"text\": \"The CEO just sounds desperate for attention, as if he's a cult leader. Seriously, planks during meetings? I'd quit right then and there. Just sounds like an immature person that just wants to start a business because he'll get to implement all these quirky, utopic policies. Also, just very low emotional intelligence for not thinking about the people who got paid highly and deserved it. You didn't hire robots - you hired human beings with real emotions.\",\n    \"points\": null,\n    \"depth\": 0,\n    \"children\": [\n      {\n        \"author\": \"drewrv\",\n        \"text\": \"Maybe I suck at emotional intelligence, but why would a highly paid employee be upset that lower paid employees are getting a raise?\",\n        \"points\": null,\n        \"depth\": 1,\n        \"children\": [\n          {\n            \"author\": \"eemikula\",\n            \"text\": \"The argument usually goes that some people deserve to be paid more than others based on more specialized skills, more experience, etc. That it's unfair to be paid the same as someone who's doing a more entry-level position than yourself. This is not my argument, but it's what I've been told when I've had this discussion before.\",\n            \"points\": null,\n            \"depth\": 2\n          },\n          {\n            \"author\": \"whatok\",\n            \"text\": \"Let's say I'm a college graduate (with accompanying student loan debt) and you're a high school grad. We both get jobs at the same company and you're paid 40k while I'm paid 60k. If we both get raises to 70k, I am still stuck with my student loan debt while getting paid the same as someone who did not need to spend years in school or take on student debt.\",\n            \"points\": null,\n            \"depth\": 2,\n            \"children\": [\n              {\n                \"author\": \"rjvir\",\n                \"text\": \"But why would the other person's salary affect you?\",\n                \"points\": null,\n                \"depth\": 3,\n                \"children\": [\n                  {\n                    \"author\": \"whatok\",\n                    \"text\": \"Because of the reasons listed in my original post. If I had to sacrifice time and money to graduate from college to qualify for a job and an arbitrary raise provides the same compensation to someone who does not have a college degree, it devalues my degree. On top of that, besides the degree getting devalued, I still have the original student debt amount.\",\n                    \"points\": null,\n                    \"depth\": 4,\n                    \"children\": [\n                      {\n                        \"author\": \"etiene\",\n                        \"text\": \"But you had 60k before and now you have 70k... I'm sorry but your line of thought makes no sense at all to me. I'd be fine with it.\",\n                        \"points\": null,\n                        \"depth\": 5,\n                        \"children\": [\n                          {\n                            \"author\": \"AznHisoka\",\n                            \"text\": \"As another posted said it makes complete sense. Psychology 101: https://en.m.wikipedia.org/wiki/Relative_income_hypothesis\",\n                            \"points\": null,\n                            \"depth\": 6\n                          }\n                        ]\n                      }\n                    ]\n                  },\n                  {\n                    \"author\": \"jacalata\",\n                    \"text\": \"People care more about their position relative to others than their actual income https://en.m.wikipedia.org/wiki/Relative_income_hypothesis\",\n                    \"points\": null,\n                    \"depth\": 4\n                  }\n                ]\n              },\n              {\n                \"author\": \"theworstshill\",\n                \"text\": \"Except that happens all the time, you just don't know about it. This is what its all about - transparency and disclosure. If you keep the first guy in the dark (as 98% of corporations do), he doesn't feel \\\"bad\\\" enough to get out and you trim some cash on both.\",\n                \"points\": null,\n                \"depth\": 3\n              }\n            ]\n          }\n        ]\n      },\n      {\n        \"author\": \"bsg75\",\n        \"text\": \"\\\"Gravity staffers plank during meetings to encourage each other to speak quickly.\\\" > Seriously, planks during meetings? Sounds like an idea formed by people who don't really know how to run a business, and are looking for new and creative ways to get attention in the media. The salary thing may be in the same category, and time will tell if the formula works well for the employees, or cuts their future total income short if the company can't keep momentum. I would probably quit too. During a planking session. Grubbing around on the floor is no way to hold a meeting.\",\n        \"points\": null,\n        \"depth\": 1\n      }\n    ]\n  },\n  {\n    \"author\": \"sageikosa\",\n    \"text\": \"I stopped at the plank during meetings bit...\",\n    \"points\": null,\n    \"depth\": 0\n  },\n  {\n    \"author\": \"jisaacstone\",\n    \"text\": \"I went to high school with this guy, and used his company as a payment processor when I was running a small retail shop. That was about 4 years ago. really did a good job nailing down the small merchant niche by removing dumb fees like 'drop fee' and 'statement fee' It's been really weird to see everyone's reaction to this thing. Surreal almost. Didn't see Notch get this kind of hate when he shared his bonus with all employees. Perhaps it's because he works in the financial industry?\",\n    \"points\": null,\n    \"depth\": 0,\n    \"children\": [\n      {\n        \"author\": \"whatok\",\n        \"text\": \"I had to Google \\\"notch bonus\\\" to find out what you were talking about. Maybe when you don't have a press campaign accompanying things it flies under the radar and seems more sincere.\",\n        \"points\": null,\n        \"depth\": 1\n      },\n      {\n        \"author\": \"Someone1234\",\n        \"text\": \"It is because he is promoting \\\"evil\\\" socialist ideas that go against the very grain of capitalism (essentially sharing the wealth, and sharing the profits). He's upset a lot of rich and powerful people who don't want their poor underlings to start asking why they aren't benefiting from the company's growth or profit margins. Essentially he upset the status quo.\",\n        \"points\": null,\n        \"depth\": 1,\n        \"children\": [\n          {\n            \"author\": \"zymhan\",\n            \"text\": \"This guy is not the first person in history to pay his employees well. You're sadly mistaken if you think this guy is some socialist hero to the working class.\",\n            \"points\": null,\n            \"depth\": 2,\n            \"children\": [\n              {\n                \"author\": \"Someone1234\",\n                \"text\": \"He isn't. But he is seen that way by others, and that's why upset THEM. This is more about them and how they perceive it (and the associated media) than about him directly.\",\n                \"points\": null,\n                \"depth\": 3\n              }\n            ]\n          },\n          {\n            \"author\": \"cpwright\",\n            \"text\": \"It would be fine for him to share the profits, if the profits were his to share. The lawsuit seems to be that he was paying himself salary instead of distributing profits to cut out the minority shareholder's from their rightful percentage of profits (turning profits into his own salary). Then it sounds like to spite his brother (the minority partner) he came up with a self-promoting way to give those profits to other people; and enrich himself through speaking deals, etc. again at the expense of the minority partner.\",\n            \"points\": null,\n            \"depth\": 2\n          }\n        ]\n      },\n      {\n        \"author\": \"jsprogrammer\",\n        \"text\": \">Perhaps it's because he works in the financial industry? It could be. There is definitely an adversarial relationship between owners and employees (both are competing for the same pie, in most models) and I'm comfortable guessing that many in the finance industry (including the industry media) identify more strongly with owners than employees. If such an identity is stronger, it's more than reasonable to expect that those with that identity will show undue bias towards those who seem to have a similar identity and against those who may be viewed as a type of adversary. The industry appears to be founded on the idea of all profits flowing to owners. It seems reasonable that the industry would generally reject alternative models with little thought.\",\n        \"points\": null,\n        \"depth\": 1\n      },\n      {\n        \"author\": \"lifeformed\",\n        \"text\": \"With Notch's situation, Mojang feels like a small team of people who built a single video game together (whether or not that's actually the case), so profit-share seems like a reasonable response. Gravity feels like just a \\\"normal\\\" company, a 9-5 white collar desk job, indistinguishable from other ones. Most people can relate to that kind of situation more than an indie game team.\",\n        \"points\": null,\n        \"depth\": 1,\n        \"children\": [\n          {\n            \"author\": \"peppage\",\n            \"text\": \"Do you think America vs Sweden has anything to do with it?\",\n            \"points\": null,\n            \"depth\": 2,\n            \"children\": [\n              {\n                \"author\": \"DaveWalk\",\n                \"text\": \"I was going to suggest the same -- I don't think Notch would be doing 24 TV interviews in 3 days, including at Fox, about his company's payroll. I think it wouldn't stick, because he is foreign and the US news-watching public would assume it's just a weird thing that a foreigner might do.\",\n                \"points\": null,\n                \"depth\": 3\n              }\n            ]\n          }\n        ]\n      }\n    ]\n  },\n  {\n    \"author\": \"Someone1234\",\n    \"text\": \"This article slings a lot of mud but little of it sticks. The main thrust of their issue is (paraphrasing) \\\"He should have been paid about 470K, not 1.1mil\\\" (before he cut his pay and gave it to his staff). But in a private business the owners can pay themselves whatever they want as long as all owners agree to it. The lawsuit is likely related to how not all owners agreeing with his 1.1 mil pay packet, and the article is arguing that his decision to cut it and give it away was because he knew the lawsuit was incoming (to head it off, essentially). They try to raise a lot of other issues (e.g. that he claimed client turnover was 30%, when they claim it is 16% and up, but definitely less than 30%), but much of it comes across as almost petty, like they had one big interesting claim and tried to pad it out with a bunch of minor mis-speaking or other miscellaneous issues. Ultimately it reads like a hit piece. Really they're just re-hashing the lawsuit and have nothing else to add of value.\",\n    \"points\": null,\n    \"depth\": 0,\n    \"children\": [\n      {\n        \"author\": \"zymhan\",\n        \"text\": \"> the article is arguing that his decision to cut it and give it away was because he knew the lawsuit was incoming (to head it off, essentially). That is not what the article is saying at all. It says that he initiated this pay raise after being sued because he payed himself too much.\",\n        \"points\": null,\n        \"depth\": 1,\n        \"children\": [\n          {\n            \"author\": \"sophacles\",\n            \"text\": \"There is literally no difference between gp and what you are saying.\",\n            \"points\": null,\n            \"depth\": 2\n          }\n        ]\n      },\n      {\n        \"author\": \"tptacek\",\n        \"text\": \"The article is not very well written, but the thrust of the article isn't that Price is overpaid (although the authors clearly think he is, and it's a little hard to argue that he wasn't). The main thrust is that the narrative Price has been putting forward about the nature of the litigation against him is false. The evidence suggests that rather than being sued by his brother because his mass employee raise robbed the brother of profits, the raise was instead a tactic he used to minimize the profits of the company and thus his brother's claims on those profits. That's because it turns out the lawsuit predates the raises, even though Dan Price denies that, even when confronted by the reporter with evidence to the contrary.\",\n        \"points\": null,\n        \"depth\": 1\n      }\n    ]\n  },\n  {\n    \"author\": \"jonknee\",\n    \"text\": \"Well that was a waste of words. The tl;dr seems to be he used to pay himself a lot (which he has told everyone), now he pays a lot of people more than before (which he has told everyone), is stressed out that his brother is suing him (which he told everyone) and likes publicity (which is obvious).\",\n    \"points\": null,\n    \"depth\": 0\n  },\n  {\n    \"author\": \"thebokehwokeh2\",\n    \"text\": \"TL;DR: This is a run of the mill hit piece. Save yourself the trouble and don't waste your time reading this drivel.\",\n    \"points\": null,\n    \"depth\": 0\n  },\n  {\n    \"author\": \"tptacek\",\n    \"text\": \"This piece is pretty long for the little bit of new information it provides, so here's what I believe is the nut of the piece: Dan Price co-owned Gravity with his brother Lucas. Dan Price became famous for raising his employees salaries so that none made under $70,000. Shortly he did that, a story broke that Dan was being sued by his brother Lucas, who was demanding that Dan buy his stake out. Dan and his spokespeople represented to the media that the suit was a reaction to the pay raise, which reduced profits for owners to pay employees. But it turns out that Dan was served for the lawsuit before the pay raise, and that Dan's legal response to the suit also precedes the raise. It does not seem likely that the lawsuit had anything to do with the raise. It is now plausible (but unproven) that the raise was a tactical reaction to the suit. Furthermore, Dan Price's ex-wife alleges that Dan was physically violent to her. And, Dan Price's own salary is anomalously high given the details of the company. That's pretty much it.\",\n    \"points\": null,\n    \"depth\": 0,\n    \"children\": [\n      {\n        \"author\": \"whatok\",\n        \"text\": \"Thank you for writing what I was too lazy to do.\",\n        \"points\": null,\n        \"depth\": 1\n      }\n    ]\n  },\n  {\n    \"author\": \"sowhatquestion\",\n    \"text\": \"The stuff about him overpaying himself is bad enough, but why isn't anyone talking about his ex-wife's allegations at the end of this piece? (Charitable interpretation: people didn't make it that far bc this thing is so poorly written.) Anyway, she's about to go on the record in a very public way (TED talk) claiming he hit her and \\\"waterboarded\\\" her. It's despicable in its own right if true, and it points to a larger pattern of dishonesty.\",\n    \"points\": null,\n    \"depth\": 0,\n    \"children\": [\n      {\n        \"author\": \"timbuckley\",\n        \"text\": \"Probably because they are allegations. If they are found true he should and will be punished. But until then, he is innocent until proven guilty. I don't see the point in a witch hunt.\",\n        \"points\": null,\n        \"depth\": 1,\n        \"children\": [\n          {\n            \"author\": \"sowhatquestion\",\n            \"text\": \"I don't see the rest of the article being treated with this level of skepticism.\",\n            \"points\": null,\n            \"depth\": 2\n          }\n        ]\n      }\n    ]\n  },\n  {\n    \"author\": \"et2o\",\n    \"text\": \"Well this is a hit piece.\",\n    \"points\": null,\n    \"depth\": 0\n  },\n  {\n    \"author\": \"theworstshill\",\n    \"text\": \"Its incredible how hard the sharks are trying to discredit this guy. I recall reading about Gravity on marketwatch several months ago, comments were full of expletives and certainty that the company would go bankrupt. Dumbasses. The benefits are obvious to anyone with half a brain - significantly better retention, a large pool of motivated applicants to choose from, and more companies doing business with them (mostly based on the ethics \\\"brand\\\"). The guy got first mover advantage here. Good for him.\",\n    \"points\": null,\n    \"depth\": 0\n  },\n  {\n    \"author\": \"Overtonwindow\",\n    \"text\": \"Why do we always have to tear people down for doing something good? Who cares their motivations, reasons, or response? I give the guy credit for doing something radical that improves peoples lives. I don't care about what Dan Price may or may not be getting out of this. I'm more interested in the experiment itself, and the employees. To me this is nothing more than a hit piece.\",\n    \"points\": null,\n    \"depth\": 0\n  }\n]"
}