[
  {
    "author": "austenallred",
    "text": ">App Review continues to take at least a weekThat must be the most frustrating/annoying thing in the world.> there are technical limitations imposed by the Mac App Store guidelines (sandboxing and so on) that limit some of the features we want to bring to SketchI'm sure there are good intentions to what Apple is doing there, but it would be nice to know more details.> and upgrade pricing remains unavailableMan, the Mac App Store really just needs to up its game.",
    "points": null,
    "time": "2015-12-01T15:24:10.000Z"
  },
  {
    "author": "p0la",
    "text": "+ having a China wall between review (that are on the app store) and the support (that you may implement in your app if you wish) isn't so great.When selling on Amazon for example, you have a ready to use support platform that allow you to easily interact with customers that seem to be strugling. I feel this really helps avoiding unnecessary frustrations.Also, the best moment to collect feedback is when people are in review mode. And when your users get in review mode, they got straight to the app store where you can't reach them.",
    "points": null,
    "time": "2015-12-01T15:35:18.000Z"
  },
  {
    "author": "roosterjm2k2",
    "text": "The intention of most of their decisions is more about their own money...Case in point, it took forever for chrome or opera to come to iOS because they \"competed\" with the apple product already integrated into the OS, and \"provided a less seamless user experience\" ... basically, Apple didn't want to be outshined on their own platform...",
    "points": null,
    "time": "2015-12-01T15:51:55.000Z"
  },
  {
    "author": "scarface74",
    "text": "That's not true. Apple allowed third party browsers - as long as they used WebKit - from day one when the app store opened.",
    "points": null,
    "time": "2015-12-01T16:18:49.000Z"
  },
  {
    "author": "Karunamon",
    "text": "Which makes them not really third party browsers anymore, they're basically frames around a UIWebView (which is Safari) which can't do anything interesting.",
    "points": null,
    "time": "2015-12-01T16:29:38.000Z"
  },
  {
    "author": "sosborn",
    "text": "UIWebView and Safari are different things. Yes, Safari uses (essentially) UIWebView, but a browser is much more than its rendering engine.",
    "points": null,
    "time": "2015-12-01T17:34:50.000Z"
  },
  {
    "author": "Karunamon",
    "text": "The important bit there is \"do anything interesting\". Forget about any plugins that directly manipulate the markup (so no µ/adblock, no ghostery, no noscript).Yeah, they can display web pages, but iOS Firefox/Chrome provide almost no benefits over the stock safari. Less in fact, since it's a near certainty that Safari is using privileged APIs to integrate with the OS in a way that no other browsers are allowed to.(Didn't a very prominent company get sued for something along these lines back in the 90s?)",
    "points": null,
    "time": "2015-12-01T17:40:07.000Z"
  },
  {
    "author": "sosborn",
    "text": "You can actually load whatever you want into a UIWebView. You could do the request, manipulate the response and display your modified HTML.Adblocking is of course now integrated into the OS.",
    "points": null,
    "time": "2015-12-01T18:17:39.000Z"
  },
  {
    "author": "simonh",
    "text": "I'm not sure who you're quoting with those quote marks. It's not Apple though, because I don't believe they ever said any such thing.The reason Apple has always given is security. This is the reason they gave for not allowing third party access to the JIT version of the javascript engine. Their critics at the time claimed this was really because they didn't want other browsers competing with Safari, and they'd never let anyone have it because of that. Then when Apple developed the XPC framework allowing secure remote execution, they opened up the JIT engine to third party browsers in a secure way.So far Apple's actual behaviour has been completely consistent with their stated reasons, which are not the reasons you are 'quoting' from somewhere, and in several respect contrary to the predictions of their critics. Isn't it possible that they are being honest about their motives?But on the other hand, yes, the Mac App Store is a broken mess. Right now it's part of the problem with app distribution on the desktop, not part of the solution.",
    "points": null,
    "time": "2015-12-01T16:58:03.000Z"
  },
  {
    "author": "pcwalton",
    "text": "> The reason Apple has always given is security. This is the reason they gave for not allowing third party access to the JIT version of the javascript engine.This doesn't make sense. You could disable the JIT, compile WebKit to native code, and ship it on iOS without the app requiring any more technical permissions. Apple just doesn't want you to do that for business reasons.If you want to maintain that it's a security measure, there should be a specific attack concept you can describe that preventing alternative browser engines (suitably modified to work with W^X) stops.",
    "points": null,
    "time": "2015-12-01T17:40:21.000Z"
  },
  {
    "author": "hapless",
    "text": "You're free to do exactly that. Nothing stops you from publishing a web browser that renders static HTML. But the only way to include a JS interpreter is to use the Apple-provided WebKit.Language interpreters are forbidden to download any code from the internet, so you cannot use JS found on a web page in your own interpreter.",
    "points": null,
    "time": "2015-12-01T21:21:00.000Z"
  },
  {
    "author": "pcwalton",
    "text": "> Nothing stops you from publishing a web browser that renders static HTML.That would not remotely be a practical Web browser in 2015.> Language interpreters are forbidden to download any code from the internet, so you cannot use JS found on a web page in your own interpreter.Which is a business decision.I don't understand why this is controversial; it's well-established that many of the iOS restrictions are business-related. Note that I'm not even arguing here that those business-related restrictions are a bad thing.",
    "points": null,
    "time": "2015-12-01T23:33:07.000Z"
  },
  {
    "author": "simonh",
    "text": "Your comment doesn't make sense. You've always been able to embed the renderer with non-JIT JavaScript. Now you can build an app with full JIT embedded, so saying they don't want you to for business reasons is obviously false. They do let you do it.The attack vector they're concerned about is to do with the JIT exposing access to shared memory. As for alternate engines, any such engine would need to include a JavaScript engine, which immediately opens up vectors for attack. That's why the ability to download and execute code is restricted. now, thanks to a robust and secure cross process communications framework, many restrictions that were supposedly 'for business reasons' have been lifted.",
    "points": null,
    "time": "2015-12-01T22:43:56.000Z"
  },
  {
    "author": "pcwalton",
    "text": "> Your comment doesn't make sense. You've always been able to embed the renderer with non-JIT JavaScript.Apple's renderer. Not your own custom one.> The attack vector they're concerned about is to do with the JIT exposing access to shared memory.I don't know what \"exposing access to shared memory\" means. All applications that download data place potentially-hostile data into memory.> As for alternate engines, any such engine would need to include a JavaScript engine, which immediately opens up vectors for attack.Such as? Describe a specific attack that is prevented by forbidding interpreters of remote content.> That's why the ability to download and execute code is restricted.Downloading and interpreting code is something that even a PDF viewer does. Why is that not restricted?> now, thanks to a robust and secure cross process communications framework, many restrictions that were supposedly 'for business reasons' have been lifted.But not the restriction on alternate Web engines.",
    "points": null,
    "time": "2015-12-01T23:32:14.000Z"
  },
  {
    "author": "kybernetyk",
    "text": ">That must be the most frustrating/annoying thing in the world.Yes, and sometimes it gets even more frustrating when you get rejected for some minor issue like \"the app name in the help menu is mis-spelled\". An issue that takes you 3 minutes to fix and re-upload. And then you need to wait another 7 days. (If you're unlucky they find something else for 7 days more of waiting time).",
    "points": null,
    "time": "2015-12-01T16:36:33.000Z"
  },
  {
    "author": "makecheck",
    "text": "If they're doing that level of scrutiny a million times, they should have released a tool (or even built it into Xcode); something like \"Consistency Checker\".It's silly of them to reject apps entirely over checks that anyone could do in advance, if only they knew what to look for.",
    "points": null,
    "time": "2015-12-01T17:14:31.000Z"
  },
  {
    "author": "ssutch3",
    "text": "There are a lot of automated tests that the upload program and receiving web service already do. But \"quality checking\" is left up to a human editor.",
    "points": null,
    "time": "2015-12-01T19:09:28.000Z"
  },
  {
    "author": "shawn-furyan",
    "text": "Not only would it be nice, but if such an application exists internally at Apple, and they released it with Xcode or something, then perhaps developers could integrate it into their testing infrastructure. If that chain of events happened, then it could bring up the consistency of Apple-centric OS 3rd party software, all the while decreasing time that updates spend in review. This sort of change could be a huge win for Apple, iOS/OSX Developers, and iOS/OSX users.",
    "points": null,
    "time": "2015-12-01T19:24:01.000Z"
  },
  {
    "author": "copperx",
    "text": "Oh, they have ; but it doesn't do that many checks.",
    "points": null,
    "time": "2015-12-02T08:02:52.000Z"
  },
  {
    "author": "song",
    "text": "I avoid buying from the mac app store as much as possible.If Apple ever decided to change mac os x to no longer allow external applications, I would switch to Linux right away. I don't want to do that because I do like the os X better a GUI... But there's no way I'd stay on a system that wouldn't allow me to do what I want with it.",
    "points": null,
    "time": "2015-12-01T15:27:37.000Z"
  },
  {
    "author": "atonse",
    "text": "EDIT: That would be suicide (for the whatever 5% of their sales the mac brings in!). If they imposed a rule like that AND continued to neglect the app store the way they do, droves of developers would leave.Unless they rethink or overhaul their sandboxing system to allow a bigger class of applications (essentially, most of what's out there), they won't be able to move power users to the App Store.",
    "points": null,
    "time": "2015-12-01T15:35:10.000Z"
  },
  {
    "author": "Alex3917",
    "text": "> That would be suicideMost big companies commit suicide. If you think OS X and the MacBook Pro users are being neglected now, just wait until they have the car.",
    "points": null,
    "time": "2015-12-01T15:46:46.000Z"
  },
  {
    "author": "robotcookies",
    "text": "I feel the same way. And it's funny how many people think along similar lines and then go straight to their iPhone without a second thought. It's as if because it's always been that way with the iPhone (no external apps) that it makes it ok.",
    "points": null,
    "time": "2015-12-01T16:08:44.000Z"
  },
  {
    "author": "sinatra",
    "text": "I think one reason is that you use your Mac to create/develop, whereas you use your iPhone to consume (I'm obviously generalizing). You need more flexibility and control with tools that you use to create/develop.",
    "points": null,
    "time": "2015-12-01T16:15:31.000Z"
  },
  {
    "author": "SneakerXZ",
    "text": "Because limitations imposed by iOS are not limiting me from things that I want to do and benefits outweighs negatives.",
    "points": null,
    "time": "2015-12-01T18:04:59.000Z"
  },
  {
    "author": "song",
    "text": "I only have an iPhone because I need to have one for testing and developing. I've always kept my iphone jailbroken for this very reason.",
    "points": null,
    "time": "2015-12-02T12:31:52.000Z"
  },
  {
    "author": "greggarious",
    "text": "I would switch if I could find a good open source RAW image editor to rival Photoshop.",
    "points": null,
    "time": "2015-12-01T16:10:13.000Z"
  },
  {
    "author": "sscotth",
    "text": "Or simply a linux port of the creative suite?",
    "points": null,
    "time": "2015-12-01T16:19:42.000Z"
  },
  {
    "author": "bjacobel",
    "text": "Yeah, simply.",
    "points": null,
    "time": "2015-12-01T16:48:40.000Z"
  },
  {
    "author": "waz0wski",
    "text": "Not a direct photoshop replacement, but for specific photo editing of RAW photos, have you tried darktable? (http://www.darktable.org/)It's not as good as Lightroom, but I'd say it's 80% of the way there, and you can replicate some of the missing functionality with other applications.",
    "points": null,
    "time": "2015-12-01T16:24:42.000Z"
  },
  {
    "author": "mrschwabe",
    "text": "The latest Photoshop on Linux is quite attainable; I have CC running smoothly via VMWare Worksation 12 / Windows 7 (new versions of VMWare have DirectX/OpenGL and let you allocate GPU memory)... but unfortunately that combines 2 proprietary solutions so guess it doesn't exactly fit your criteria.",
    "points": null,
    "time": "2015-12-01T16:29:30.000Z"
  },
  {
    "author": "odbol",
    "text": "So \"Photoshop on Linux\" means \"Photoshop on Windows on Linux\"... that's not really a solution. That's Windows.",
    "points": null,
    "time": "2015-12-01T22:04:20.000Z"
  },
  {
    "author": "mrschwabe",
    "text": "Heh, good point at least though with this setup you don't have to boot into it or use it for anything else.",
    "points": null,
    "time": "2015-12-01T23:19:13.000Z"
  },
  {
    "author": "chipuni",
    "text": "I've been using RawTherapee for a few months. It doesn't rival Photoshop, but it is useful.",
    "points": null,
    "time": "2015-12-01T17:21:43.000Z"
  },
  {
    "author": "Keats",
    "text": "Photoshop runs pretty well on virtualbox last time I tried it (~6 months ago). That was for very very basic projects though, not sure how it behaves in big ones",
    "points": null,
    "time": "2015-12-01T20:36:21.000Z"
  },
  {
    "author": "jp555",
    "text": "> there's no way I'd stay on a system that wouldn't allow me to do what I want with it.But there's a big difference between allowing you to do something and allowing you to not change the way you do something.",
    "points": null,
    "time": "2015-12-01T16:27:25.000Z"
  },
  {
    "author": "jnbiche",
    "text": "> But there's a big difference between allowing you to do something and allowing you to not change the way you do something.I've read this sentence 5 times and I'm still not sure what you mean. Can you expound, please?I'd say that semantics aside, it's pretty black and white: either OSX allows users to install apps as they please, or they don't.",
    "points": null,
    "time": "2015-12-01T16:36:22.000Z"
  },
  {
    "author": "jp555",
    "text": "I just mean it's easy to conflate a reluctance to change one's process with changing software capabilities.I prefer to edit video on iOS over Windows/OSX but it required me to change how I get video editing done.",
    "points": null,
    "time": "2015-12-01T17:40:24.000Z"
  },
  {
    "author": "tomphoolery",
    "text": "> If Apple ever decided to change mac os x to no longer allow external applications, I would switch to Linux right away.Even if that did happen, which it wouldn't, what would stop you from compiling the application yourself, theoretically? If Apple computers allow for compilation of their own software, which they probably always will given that a Mac is the only way you can make OS X or iOS apps at this time, then OS X will never get to a point like the iPad wherein you are very limited in what you can do.",
    "points": null,
    "time": "2015-12-01T16:37:51.000Z"
  },
  {
    "author": "eveningcoffee",
    "text": "What if they restrict running compilers?Edit: I see from down votes that people disagree with this idea (no problem with that).Still, why not?You need a developer licence for iOS that effectively means that you are restricted to run compilers on iOS.Why not extend it to OSX?",
    "points": null,
    "time": "2015-12-01T16:40:03.000Z"
  },
  {
    "author": "SneakerXZ",
    "text": "Because you would lose your customers. If my operating system limits me from doing things that I can do on other platforms and I want to do them, I will simply not use the system.Are you realizing Mac is used also by creative people that use Adobe tools, tools for 3D and so on and if everything was sandboxed you couldn't do it anymore.",
    "points": null,
    "time": "2015-12-01T18:03:32.000Z"
  },
  {
    "author": "djloche",
    "text": "Apple's core customers are iPhone and iPad customers now. They realized that catering to consumer electronics customers is far more profitable than catering to pc power users, and adjusted everything to fit the profit model that makes them the most money. At times, I wish they had spun off Apple Computer as a separate entity with OS X so that the computer division wouldn't have to sit and play fourth seat to the rest of the business.",
    "points": null,
    "time": "2015-12-01T18:44:32.000Z"
  },
  {
    "author": "SneakerXZ",
    "text": "They sell a lot of Macs http://9to5mac.com/2015/10/27/apple-earnings-fy15-q3-2/ Killing that segment would be silly from them.",
    "points": null,
    "time": "2015-12-01T18:57:32.000Z"
  },
  {
    "author": "djloche",
    "text": "It is silly, yet Apple continues to do things that are hostile to power users.",
    "points": null,
    "time": "2015-12-01T20:48:02.000Z"
  },
  {
    "author": "jkestner",
    "text": "To reply to sibling: Apple has never catered to PC power users, going back to Jobs arguing against slots in the Apple ][ and getting his way in the first Mac. That a Mac user at all is now considered a power user indicates which way the wind is blowing. Apple's pointed in the right direction.Given that the PC is an increasingly obsolete platform for most people, I don't think Apple's going to expend a lot of energy changing the status quo one way or another. Its style is to start over from scratch.",
    "points": null,
    "time": "2015-12-01T18:59:31.000Z"
  },
  {
    "author": "SneakerXZ",
    "text": "Their ecosystem is powered by power users, who do you think is creating apps, games, design, books, videos and so on? If Apple forces to move these users out, they will probably focus on other platforms where they are not so restricted.",
    "points": null,
    "time": "2015-12-01T19:20:08.000Z"
  },
  {
    "author": "eveningcoffee",
    "text": "Are you realizing Mac is used also by creative people that use Adobe tools, tools for 3D and so on.I.e. not programmers but users of software from big software companies.and if everything was sandboxed you couldn't do it anymore.Yes, you could not run arbitrary programs and Apple may see it as a feature.You seem to be in big denial as it would be horrible thing to happen. I still see this as very likely possibility.",
    "points": null,
    "time": "2015-12-01T19:02:00.000Z"
  },
  {
    "author": "SneakerXZ",
    "text": "Of course, it is a horrible thing to happen. Just to give you some apps from my dock.Chrome, Spotify, Outlook, HipChat, Viber, Skype, SourceTree, Atom, Sketch, Dropbox.All these would be not be usable because they are not sandboxed. Basically I would have to install Windows on my Macbook and I would virtualize Mac OS X so I can use Xcode and I would use Windows for everything else.It would be suicide for Mac OS X and if you think Apple is so stupid to do it, okay then...",
    "points": null,
    "time": "2015-12-01T19:17:17.000Z"
  },
  {
    "author": "eveningcoffee",
    "text": "SourceTree, Atom are not needed by an Apple usual user.Others are Apple competitors.It would be suicide for Mac OS X and if you think Apple is so stupid to do it, okay then... They dried to get rid of Google Maps on iOS.",
    "points": null,
    "time": "2015-12-01T19:31:59.000Z"
  },
  {
    "author": "SneakerXZ",
    "text": "What would they gain at the end? I would leave their system and also many others. Thinking people would switch just to Apple products is naive.",
    "points": null,
    "time": "2015-12-01T19:42:41.000Z"
  },
  {
    "author": "eveningcoffee",
    "text": "What would they gain at the end?Control and from there perhaps more money.I would leave their system and also many others.Yes, but what if there are only about 100k of such people?",
    "points": null,
    "time": "2015-12-01T19:49:20.000Z"
  },
  {
    "author": "SneakerXZ",
    "text": "There is too many ifs and perhaps... stop speculating. If it was really good choice, they would already do it.",
    "points": null,
    "time": "2015-12-01T19:54:00.000Z"
  },
  {
    "author": "eveningcoffee",
    "text": "Well, the original question was What if they restrict running compilers? and not What if they remove compilers?.Restriction might be a requirement of special licence.This would effectively remove ability to execute arbitrary code from most of the users.The ones who want to run arbitrary code or develop software will have to pay. If someone complains about this, they would be told to shut up and would be explained how this is actually a benefit for majority of the users.Anyway, I will stop here.Edit: I think that Apple is not doing it only because it is not their focus at the moment.",
    "points": null,
    "time": "2015-12-01T20:05:54.000Z"
  },
  {
    "author": "SneakerXZ",
    "text": "Apple is going actually in opposite way and you can see it with recent changes on iOS. To run apps on iPhone, you don't need to buy a developer licence for 100$ anymore. They support more extensions for apps. On last Apple keynote Microsoft was presenting Microsoft Office running on iPad Pro.The special licence you are talking about actually exists. You can sign your Mac apps with a certificate and it will not ask a user if you want to open it, but this is not restrictive at all. This is actually a benefit because nobody can modify your app so if they would force this, I wouldn't mind. Most of apps that I use are signed anyway.",
    "points": null,
    "time": "2015-12-01T20:41:36.000Z"
  },
  {
    "author": "eveningcoffee",
    "text": "I hope it goes better (the future of liberty in computing seems very dim), but I would be not surprised if it goes to the opposite direction accompanied by big ovations.",
    "points": null,
    "time": "2015-12-01T21:45:12.000Z"
  },
  {
    "author": "x0x0",
    "text": "I don't think apple tried to get rid of maps.Instead, they allowed their contract with google to end and built their own clone to prevent google from using it to blackmail apple.I disagree that's anything like getting rid of google maps, particularly since my partner still uses it on her iphone all the time.",
    "points": null,
    "time": "2015-12-01T19:58:28.000Z"
  },
  {
    "author": "eveningcoffee",
    "text": "Well, I remember it differently. Here is one example: http://www.businessinsider.com/ios-6-removes-google-maps-201...",
    "points": null,
    "time": "2015-12-01T20:23:39.000Z"
  },
  {
    "author": "macintux",
    "text": "A: Business Insider is rarely a source of truth, at least when it comes to anything Apple. \"Click bait\" seems to be their sole goal in life.B: Apple never precluded Google from putting their own Maps app into the store, they simply replaced the preinstalled version with their own when (if memory serves) Google both demanded too much user information and declined to offer vector-based maps",
    "points": null,
    "time": "2015-12-01T20:46:56.000Z"
  },
  {
    "author": "x0x0",
    "text": "which google did by sometime in dec '12",
    "points": null,
    "time": "2015-12-01T21:40:59.000Z"
  },
  {
    "author": "lmm",
    "text": "Maybe you'll only be able to run your own software after getting an expensive code signing certificate and going through an identity verification process. Or it'll be like games consoles, with the \"dev\" versions being different from the retail ones.",
    "points": null,
    "time": "2015-12-01T16:40:16.000Z"
  },
  {
    "author": "oddevan",
    "text": "They're actually moving in the opposite direction. With iOS 9, you no longer need an expensive code signing certificate to load your own software onto an iPhone.",
    "points": null,
    "time": "2015-12-01T16:50:42.000Z"
  },
  {
    "author": "mikeash",
    "text": "You can compile software for iOS too. If you consider this to be an adequate escape hatch for the Mac, then it must also be one for iOS. If OS X \"will never get to a point like the iPad\" then the iPad can't get to that point either!",
    "points": null,
    "time": "2015-12-01T16:52:59.000Z"
  },
  {
    "author": "squeaky-clean",
    "text": "But you can't compile software for iOS on iOS, can you? You'd need an iPad + Mac to compile the software. You don't need {{external machine with different OS}} + Mac to compile OSX software.",
    "points": null,
    "time": "2015-12-01T19:49:48.000Z"
  },
  {
    "author": "mikeash",
    "text": "That is true, so we could limit it to \"if you own a Mac\" then the iPad is not limited. But basically nobody actually bothers to work around the limitations in this way, aside from recent events surrounding f.lux.",
    "points": null,
    "time": "2015-12-01T19:53:46.000Z"
  },
  {
    "author": "rmc",
    "text": "> what would stop you from compiling the application yourself, theoretically?What do you do about third party closed source Mac software?",
    "points": null,
    "time": "2015-12-01T21:08:47.000Z"
  },
  {
    "author": "eveningcoffee",
    "text": "I don't want to do that because I do like the os X better a GUII think that in the current pity world of 16:9 displays, actually Ubuntu has the most logical GUI layout because they conserve the vertical screen real estate as much as possible. This means they merge global toolbar, menu and window title bar when windows are maximized.I see that OSX has followed this trend but their solution seems to be more ad-hoc and application based that it does not feel natural for me.",
    "points": null,
    "time": "2015-12-01T16:38:40.000Z"
  },
  {
    "author": "insanebits",
    "text": "This is relevant on the laptops or devices with smaller screens mostly, 1080p(24in) monitors are fairly common those days which gives more than enough screen estate to fit at least 2 side by side windows, ~100 char width text is recommended width for text reading.And as for linux distro with a good GUI I would suggest looking into Elementary OS which is a ubuntu based and UX oriented. I used it on a daily basis for about 6 months and had good experience (not excellent though, it has some issues but what doesn't?)",
    "points": null,
    "time": "2015-12-01T20:09:10.000Z"
  },
  {
    "author": "CrimsnBlade",
    "text": "I wouldn't be too afraid of the Linux GUIs. With the amount of customization that is available for these you can probably make it operate very similar to the way your OS X GUI does. Granted that could take some extra work on your part.",
    "points": null,
    "time": "2015-12-01T17:09:55.000Z"
  },
  {
    "author": "squeaky-clean",
    "text": "It would take a ton of polish that I don't believe any non-corporate team could accomplish. There is elementaryOS, which is my favorite Linux distro. It's absolutely beautiful and looks a lot like OSX, but OSX is still much more enjoyable to use, for reasons I can't exactly specify.",
    "points": null,
    "time": "2015-12-01T19:59:15.000Z"
  },
  {
    "author": "acchan",
    "text": "If you like the OS X user interface, you'll feel right at home with https://elementary.io",
    "points": null,
    "time": "2015-12-01T17:27:37.000Z"
  },
  {
    "author": "S_A_P",
    "text": "That is my biggest complaint about the Mac App store. I think in general prices have been reduced for most apps. But upgrade pricing is a must for customer retention. If they try to sell me the next version of Logic for 199 Im not buying it. I spent 599 for logic 8 platinum, 129(I think) for logic 9 upgrade and then 199 for Logic pro X. Im not interested in giving them another couple of hundred dollars for a while.",
    "points": null,
    "time": "2015-12-01T15:35:49.000Z"
  },
  {
    "author": "j2bax",
    "text": "Logic Pro is a professional DAW as I'm sure you are aware given your years with it. If you can't afford the $199 upgrade, you should probably just use Garageband for free. Personally I prefer this pricing strategy over requiring a monthly subscription. And $199 is far cheaper than the alternatives.",
    "points": null,
    "time": "2015-12-01T16:31:33.000Z"
  },
  {
    "author": "S_A_P",
    "text": "I agree- however, if you follow what other DAW upgrades cost(and I agree, forget this monthly subscription crap) Studio One Upgrade from 2-3(highest version) - 149 Reason 8 upgrade from any version - 129(sometimes 99) Cubase 8 upgrade - 75Logic is pretty expensive to upgrade for what usually amounts to a free plugin or two and minor functionality increases...",
    "points": null,
    "time": "2015-12-01T17:06:27.000Z"
  },
  {
    "author": "j2bax",
    "text": "I didn't realize they charge so little for their major upgrades. Sorry to assume you didn't do the math.",
    "points": null,
    "time": "2015-12-01T18:44:53.000Z"
  },
  {
    "author": "tjl",
    "text": "Another point, Pro Tools HD is $99/year and $199 for the first year. In that case, $199 is reasonable.",
    "points": null,
    "time": "2015-12-01T19:19:41.000Z"
  },
  {
    "author": "thirdsun",
    "text": "You picked a bad example. Yes, you need to purchase Logix X for 199, but you probably won't need to pay for any Logic updates in the foreseeable future. While the lack of update pricing is a problem for many developers, it's also a feature of Apple's software. They usually simply don't do priced updates. As far as I remember the upgrade from Logic 9 to X was free on the App Store.Furthermore the full price of 199 could very well be mistaken for an upgrade offer - it's a very reasonable price.",
    "points": null,
    "time": "2015-12-02T13:50:10.000Z"
  },
  {
    "author": "nnx",
    "text": "> We should also add that this move is not a knee-jerk reaction to the recent certificate expiration problems that affected so many Mac App Store customers.Any good link/background about this?",
    "points": null,
    "time": "2015-12-01T15:38:52.000Z"
  },
  {
    "author": "jhull",
    "text": "HN thread here https://news.ycombinator.com/item?id=10560634",
    "points": null,
    "time": "2015-12-01T15:42:47.000Z"
  },
  {
    "author": "nicksergeant",
    "text": "Good. The other day the App Store was down and I couldn't use half of my downloaded apps because they failed \"verification\". I'll be happy as a clam to see more developers move their apps off of the App Store.",
    "points": null,
    "time": "2015-12-01T15:39:07.000Z"
  },
  {
    "author": "Already__Taken",
    "text": "Steam does this to me as well sometimes. Why can't these stores use some kind of encryption that can just validate \"Yes at some point in the past this has been purchased on this computer\" and leave it at that. Always online frankly seems excessive.",
    "points": null,
    "time": "2015-12-01T15:46:15.000Z"
  },
  {
    "author": "roosterjm2k2",
    "text": "Steam seems to remember for a while... i've played Euro Truck Sim while traveling with no internet...",
    "points": null,
    "time": "2015-12-01T15:52:57.000Z"
  },
  {
    "author": "WorldMaker",
    "text": "It varies with different games on Steam. Steam doesn't require its DRM, so some games have no DRM, even when installed by Steam, which is great. More critically, though, Steam also doesn't require its DRM be exclusive so some games are protected both by Steam's DRM and something else, where that something else may have its own weird requirements before launching a game.",
    "points": null,
    "time": "2015-12-01T16:10:22.000Z"
  },
  {
    "author": "facetube",
    "text": "Can confirm. I bought Goat Simulator from Steam about a year ago, have uninstalled Steam, and even moved the application between OSs and devices without any issue.",
    "points": null,
    "time": "2015-12-01T18:09:15.000Z"
  },
  {
    "author": "forgotmypassw",
    "text": "That's why we should promote DRM-free software distributions - like GOG.",
    "points": null,
    "time": "2015-12-01T20:04:21.000Z"
  },
  {
    "author": "X-Istence",
    "text": "That's exactly what Apple's scheme does, except that Apple's root certificate expired...There is no communication between you and Apple when you launch applications.",
    "points": null,
    "time": "2015-12-01T15:55:09.000Z"
  },
  {
    "author": "dkonofalski",
    "text": "That's not true. Apple issued a new root certificate using the latest OpenSSL standard. The apps that \"expired\" were using an out-of-date version. They technically shouldn't have worked in the first place, but Apple kept renewing the old SHA-1 certificate alongside the current one which allowed these apps to validate, despite using a cert that was obsolete since 2005.",
    "points": null,
    "time": "2015-12-01T16:27:54.000Z"
  },
  {
    "author": "mikeash",
    "text": "Which is to say, that's exactly what Apple's scheme does, except in one crucial point where it does not, which malfunctioned and caused a bunch of havoc.Why does a purchase receipt need to have an expiration date at all? It's stupid. This stuff should be once-and-done.",
    "points": null,
    "time": "2015-12-01T16:58:05.000Z"
  },
  {
    "author": "baldfat",
    "text": "There is an Offline mode in Steam",
    "points": null,
    "time": "2015-12-01T15:59:35.000Z"
  },
  {
    "author": "walterbell",
    "text": "Do apps really contact the App Store to approve each launch? That would be a lot of tracking data that could be collected. How could it work if the endpoint is not connected to a network?",
    "points": null,
    "time": "2015-12-01T15:47:38.000Z"
  },
  {
    "author": "nicksergeant",
    "text": "Something like that. It's ridiculous. I could not use 1Password until the App Store came back up, which was pretty inconvenient. Tweetbot also had the same problem and the developer tweeted about the situation: https://twitter.com/tapbot_paul/status/664668084146339840 (and more tweets around that timeframe).",
    "points": null,
    "time": "2015-12-01T15:51:21.000Z"
  },
  {
    "author": "SyneRyder",
    "text": "I found this tweet from the Tweetbot developers even more significant, there was no way they could upload a patched old version to the Mac App Store to fix it:https://twitter.com/tapbot_paul/status/664822849534754816",
    "points": null,
    "time": "2015-12-01T16:52:27.000Z"
  },
  {
    "author": "X-Istence",
    "text": "No, they don't contact the app store to approve each launch. Apple has a root CA that expired, during this \"event\" apps wouldn't launch because they couldn't verify the code signing certificate. Apple updated their certificate, and all apps started working again.See: https://news.ycombinator.com/item?id=10560634",
    "points": null,
    "time": "2015-12-01T15:54:02.000Z"
  },
  {
    "author": "dkonofalski",
    "text": "I already responded to you in another thread here, but this isn't true. The apps wouldn't launch because they were using an old, outdated version of OpenSSL that's been updated since 2005. They were referencing an old, out of date root certificate, not the current one.",
    "points": null,
    "time": "2015-12-01T16:29:42.000Z"
  },
  {
    "author": "thesimon",
    "text": "But as the top comment says: The actual issue was that some developers used an old version of OpenSSL, which couldn't handle the SHA2 cert. Apple apparently \"deprecated\" their SHA1 cert and started to use an SHA2 cert. IIRC some apps were still working because they used the right OpenSSL version.I guess Apple didn't communicate enough with the developers that they'll start using SHA2.",
    "points": null,
    "time": "2015-12-01T16:31:33.000Z"
  },
  {
    "author": "mikeash",
    "text": "> I guess Apple didn't communicate enough with the developers that they'll start using SHA2.Understatement of the year right there. Apple didn't communicate this at all. The first time anybody outside of Apple found out about this was when apps started failing to launch.If Apple had merely told developers a month ahead of time, \"Hey, we're switching to SHA-2 certificates, make sure your receipt validation code handles it,\" this whole thing could have been avoided.In a crazy hypothetical world where Apple's app store team actually gives a shit about third party developers, they could have even tested SHA-2 certificates against the apps in the store, and directly contacted affected developers to tell them to get stuff fixed.",
    "points": null,
    "time": "2015-12-01T17:00:07.000Z"
  },
  {
    "author": "X-Istence",
    "text": "SHA-1 deprecation has been on the table for a long time now.",
    "points": null,
    "time": "2015-12-01T18:55:20.000Z"
  },
  {
    "author": "SyneRyder",
    "text": "Not all apps, some older apps (e.g. Tweetbot 1.xx) stopped working permanently & can't be fixed, because Apple doesn't allow old versions to be re-downloaded from the Mac App Store. It's convinced me to stop using the MAS and I've been re-buying my MAS apps direct from the developer wherever possible.I commented more fully over here: https://news.ycombinator.com/item?id=10562030",
    "points": null,
    "time": "2015-12-01T16:41:21.000Z"
  },
  {
    "author": "oneeyedpigeon",
    "text": "Thanks for this info. I don't think I fully appreciated this aspect of the MAS before, although I'm sure all the pieces were lodged in the back of my mind, nagging away. I'm not going to buy any software from the MAS ever again.",
    "points": null,
    "time": "2015-12-01T17:33:29.000Z"
  },
  {
    "author": "kalleboo",
    "text": "> and all apps started working againSome apps are still broken for me, and I'm not sure how to fix them aside from deleting and reinstalling",
    "points": null,
    "time": "2015-12-02T05:01:39.000Z"
  },
  {
    "author": "wyattjoh",
    "text": "After I just got profile manager figured out to distribute our Sketch licences at the office... Hope there's some option to manage those licenses.",
    "points": null,
    "time": "2015-12-01T15:42:13.000Z"
  },
  {
    "author": "tdkl",
    "text": "Thank god there are some developers who have the balls to stop with this \"Store\" app distribution bonanza brought by the mobile phone. Someone should give Microsoft a hint.",
    "points": null,
    "time": "2015-12-01T15:44:27.000Z"
  },
  {
    "author": "StavrosK",
    "text": "> brought by the mobile phoneBrought by the iPhone. You can install whatever you want on Android, and multiple stores exist.",
    "points": null,
    "time": "2015-12-01T15:57:49.000Z"
  },
  {
    "author": "spdionis",
    "text": "But 90% of the users (me included) use only the play store and barely know anything about the rest, let alone trust them (me included again).",
    "points": null,
    "time": "2015-12-01T16:02:52.000Z"
  },
  {
    "author": "StavrosK",
    "text": "\"People don't use them\" is qualitatively different from \"they cannot exist\", though.",
    "points": null,
    "time": "2015-12-01T16:06:29.000Z"
  },
  {
    "author": "oneeyedpigeon",
    "text": "I'm guessing you don't have a source for that because I would be shocked if it were any less than 99%. It would be wonderful to see genuine rivals, offering alternative business models.",
    "points": null,
    "time": "2015-12-01T16:18:28.000Z"
  },
  {
    "author": "gtk40",
    "text": "The only significant one would be Amazon's app store, which doesn't really offer any improvements over Google's.",
    "points": null,
    "time": "2015-12-01T16:24:03.000Z"
  },
  {
    "author": "goodplay",
    "text": "I use f-droid over te play store whenever I want to install an app.",
    "points": null,
    "time": "2015-12-01T16:58:35.000Z"
  },
  {
    "author": "gtk40",
    "text": "Yes, there are others, but I imagine (I would like to be wrong) that Amazon is the only one with any significant marketshare. Maybe something in China.",
    "points": null,
    "time": "2015-12-01T18:46:41.000Z"
  },
  {
    "author": "jbob2000",
    "text": "The \"store\" was really great for small/solo developers to release an application. It's really expensive to setup your own server to distribute an application. It's also really annoying to have to patch your apps without a store.What's changed is that there are lots of open source options for distribution and patching, so developers need a \"store\" less and less.",
    "points": null,
    "time": "2015-12-01T16:10:53.000Z"
  },
  {
    "author": "SyneRyder",
    "text": "> It's really expensive to setup your own server to distribute an application.I haven't found it expensive at all. I've been selling apps outside App Stores for over a decade and never needed more than my $9/mth shared web hosting. Accepting credit cards is even easier & cheaper through someone like Fastspring or Kagi, who only take 8 - 9% instead of Apple's 30%.> It's also really annoying to have to patch your apps without a store.On the Mac, Sparkle is your friend for auto-updates, it's been around since 2006 (long before the Mac App Store existed): http://sparkle-project.orgOn Windows, there's WinSparkle, though it isn't quite as elegant: http://winsparkle.org",
    "points": null,
    "time": "2015-12-01T17:10:09.000Z"
  },
  {
    "author": "jbob2000",
    "text": "I don't disagree, there were always solutions. The app store just made it easier than the alternatives. But now the alternatives are easier than the store.",
    "points": null,
    "time": "2015-12-01T18:07:00.000Z"
  },
  {
    "author": "ilolu",
    "text": "Anyone else not getting the mentioned popup when launching the new Sketch ?",
    "points": null,
    "time": "2015-12-01T15:44:28.000Z"
  },
  {
    "author": "an4rchy",
    "text": "Did you overwrite the App Store installed version or did you just download from scratch and install? I overwrote the MAS version and it came up.",
    "points": null,
    "time": "2015-12-01T16:08:29.000Z"
  },
  {
    "author": "ilolu",
    "text": "I tried overwriting too. But did not get the popup.",
    "points": null,
    "time": "2015-12-01T17:10:03.000Z"
  },
  {
    "author": "milen",
    "text": "Apple has completely lost the goodwill of Mac developers. The one and only reason the ones that haven't gone bankrupt are still staying is because they have no other choice due to platform lock-in. Every single conversation that I've had with indies recently have gone along the same lines: Apple is killing the indie scene.I wrote about the MAS exodus [1] more than a year ago and people were skeptical back then. Think again - here's a list of great apps [3] that are only available outside the MAS. Those are not just small time hobbyist apps - those are professional tools.Pieter (founder of Bohemian, company behind Sketch) listed many problems with the MAS at a recent conference [5]. Wil Shipley (well-known within the community) has also written about it [6].And now you have another flagship OS X app ditching the MAS due to the multitude problems it creates. The message is loud and clear - if you're a real software business, not a hobbyist at home, don't waste your time with the MAS - it simply does not allow you to run your busienss properly.When the companies building the flagship apps for the platform publicly state they cannot do business due to the restrictions of the Mac App Store and then abandon the dysfunctional virtual marketplace, then you know Apple have pushed them beyond the edge. No company would just decide to leave the MAS unless the situation is hurting them significantly and holding them back. And unfortunately, there are almost no words to describe how bad the MAS has been for the ecosystem and innovation on the platform. [2]You also get ridiculous stuff like Intuit because of the limitations [4].Even if Apple fixes the Mac App Store one day, which is highly unlikely given that in 5 years they have done absolutely nothing, developers have been burned once and will be skeptical. You know, the whole \"Fool me once, shame on you, fool me twice, shame on me\".When people say that everything is fine and dandy with the MAS, they seem to be misguided - no one is asking Apple to make everyone a millionare. Developers are asking for Apple not to force simplistic business models and allow companies to have the ability to choose what works for them.I used to be hopeful for years but no more. I have zero faith that Apple will listen to indies and solve their problem, they've got no leverage. And that's a real pity. Instead of pairing high quality hardware with high quality software, we have a platform encouraging predatory tactics and milking of customers. A truly sad situation. And that's a real shame because the platform I love and have invested a decade in deserves better. It might even be too late - the damage to developers has been enormous.[1] http://blog.helftone.com/mac-app-store-the-subtle-exodus/[2] http://mjtsai.com/blog/2015/11/12/no-one-minding-the-store/[3] http://dancounsell.typed.com/articles/not-on-the-mac-app-sto...[4] http://mjtsai.com/blog/2015/11/24/quicken-2015-switches-from...[5] https://twitter.com/tmaes/status/657213874970763267[6] https://twitter.com/wilshipley/status/669321851793879040",
    "points": null,
    "time": "2015-12-01T16:01:23.000Z"
  },
  {
    "author": "JoeAltmaier",
    "text": "I've been dumbfounded as well. A company that makes scores of billions on products, should be able to spend millions on a decent app store. Yet it continues to be a bottleneck, fail to serve app developers, and strangle innovation. It all seems so futile.",
    "points": null,
    "time": "2015-12-01T16:04:03.000Z"
  },
  {
    "author": "sosborn",
    "text": "It takes more than money to create quality software.",
    "points": null,
    "time": "2015-12-01T17:37:25.000Z"
  },
  {
    "author": "JoeAltmaier",
    "text": "Sure; but the reality is they did nothing at all.",
    "points": null,
    "time": "2015-12-01T20:17:33.000Z"
  },
  {
    "author": "mpweiher",
    "text": "Why do you think the AppStore is not working as intended?http://jasongriffey.net/wp/2012/04/19/commoditizing-our-comp...",
    "points": null,
    "time": "2015-12-03T20:35:54.000Z"
  },
  {
    "author": "__m",
    "text": "Well the new sketch crashes instantly, i hope it doesn't take them a week to release an update",
    "points": null,
    "time": "2015-12-01T16:03:54.000Z"
  },
  {
    "author": "bomberstudios",
    "text": "If you used The Unarchiver, Pathfinder or Keka to unzip it, try using OSX's Archive Utility",
    "points": null,
    "time": "2015-12-01T16:11:34.000Z"
  },
  {
    "author": "henriks",
    "text": "Surprisingly this turned out to be the issue; The Unarchiver messed up some file attributes it seems. Thanks.",
    "points": null,
    "time": "2015-12-01T17:59:31.000Z"
  },
  {
    "author": "VeryVito",
    "text": "I'm glad to see successful apps exiting The Mac App Store, and I hope others will follow. Unlike its iOS counterpart, which is great in many ways (new app discovery not being one of them), the MAS has unfortunately done more harm than good to the once-thriving indy Mac app-development scene.It offers a low cost of entry, but also encourages \"pump-and-dump\" development, in which developers are actively (though surely not intentionally) discouraged from updating their apps once they launch.It's designed to be the \"anti-professional\" means of app distribution, and it never reaches any higher.",
    "points": null,
    "time": "2015-12-01T16:07:15.000Z"
  },
  {
    "author": "jonknee",
    "text": "Which is a real shame because it's great to not worry about billing information, key management and pushing out updates (for both users and developers).",
    "points": null,
    "time": "2015-12-01T16:45:29.000Z"
  },
  {
    "author": "jasonbarone",
    "text": "This is the part I wish could be solved. I hate having to input billing into various websites and apps and not being able to track licenses unless I do myself.",
    "points": null,
    "time": "2015-12-01T17:17:45.000Z"
  },
  {
    "author": "oneeyedpigeon",
    "text": "How viable would it be for a third-party alternative to act as a 'broker' between customer and developer, just to handle those aspects you mention?",
    "points": null,
    "time": "2015-12-01T17:36:32.000Z"
  },
  {
    "author": "jonknee",
    "text": "Steam has done well with that model for games, but being Mac only would be a tough sell. Apple's big advantage was instantly getting the App Store on every Mac.",
    "points": null,
    "time": "2015-12-01T17:46:43.000Z"
  },
  {
    "author": "s73v3r",
    "text": "Who says they have to be Mac only? It'd probably work out better to be on all major platforms, that way you can sell the feature of buy once, run on all platforms the software runs on. You also could allow single platform things onto your store too, like Sketch.",
    "points": null,
    "time": "2015-12-01T20:07:58.000Z"
  },
  {
    "author": "jonknee",
    "text": "Because the vast vast vast majority of apps aren't cross platform?",
    "points": null,
    "time": "2015-12-01T22:31:42.000Z"
  },
  {
    "author": "s73v3r",
    "text": "So what? Steam sells plenty of games that are Windows only. Doesn't stop them from being available on other platforms.",
    "points": null,
    "time": "2015-12-02T04:22:40.000Z"
  },
  {
    "author": "s73v3r",
    "text": "Not very unless you set yourself up as a store, in which case you've got the problem of trust, both on the developer side (why should we deploy to yet another store), and the customer side (why should we trust your fly by night store).",
    "points": null,
    "time": "2015-12-01T20:03:01.000Z"
  },
  {
    "author": "cmdkeen",
    "text": "Which is ridiculous when Steam is there as a shining example of what a store could be. Not having to worry about keys and updates is fantastic for me, plus good discovery and upselling opportunities for developers.Someone is going to crack desktop app stores one day and do very well. The cost of entry is high (not necessarily in cash, more in reputation) but there are plenty of players who could do it. There's even scope in the SME market in terms of rolling up licencing and deployment. Hell there's even a use case for families.",
    "points": null,
    "time": "2015-12-01T17:11:14.000Z"
  },
  {
    "author": "chongli",
    "text": "Not having to worry about keys and updates is fantastic for me, plus good discovery and upselling opportunities for developers.It's not that great for me. I've had a bunch of my Steam games put out breaking updates and there's nothing I can do about it but wait for subsequent rollbacks. It's a major flaw in the system that a breaking update can be forced down users' throats.",
    "points": null,
    "time": "2015-12-01T17:14:18.000Z"
  },
  {
    "author": "philwelch",
    "text": "Many Steam games can be rolled back to previous versions using the \"betas\" feature.",
    "points": null,
    "time": "2015-12-01T17:17:30.000Z"
  },
  {
    "author": "cpcallen",
    "text": "This includes breaking updates to the Steam client itself - which stopped working on 10.6.8 in November. I can roll back to an earlier version, but it immediately auto-updates to the latest version.So now I can't update any of the games I've bought through Steam, or reinstall any I've removed.Obviously I can't buy any new ones, either - but, even if I eventually update OS X (breaking many older Apps I depend on for work) and am able to run the Steam client again, there's no way in hell I'll ever buy a game through Steam again.",
    "points": null,
    "time": "2015-12-01T17:24:34.000Z"
  },
  {
    "author": "aeontech",
    "text": "Just want to point out that you could upgrade the base OS to latest, and run 10.6.8 in a VM for any older apps that do break in new versions.",
    "points": null,
    "time": "2015-12-01T18:40:40.000Z"
  },
  {
    "author": "brazzledazzle",
    "text": "Also 10.6 isn't getting much in the way of security updates anymore...",
    "points": null,
    "time": "2015-12-02T03:51:30.000Z"
  },
  {
    "author": "forrestthewoods",
    "text": "Automatic updates is great. The lack of ability to easily rollback is not. GOG's Galaxy has rollback built in. I feel like Steam will add it eventually.",
    "points": null,
    "time": "2015-12-01T17:24:37.000Z"
  },
  {
    "author": "delecti",
    "text": "I would argue that Steam itself is excellently poised to do so, if they wanted to.",
    "points": null,
    "time": "2015-12-01T17:19:06.000Z"
  },
  {
    "author": "jdmichal",
    "text": "They already are:http://store.steampowered.com/software/",
    "points": null,
    "time": "2015-12-01T20:25:03.000Z"
  },
  {
    "author": "heartbreak",
    "text": "Where would you say that Steam currently falls short as a desktop app store? Didn't they roll out general purpose apps for Windows a while back?",
    "points": null,
    "time": "2015-12-01T17:21:36.000Z"
  },
  {
    "author": "darryl42",
    "text": "They did, but most of them seem like toy apps or old versions of an application, old version on steam new version direct from vendor.",
    "points": null,
    "time": "2015-12-01T17:29:20.000Z"
  },
  {
    "author": "vitd",
    "text": "1) It's buggy. Literally 50% of the time when I launch it, it says it can't reach the network. Meanwhile my browser and email are chugging along just fine. Another launch of Steam and suddenly it sees the network. No other app I run has any problem reaching the network ever.2) Steam \"updates\" itself every time I launch. I see others saying it only happens once a month, but I literally cannot launch it and have it not update. If I quit and immediately relaunch, it says it's updating and starts downloading stuff. WTF?3) It shows me ads. Note - it's not like the App store which opens to a list of \"what's hot/what's new/what's promoted\". It launches, I go to click on something and an ad for a game pops up in a separate window blocking the interface.4) It shows me ads for games that don't work on any system I've ever used Steam on.5) Support from Valve is non-existent. If you try to get support for a game, they will by default tell you it's the game vendor's fault, even before figuring out what the problem is. If you try to use their support forums, you are required to use a different login and password than the one you use for the store. WTF? Why would they ever do that?The list goes on. It's just a terrible app. In my opinion the Mac App Store is lightyears ahead of it in just about every dimension I care about. I no longer use Steam when there's any other option available.",
    "points": null,
    "time": "2015-12-01T19:22:13.000Z"
  },
  {
    "author": "squeaky-clean",
    "text": "> It launches, I go to click on something and an ad for a game pops up in a separate window blocking the interfaceThis is pretty easy to disable, there's an option within the Interface tab in the settings.[0][0] http://gaming.stackexchange.com/questions/28415/is-there-a-w...",
    "points": null,
    "time": "2015-12-01T19:41:49.000Z"
  },
  {
    "author": "vacri",
    "text": "I always liked how when you buy a game, the app freezes, and you get the \"thanks for purchasing\" email before the app unfreezes.I don't think it's a terrible app given everything it's trying to do (and primarily that it's a retail outlet, not a social network), but it can definitely do with a bit more polish.",
    "points": null,
    "time": "2015-12-01T21:03:05.000Z"
  },
  {
    "author": "dreen",
    "text": "Steam is terrible. It requires the whole app to be running and fully up to date before you can launch a game. It has a slow load time. Even on a decent machine, if you haven't played a steam game in a while and you want to run one, you might be looking at a good few minutes before the game even starts to load. In the name of what, stopping piracy? AFAIK most pirated games come from steam anyway.I realise this is still better than Mac App Store, but I wish they just let me run a the game without running Steam.",
    "points": null,
    "time": "2015-12-01T17:27:18.000Z"
  },
  {
    "author": "chipperyman573",
    "text": "Once you launch a game once through steam you can just run the launcher file.",
    "points": null,
    "time": "2015-12-01T17:31:32.000Z"
  },
  {
    "author": "dreen",
    "text": "I'm pretty sure That still launches steam app and updates it before launching the game.",
    "points": null,
    "time": "2015-12-01T17:34:31.000Z"
  },
  {
    "author": "squeaky-clean",
    "text": "That's up to the game/publisher. With Bastion for example, you can copy the game directory to another PC and it will still work. But most games will require Steam to run first.",
    "points": null,
    "time": "2015-12-01T19:38:02.000Z"
  },
  {
    "author": "wtallis",
    "text": "If you don't let Steam run in the background, then of course it's not going to be able to update games in the background. The delay in launching games is thus at least partly self-inflicted. And Steam certainly has justifications other than DRM for being strict about keeping games up to date: any networked game will probably need to match the version of the server, and in general it's good policy for Steam to trust developers have good reasons for pushing out updates.There are also Steam games that don't use Steam's DRM and can be run without Steam. It's up to the individual game developers whether to include the DRM.",
    "points": null,
    "time": "2015-12-01T17:54:44.000Z"
  },
  {
    "author": "gknoy",
    "text": "All of the things you say are true, and I also agree on the \"self-inflicted\" delays a sibling poster mentions.All of these mattered very little to me when I went to reinstall a game I hadn't played in two years, after a move and a computer crash. I have games on physical media that I can no longer install, or that I can't find the discs for. Fantastic games like Bioware RPGs, or Borderlands.With Steam, I can open a fresh machine, install the Steam app, and then install (mac versions of) games I bought in pc-version, or for which I no longer can find the media.Between Steam's library sharing, access to cross-platform versions of games, and the fact that I can install it from scratch anywhere I have an internet connection, I don't want to buy games any other way. There are many ways to improve, but that ease of recovery and reinstallation (not to mention that it saves my save-games in the cloud for some RPGs) has been well worth any performance hits.The \"whole app\" is tiny, and I need to update it maybe once a month. It's not worth complaining about.",
    "points": null,
    "time": "2015-12-01T18:24:06.000Z"
  },
  {
    "author": "prewett",
    "text": "Steam.app is small when you download it, but it seems to download hundreds of megabytes of something after you run it.",
    "points": null,
    "time": "2015-12-01T19:06:21.000Z"
  },
  {
    "author": "kogepathic",
    "text": "What you download is just a stub, when then pulls down the rest of the components required to run Steam. It's the same thing with their Linux installer.Honestly the frequency with which companies are only offering stub installers bothers me. My company has an office in a country with terrible internet, and since Microsoft no longer offers an offline installer for Office (unless you have a volume license key, which we're too small to have), it's absolute hell to have our employees download and install office on their computers when they join the company.",
    "points": null,
    "time": "2015-12-01T20:32:50.000Z"
  },
  {
    "author": "simoncion",
    "text": "> Honestly the frequency with which companies are only offering stub installers bothers me.In general, I heartily agree with you. However, because Steam's primary purpose is to download and install huge gobs of data from Valve's servers, I feel that Valve's decision to ship just a stub installer is totally justified.MSFT's stub Office installer, or Google's stub Chrome installer? Inexcusable.Edit: Ugh. I should caffeinate. Steam's primary purpose is to let you play video games. However, the way it does that is by downloading gobs of data & etc.",
    "points": null,
    "time": "2015-12-02T01:00:06.000Z"
  },
  {
    "author": "robotresearcher",
    "text": "I'm a parent of young kids, and fire up steam maybe once a month. Guess what happens to my precious game time nearly every single time.",
    "points": null,
    "time": "2015-12-01T19:08:30.000Z"
  },
  {
    "author": "outworlder",
    "text": "Yeah, exactly the same thing happens every time. There isn't much of a way around it though, it should really do automatic updates.",
    "points": null,
    "time": "2015-12-01T19:45:31.000Z"
  },
  {
    "author": "Splines",
    "text": "It does do automatic updates as long as it's running.",
    "points": null,
    "time": "2015-12-01T20:59:34.000Z"
  },
  {
    "author": "huac",
    "text": "it does...if you don't want steam to be a distraction but still install updates, run it and put yourself in offline mode. the footprint is pretty small, except when it's actually installing.",
    "points": null,
    "time": "2015-12-01T21:13:02.000Z"
  },
  {
    "author": "simoncion",
    "text": "So, you can do a couple of things:* Start Steam when you log in to your computer, but have yourself signed out of Friends so you don't get friend activity notifications.* If you're concerned about data usage, or don't want all of your games to update when you launch Steam, set your games to only update when you launch them. [0] Sadly, there's no way that I can see to make this the default update strategy, so you have to do this for every game in your library that has annoyingly frequent updates. :( Also note that you can configure Steam to not download updates when a game is running [1] and that Steam makes the update game you're trying to launch the highest-priority download.* Run Steam in Offline mode (assuming you're not playing multiplayer games ;) ) : https://support.steampowered.com/kb_article.php?ref=3160-AGC...Sadly, I don't see any way to run some sort of \"Steam client and game updating\" service that runs in the background and just keeps the client and your games updated even while you're not logged in to either Steam or your Windows account.[0] Right-click on the game->Properties->Updates, change the value of the \"Automatic updates\" dropdown menu to \"Only update this game when I launch it\".[1] IIRC, this is the default setting.",
    "points": null,
    "time": "2015-12-02T00:49:44.000Z"
  },
  {
    "author": "robotresearcher",
    "text": "Thanks, friend. I appreciate the help, and I'm sure others will too. I reboot my MacBook Pro into Windows for gaming only, but I'll take advantage of your advice when I can.",
    "points": null,
    "time": "2015-12-02T05:55:29.000Z"
  },
  {
    "author": "simoncion",
    "text": "> I reboot my MacBook Pro into Windows for gaming only...Implying that Steam only runs rarely.Yeah, that complicates things. :( Best of luck!",
    "points": null,
    "time": "2015-12-02T06:18:49.000Z"
  },
  {
    "author": "dreen",
    "text": "Yes but all of that is achievable without a bloated hog that steam interface is. Just run a thin updater, with a task manager icon as only UI, and a separate app for the store and downloading/installing games. You can probably cram the rights management into the tiny app as well without making sacrificing too much.",
    "points": null,
    "time": "2015-12-01T20:28:29.000Z"
  },
  {
    "author": "simoncion",
    "text": "> Yes but all of that is achievable without a bloated hog that steam interface is.Steam uses ~120 MB of RAM on my system. Google Chrome uses 300+ MB of RAM with just the Google home page loaded.> ...with a task manager icon as only UI,You can configure Steam to only display a system tray icon when you don't have the Steam window open.",
    "points": null,
    "time": "2015-12-02T01:07:04.000Z"
  },
  {
    "author": "justinclift",
    "text": "You can launch your games in Offline mode, which stops the need for having to go online/update/contact-the-Steam-servers-before-launch.It's not totally straight forward though. You need to unplug your network device (or turn off wifi, etc) so the initial startup times out, and gives you the option to use Offline mode.There might be a command line switch way to do that too, but I've never looked. ;)",
    "points": null,
    "time": "2015-12-01T18:49:13.000Z"
  },
  {
    "author": "mastax",
    "text": "There's also a menu option for 'Go Offline...'",
    "points": null,
    "time": "2015-12-01T19:11:29.000Z"
  },
  {
    "author": "justinclift",
    "text": "Yeah, but you need to be connected online first for that. eg go through the whole \"Steam starts, updates itself, etc\". :)",
    "points": null,
    "time": "2015-12-04T04:46:09.000Z"
  },
  {
    "author": "teen",
    "text": "this isn't true- you don't have to update games. it's up to each individual game to decide.",
    "points": null,
    "time": "2015-12-01T21:11:57.000Z"
  },
  {
    "author": "simoncion",
    "text": "> [Steam] has a slow load time.Odd. On my six-year-old potato PC, Steam takes 10 seconds from the time I click on the Steam icon until the time the UI is up and I can interact with it.> ...if you haven't played a steam game in a while and you want to run one, you might be looking at a good few minutes before the game even starts to load. In the name of what, stopping piracy?Probably in the name of downloading and applying the most recent game patch. On the off-chance that you weren't talking about patch downloading, I started a game in my library that was installed, but that I hadn't played in over a year. It loaded just as quickly as any other game in my library.If patching bothers you, run Steam in Offline Mode.> ...I wish they just let me run a the game without running Steam.If you want to go that route, you can probably find any number of methods to spoof the Steam DRM.",
    "points": null,
    "time": "2015-12-02T00:57:22.000Z"
  },
  {
    "author": "ChuckMcM",
    "text": "I love when the top two comments on a story really nail it. In this case I think the parent comment combined with the GP comment capture the issue, when the App Store concept is implemented poorly, it negatively effects user experience, vendor experience, and customer satisfaction. When it is done well, it enhances those things.The key is that Apple has not pulled off a successful App Store concept for MacOS yet, and worse they haven't really internalized some of the things that make App Stores \"good\" or \"bad\". As a result, people are leaving.The response though will be even more interesting, either Apple can give application delivery the focus it needs and become the best in class example, or they can continue to languish, or worse they mandate by fiat use of feature which negatively impacts the brand.App Stores try to be too many things at once. They started off as discovery, distribution, and payment processors. They have evolved into sort of microservice delivery applications. When the sandbox + App starts looking like a container instance running a unikernel, you've really supplanted the OS entirely. But that model doesn't work well for what many people think of as \"productivity\" apps.I hope Apple chooses to give this problem the focus it needs. I could easily see this as the \"feature\" on which a lot of OS seats are sold.",
    "points": null,
    "time": "2015-12-01T17:36:39.000Z"
  },
  {
    "author": "pkamb",
    "text": "> Apple has not pulled off a successful App Store concept for MacOS yetThey really did, for the first year or two of the Mac App Store's existence. It was great. All of the \"$10 utility apps\" would be there today if not for Sandboxing.Maybe this wouldn't have included the apps where the 30% or poor support for upgrades/subscriptions would really impact sales (Adobe, Microsoft, perhaps, interestingly, Sketch...), but sandboxing is the only outstanding issue that prevents you from shipping an app to the Mac App Store.",
    "points": null,
    "time": "2015-12-01T20:07:00.000Z"
  },
  {
    "author": "mrec",
    "text": "I use and generally like Steam, but I'd never call its discovery \"good\". Users are drowning in the number of titles, the recommendation engine is pretty poor, and there's no support for filtering.I'll never buy an RTS or a multiplayer-only game, stop showing them to me. I'll never buy an early-access game or a game with 3rd-party DRM, stop showing them to me. I could cull 90% of the stuff in my discovery queues, automatically, with 30 seconds of box-checking.I'm also surprised that the desktop client has never implemented an \"is this machine actually capable of running this game?\" check. Non-trivial to implement, sure, but really useful.",
    "points": null,
    "time": "2015-12-01T17:45:10.000Z"
  },
  {
    "author": "the_af",
    "text": "Same here. I like and use Steam, but its UI for casually browsing games (aka \"casual shopping\") isn't very good. For example, when you are browsing a list of games, if you click on one to see additional details and then try going back, you lose your place in the list. This is infuriating for long lists. It kills the browse & shop experience.The web interface for Steam is better than the app's. Then again, this is what web browsers are there for...",
    "points": null,
    "time": "2015-12-01T17:54:56.000Z"
  },
  {
    "author": "mrec",
    "text": "Yes! Forgot to mention that, but it drives me nuts too.",
    "points": null,
    "time": "2015-12-01T17:58:36.000Z"
  },
  {
    "author": "Orva",
    "text": "Funny enough, when looking at Steam processes tree (and if I recall correctly, also licenses), client is done with Chromium Embedded Framework.",
    "points": null,
    "time": "2015-12-01T20:44:26.000Z"
  },
  {
    "author": "toyg",
    "text": "Which is probably why it still looks like shit on Retina screens. Oh, how I love HTML apps...",
    "points": null,
    "time": "2015-12-01T21:56:39.000Z"
  },
  {
    "author": "greggman",
    "text": "What does that have to do with HTML5 apps? In the browser, when HD-DPI support was added every page started using HD-DPI font rendering, HD-DPI CSS, HD-DPI SVG, only image were still lo-resConversely I still have native apps that are low-res only because updating them to HD-DPI meant shipping a new app.",
    "points": null,
    "time": "2015-12-02T03:25:44.000Z"
  },
  {
    "author": "toyg",
    "text": "> when HD-DPI support was addedIndeed. Except that, to get it, you-developer actually had to ship an updated browser with your \"app\" -- basically the same as any native app, except that instead of being \"just turn on this setting in a plist and recompile\", it means refreshing your little in-house fork of a massive browser project that barely anyone understands. Clearly Valve cannot be arsed to do that, so Steam keeps looking like shit more than 3 years after these screens appeared.The universal toolkit is not so universal if every app ships its own custom version.",
    "points": null,
    "time": "2015-12-02T10:34:09.000Z"
  },
  {
    "author": "simcop2387",
    "text": "Yea that's the exact reason that I end up using the web interface for browsing games. The fact I can browse and open up 30 tabs of games and then look at them one by one without losing my place anywhere is so much nicer.",
    "points": null,
    "time": "2015-12-01T21:31:27.000Z"
  },
  {
    "author": "robwilliams",
    "text": "Middle clicking works in the Steam desktop app, at least on Windows. It opens the clicked link in a new window in the foreground.",
    "points": null,
    "time": "2015-12-02T14:08:51.000Z"
  },
  {
    "author": "ingenieros",
    "text": "Are you currently following any curators? This usually helps me find games that I wouldn't have found out about otherwise.",
    "points": null,
    "time": "2015-12-01T18:07:47.000Z"
  },
  {
    "author": "chc",
    "text": "Some people, when they have a problem finding good games, think \"I know, I'll find a curator.\" Now they have two problems.",
    "points": null,
    "time": "2015-12-01T18:17:56.000Z"
  },
  {
    "author": "coldtea",
    "text": "Besides the chance of a word-play on the famous quote, is there any substance behind this at all?What would be the problem with finding a curator? It's not unlike how music industry has always worked -- from the era of finding a radio producer you like to the era of following a playlist on Spotify on some genre you like.",
    "points": null,
    "time": "2015-12-01T18:38:41.000Z"
  },
  {
    "author": "chc",
    "text": "I have the same trouble finding good curators as I do finding good games. I don't know what curators are good just like I don't know what games are good. I'll look at someone and I'll think, \"Is this person really any better than filtering by genre and then randomly buying games?\" And I don't feel confident the answer is yes a lot of the time. I feel like I need a meta-curator.I agree that this is not a particularly novel problem, though.",
    "points": null,
    "time": "2015-12-01T18:52:16.000Z"
  },
  {
    "author": "coldtea",
    "text": ">I have the same trouble finding good curators as I do finding good games. I don't know what curators are good just like I don't know what games are good.You should have even more trouble finding good curators than finding good games.But the idea is that you need to find a curator ONCE, and then they suggest lots of games for years.A curator not being 100% perfect it's OK too -- after all even one's self buying games they read about or even try their demos, will pick some dudes. It's unreasonable to expect a curator (or a recommendation) service to not do that too.",
    "points": null,
    "time": "2015-12-01T20:15:14.000Z"
  },
  {
    "author": "janfoeh",
    "text": "I think there is, yes. For me, finding a person whose reviews I can trust takes a lot of time, so it's useless for answering the question \"anything good here I would like to play right now?\"I have been reading movie reviews for close to 20 years now; in all that time I have found just two people whose reviews I respect and whose taste mirrors mine so much that I can follow them blindly. With games it's just as complicated, if not more so.",
    "points": null,
    "time": "2015-12-01T19:58:22.000Z"
  },
  {
    "author": "coldtea",
    "text": ">For me, finding a person whose reviews I can trust takes a lot of time, so it's useless for answering the question \"anything good here I would like to play right now?\"Of course. You first need to do some work (find a curator you trust), before you can check a game they suggest.But what would the alternative be? Either you ALWAYS search for yourself, or you search first for some curators and then follow their suggestions (occassionaly checking out stuff on your own too).",
    "points": null,
    "time": "2015-12-01T20:20:31.000Z"
  },
  {
    "author": "janfoeh",
    "text": "I can say with a very high probability whether a game is worth a look, just by looking at its tags. Of course that doesn't tell me whether I will ultimately like it, but then again reviews cannot do that either.The ability to simply blacklist one or two handful tags would make discovery dramatically easier for me. That's all it would take.",
    "points": null,
    "time": "2015-12-01T20:29:36.000Z"
  },
  {
    "author": "camperman",
    "text": "Thank you for the coffee out of the nose :)",
    "points": null,
    "time": "2015-12-01T18:58:57.000Z"
  },
  {
    "author": "logfromblammo",
    "text": "This immediately calls to mind Grim Fandango Remastered which \"requires\" OpenGL 3.3 .It doesn't, really. It has the ability to run the game at its original (1998) level of quality. But the developers chose not to enable this as a fallback. You have to rely on some guy on the Internet that figured out how to hack it so that it would work.It'd be great if I could, for instance, filter out everything that won't run with the Intel HD3000 graphics unit on my cheapo laptop.",
    "points": null,
    "time": "2015-12-01T19:02:45.000Z"
  },
  {
    "author": "djsumdog",
    "text": "Not to mention it crashes all the damn time. Your store shouldn't crash when you full-screen a trailer!I always buy games on Hubble if they're available on both. Sure my save games don't get backed up, but they are drm free. I'll even pay more if the humble price is higher for drm free.",
    "points": null,
    "time": "2015-12-01T19:06:16.000Z"
  },
  {
    "author": "janfoeh",
    "text": "This is my pet peeve with Steam, too, especially because it seems to be so easy to fix. If only I had the ability to communicate my dislikes to Steam by blacklisting certain tags, the recommendation system would instantly become an order of magnitude more helpful.Most tags actually seem to be spot-on and quite helpful, so the data is already there.> I'm also surprised that the desktop client has never implemented an \"is this machine actually capable of running this game?\" check. Non-trivial to implement, sure, but really useful.I've wondered that as well. A bit of data munching together with user feedback, in a similar manner to online fashion stores (\"I found these size 11 boots a bit on the small side\") would be quite helpful.",
    "points": null,
    "time": "2015-12-01T20:15:29.000Z"
  },
  {
    "author": "vacri",
    "text": "> I could cull 90% of the stuff in my discovery queuesThe whole point of the discovery queue is to expose you to a variety of options. If you want to search just those things you want, there are already filters you can manually use. These filters don't have all the options (please, no 'early access', I agree), but they give you the filtered lists that it sounds like you want.",
    "points": null,
    "time": "2015-12-01T20:54:50.000Z"
  },
  {
    "author": "toyg",
    "text": ">\"is this machine actually capable of running this game?\" check. Non-trivial to implement, sure,Quite trivial, actually. They already do the necessary data-gathering at your end (i.e. their periodic automated survey), the only \"hard\" bit is data-gathering at the other end (when a game is listed).It's so trivial to implement, in fact, that one has to wonder whether there are commercial considerations overriding the technical aspect. Maybe they don't want to piss off hardware and game vendors, maybe Valve would rather have you buy their console to bypass these considerations altogether... who knows.",
    "points": null,
    "time": "2015-12-01T21:54:42.000Z"
  },
  {
    "author": "simoncion",
    "text": "> I'm also surprised that the desktop client has never implemented an \"is this machine actually capable of running this game?\" check.The problem with that is that dev's stated minimum system requirements are -frequently enough to cause trouble with such a check- either substantially too high, or quite a bit too low. After all, not every studio has enough cash to discover what is actually the lowest-powered machine that one can play the game on.",
    "points": null,
    "time": "2015-12-02T00:27:15.000Z"
  },
  {
    "author": "overgard",
    "text": "A machine requirements check would be useful, but I can't think of many companies that would implement something that results in less sales. What's the upside? Maybe some good will? I'm not saying valve wants people to buy games they can't run or anything like that, but it would be an expensive ongoing effort to make less money.",
    "points": null,
    "time": "2015-12-02T00:49:10.000Z"
  },
  {
    "author": "greggman",
    "text": "How would that generate less sales? Isn't the whole point that since the recommendations are irrelevant they're getting less sales not more?",
    "points": null,
    "time": "2015-12-02T03:27:29.000Z"
  },
  {
    "author": "rcthompson",
    "text": "I think games are much easier to sandbox than general desktop applications. Games mostly just need access to input devices, output devices, hardware acceleration, and disk access in their own private folder, all things that are relatively easy to provide in a sandbox.",
    "points": null,
    "time": "2015-12-01T18:49:02.000Z"
  },
  {
    "author": "staticelf",
    "text": "After Steam, Windows Store is definately the best app store I've used. Normally a Linux fan, but I'm really impressed by Microsofts products lately.",
    "points": null,
    "time": "2015-12-01T21:53:20.000Z"
  },
  {
    "author": "fuzzywalrus",
    "text": "Sketch always seemed hampered by the Mac App store.I'm really hoping this opens the door for more flexible licensing for Sketch. The Mac App store is a bit of a pain for multi-seat licensing and upgrade pricing.",
    "points": null,
    "time": "2015-12-01T17:43:43.000Z"
  },
  {
    "author": "pkamb",
    "text": "> but also encourages \"pump-and-dump\" developmentNot only encourages, but forces. Any non-sandboxed apps that were released in the App Store prior to the sandbox mandate can be updated for \"bug fixes\", but any new features can explicitly not be included.",
    "points": null,
    "time": "2015-12-01T17:56:09.000Z"
  },
  {
    "author": "api",
    "text": "I keep wondering if Apple wants to kill OSX and take everything toward iOS, totally jailed everything, and the cloud.I know if they did they'd lose me as a customer for anything other that (maybe) phones, but maybe they don't care about that market.The only way they wouldn't would be if they grew up iOS into something you can do real work with -- allowed end user app installation, emulators and VMs, containers with full Darwin installs that could run homebrew, etc.It could be done, even without sacrificing ordinary user experience -- just hide the advanced stuff from regular users and require a little magic incantation to unlock it. But it would run counter to the padded room you-don't-own-your-device philosophy of mobile so I can't see the iOS team going that way without being pushed from above.Of course they have been updating OS X fairly well, so maybe not. Maybe the poor App Store experience is just like the poor Podcast app and other things -- an internal problem with motivation, direction, and focus in certain areas. Organizations can easily forget about things that are important but not 'hot'.",
    "points": null,
    "time": "2015-12-01T18:23:48.000Z"
  },
  {
    "author": "kps",
    "text": "> I keep wondering if Apple wants to kill OSX and take everything toward iOS Tim Cook: “iPad is the clearest expression of our vision of the future of personal computing.” The writing is on the wall, assuming you count U+1F4A9 as writing.",
    "points": null,
    "time": "2015-12-01T19:37:05.000Z"
  },
  {
    "author": "z1mm32m4n",
    "text": "> I keep wondering if Apple wants to kill OSX and take everything toward iOS, totally jailed everything, and the cloud.While the Surface and iPad Pro continue to improve, I have a really hard time seeing tablets \"killing\" laptops like, for example flash drives and cloud storage \"killed\" CDs.I'm not quite sure this is a winning strategy for them. There has been hype for a while that tablets will replace laptops. But looking back, there was a huge backlash against Windows 8 and the touch elements of it. Android tablets continue to vie for a segment of the market that feels like they're competing with iPod Touch, iOS, like you mention is still locked down.",
    "points": null,
    "time": "2015-12-01T20:27:13.000Z"
  },
  {
    "author": "api",
    "text": "It feels a little bit like it's being pushed. The reality I think is that it's being pushed a little and pulled a lot by the mainstream of the market.By mainstream I mean non-tech-savvy users, non-hackers. That's most people. I can completely understand how wonderful a \"managed platform\" like iOS is to a non-technical user. No malware! (Or at least greatly reduced risk of it.) No OS rot! No IT! No complicated system administration! It's like replacing a hand-cranked car by one with electronic ignition and an engine that doesn't constantly need retuning.For most people \"freedom\" means the freedom to get crapware and malware, spend hours that you can't spare futzing with your computer and getting nothing done, and have to reinstall your OS every year because it gets borked. Non-hackers hate platforms like that with a passion that it's difficult to understand. I often try to communicate it by comparing it to cars: how would you feel if you had to tune your engine every week, manually inspect every tank of gas for adulterants, and periodically stop your car to perform an inspection as you drive down the highway?At the same time, the car analogy is deeply imperfect. In the computing world when you trade Windows or OS X for iOS you're giving up a lot of capability and a lot of freedom. Tech-savvy and professional users either don't want to give that up or as is the case with developers can't give it up.But the problem is that non-tech-savvy users are most of the market, especially as computing becomes more and more mainstream, and most of the market is the market for a large company like Apple. Edges of markets don't matter. As such, I see the majority opinion of the market pulling things away from open platforms and rich capability and toward a managed, simplified, jailed, iOS-like future.I think there's a real risk that the professional will be left with a choice between the awful UX offered by pure OSS and being forced to adapt to iOS or similar platforms.Hey, maybe it'll prod the OSS folks into really taking UX seriously.Yeah.I'm not encouraged by what I see there nor by the combative/ultra-defensive attitude you get in those circles if you bring up this topic. One camp will insist that the latest Linux desktop or Ubuntu phone or whatever is great and is totally comparable to iOS and OSX and call you an idiot (and worse) for daring to think otherwise, and the other camp will just call you an idiot for \"needing\" UX or even a GUI at all because \"real men\" blah blah blah and why don't you read e-mail in emacs? I used to wade into those debates from time to time, but I stopped after I wrote a blog post (years ago) about Linux usability with some ideas about how to improve UI/UX development on Linux and the responses were full of insults I hadn't heard since Jr. High... not to mention one DDOS attack against the server.",
    "points": null,
    "time": "2015-12-01T20:45:49.000Z"
  },
  {
    "author": "hapless",
    "text": "Emacs provides really a very nice UI for working with email.",
    "points": null,
    "time": "2015-12-01T21:11:50.000Z"
  },
  {
    "author": "ascagnel_",
    "text": "It won't happen. Too much development work is done on OSX; specifically, iOS development _requires_ OSX. Until they start putting out an XCode environment on iOS that improves on what's available on OSX, they won't be killing OSX or Macs.",
    "points": null,
    "time": "2015-12-02T13:38:35.000Z"
  },
  {
    "author": "dperfect",
    "text": "Just to play devil's advocate: what specific things about the MAS \"[do] more harm than good\" or encourage \"pump-and-dump\" development as you say?I'm not trying to defend the MAS, and I think it definitely needs improvement, but are we really worse off for it?The two things mentioned by the Sketch developers are app review time and sandbox limits. Those same things exist on iOS, but I keep hearing people say the MAS is somehow worse. From Apple's perspective, the sandbox limits are arguably justified by a desire to provide greater security and privacy controls. The review process is basically a consequence of that same goal - though of course, review time could be greatly reduced.It sounds like the core issue for people is sandboxing. But what specifically about sandboxing is the issue? Are the sandbox limits really too restrictive for most apps (I guess new APIs/permissions could improve that with time), or are there just a lot of developers who prefer not to rework their apps to deal with the sandbox restrictions? Or is the very idea of sandboxing the problem (or perhaps the default security setting for allowed app installation)?As long as apps can be distributed outside the MAS, I guess I don't really understand the problem. The MAS adds a lot of convenience, but as usual, the convenience comes at a cost, and thankfully users and developers can take it or leave it.",
    "points": null,
    "time": "2015-12-01T19:18:29.000Z"
  },
  {
    "author": "s73v3r",
    "text": "I would say the sandbox limits on the MAS are worse, because they go against what a computer is supposed to do. Limits on the phone are considered ok, because first and foremost, the phone has to operate as a phone.",
    "points": null,
    "time": "2015-12-01T19:40:48.000Z"
  },
  {
    "author": "rarepostinlurkr",
    "text": "If I cannot use my computer to give a presentation because some \"utility\" app is crapping all over other apps because it has free reign of the system, isn't that going against what my computer is supposed to do for me?The ability for any normal person to identify, understand and resolve issues caused by the wild west of \"desktop computing\" should be well understood at this point -- they cannot.",
    "points": null,
    "time": "2015-12-02T06:01:49.000Z"
  },
  {
    "author": "jacalata",
    "text": "They pretty specifically said that the inability to charge for updates encourages pump and dump development.",
    "points": null,
    "time": "2015-12-01T19:45:34.000Z"
  },
  {
    "author": "s73v3r",
    "text": "That doesn't explain how, nor really makes any sense.",
    "points": null,
    "time": "2015-12-01T20:41:33.000Z"
  },
  {
    "author": "mcphage",
    "text": "If you can't make any money for upgrades, and there isn't a new influx of users, then there's not much money to be made by updating your app after release—only the people who would buy it after the update, but wouldn't have bought without it. Everyone else either paid you all the money they could, or will buy it anyway.",
    "points": null,
    "time": "2015-12-01T21:54:31.000Z"
  },
  {
    "author": "masukomi",
    "text": "there is convenience in finding apps (single place to go instead of the entirety of google results for a word) and in getting updates as a user... there is a greater amount of INconvenience to developers. Also, inconvenience to users when the app needs to gasp interact with other parts of the filesystem as many of the apps do. Inconvenience to users when they need support. Inconvenience to developers when they want to give support. inconvenience when you want to refund a users purchase (can't do it). inconvenience when you want to convey information to your users. etc. etc. etc... the INconveniences SO outweigh the conveniences...",
    "points": null,
    "time": "2015-12-01T19:49:05.000Z"
  },
  {
    "author": "dperfect",
    "text": "Not everyone will agree, but 99% of the apps I use shouldn't need to interact with other parts of the filesystem. I'm not sure how the MAS prevents users from receiving support, or developers from giving support (or conveying information) as you suggest. If anything, it encourages those things; every app listing requires a developer link and a support link if I remember correctly, in addition to all the other customizable information, images, and links - not to mention almost unlimited support/information that can be provided within the app itself. And MAS support does give refunds, albeit at their discretion - but that's how much of the retail world already operates. Many developers would consider that an added convenience.Again, my contention is not that the MAS is perfect, but to say that we're worse off for having it is hard to fathom. If the inconveniences really outweigh the conveniences, then distribute your app outside the MAS. Problem solved.I can understand similar complaints about the iOS App Store since there are no alternatives (outside of jailbreaking) for native app distribution, but in this case it's just an option. Is the existence of the MAS really worse than not having it as an option (inferior as it may be, depending on your viewpoint)?",
    "points": null,
    "time": "2015-12-02T00:09:12.000Z"
  },
  {
    "author": "pkamb",
    "text": "Many OS X apps are utilities that help you work with other apps. Running all the time in the background, monitoring, looking at keyboard input, observing folders, etc. These types of apps are fundamentally at odds with the Sandbox. But they're used often by many/most OS X users, even the less technically inclined.Whereas the design and simplicity of iOS has ensured, from the start, that these types of apps cannot exists on that OS.> Are the sandbox limits really too restrictive for most apps (I guess new APIs/permissions could improve that with time)The last 5 years have proven that Apple is not interested in granting exemptions to the Sandbox or new entitlements for, say, Accessibility apps.",
    "points": null,
    "time": "2015-12-01T20:16:46.000Z"
  },
  {
    "author": "dperfect",
    "text": "A good point about utility/accessibility apps. For most everything else though, I prefer not to inherently grant all those permissions to every app I install.But again, Apple doesn't require distribution through the MAS (even if the majority of apps can work effectively within the restrictions), so how does the MAS's existence make the OS X ecosystem worse off overall?If Apple is ignorant enough to leave money on the table by failing to provide a good marketplace/environment for a large number of apps (as may very well be the case), then non-MAS distribution will still flourish. Maybe they'll wise up and improve the situation in response. Maybe not, and we're back to the way things were before the MAS.",
    "points": null,
    "time": "2015-12-01T20:28:38.000Z"
  },
  {
    "author": "pkamb",
    "text": "It's not the existence of the Mac App Store that hurts, it's the existance of this (theoretically) great marketplace that we can't use to distribute normal, useful OS X apps. Especially if you had a great little app going in the MAS, and now can't update it because it can't be sandboxed.And hosting, key generation, payments, etc. are a fairly significant roadblock to shipping an app that the MAS formerly allowed you to completely ignore.",
    "points": null,
    "time": "2015-12-01T20:57:47.000Z"
  },
  {
    "author": "greggman",
    "text": "No non-free upgrades. To release version 2 of your app with a fee you have to release a new app. There's no connection between the two and AFAIK no way to provide a discount for existing users.As for the MAS harming devs it's the \"official store of OSX\" so users are arguably being trained to look there and only there for apps. So sure you can look elsewhere but Apple is fighting against you.30% cut is very high as well. I think existing payment systems for shareware apps were 5% or less. What do you get for your 30%? Support? No. Discovery? Not really. File Hosting? Ok, maybe but is that worth 30%? Easy upgrade and install. That's about it but usually that would be mostly handled by a free library.",
    "points": null,
    "time": "2015-12-02T03:40:59.000Z"
  },
  {
    "author": "rarepostinlurkr",
    "text": "How are these issues any different than the iOS App Store? They both play by the same set of rules.",
    "points": null,
    "time": "2015-12-02T05:57:35.000Z"
  },
  {
    "author": "greggman",
    "text": "The difference is history and options. Computers have a 30 year history of apps and buying options. Smartphones don't. iOS has only one way to get an app on the phone. Computers don't",
    "points": null,
    "time": "2015-12-02T11:19:21.000Z"
  },
  {
    "author": "setpatchaddress",
    "text": "The other things, yes, but 30% cut isn't a real problem. Have some perspective. You used to pay a lot more than that for packaging and distribution as a software developer, when software was still physical goods. (Yes, shareware, sure, but the number of developers who made a living out of shareware was extremely small.)",
    "points": null,
    "time": "2015-12-02T06:45:02.000Z"
  },
  {
    "author": "vsl",
    "text": "Have some history. After the physical distribution are and before MAS, there was (and still is) a large number of indie OS X developers distributing digitally. For a long time, FastSpring was the de-facto standard and its rate is 8.9%. Add a CDN or DevMate and 10% seems reasonable. DevMate in particular makes the difference stark: more flexibility, more functionality, 20% less.",
    "points": null,
    "time": "2015-12-02T09:51:44.000Z"
  },
  {
    "author": "agopaul",
    "text": "Also, the problem of unmaintained paid apps should be addressed. Yes, you can rate 1 star the app, but wouldn't be better to quickly file a 'not working' ticket, and let an Apple employee check the app? I mean, Apple is getting a generous cut from the sell anyway.",
    "points": null,
    "time": "2015-12-01T19:51:06.000Z"
  },
  {
    "author": "rmc",
    "text": "> Unlike its iOS counterpart, which is great in many waysI think the fact that it's mandatory has something to do with why people don't leave the iOS App Store.",
    "points": null,
    "time": "2015-12-01T21:04:08.000Z"
  },
  {
    "author": "odbol",
    "text": "Low cost of entry? It's actually quite high... my company still has to distribute instructions on how to disable Gatekeeper on your Mac so you can install our app. We don't have the resources to pay the $100/year \"Apple tax\" and also spend the 2-3 days developer time on figuring out how to sign our app and make it work with sandboxing.For me, low cost of entry means \"you put the app up for download, the user downloads it.\" Like the old days. No certificates, no Apple tax, no hoops to jump through.",
    "points": null,
    "time": "2015-12-01T21:44:44.000Z"
  },
  {
    "author": "imron",
    "text": "If $100/year is too high for your company, you quite probably have more serious problems than the App Store.I don't distribute Mac apps through the app store, and signing a regular app (no need to worry about sandboxing) with your developer certificate so that it can run without disabling Gatekeeper literally involves clicking a single radio button in Xcode.",
    "points": null,
    "time": "2015-12-02T05:54:14.000Z"
  },
  {
    "author": "ThomPete",
    "text": "I used to have an app in the MAS but recently removed it and is using Paddle instead.There are so many things wrong with the MAS.Sandbox is the biggest complaint I have. I can understand it with the iOS to some degree. At least there they are constantly providing new features and hardware changes to help apps keep being innovative.To give an example of the Sandbox issue.We are using AppleScript for some of our logic in the background. Because of the Sandbox every time AS is used a little gear pops up in the top menu of OSX.This started with Yosemite. But worse than that. The implimentation of this security measure was completely sloppy. The gear didn't just appear it also rearranged the top bar icons and I of course got a horde of users complaining. We tried many things to solve this but had to finally give up and just offer MAS users to switch to our non-MAS version.You would think that at least people would be able to turn off such a thing with apps they knew were ok. But no.Furthermore reviews can really make you or break you. For a long time we had good reviews because I spent a lot of time making sure people understood why the spinning gear was there. But after a while one star reviews started appearing and we had no way of mitigating that or contact the user and tell them they could switch to the non MAS app if they had that issue.And so I finally realized that if you want to actually do any innovation with your apps and built a proper business MAS is not for you.I am beginning to wonder if there is room for an alternate App Store based on the the Developer Certificate or some security setup open sourced.Anyway. My next product wont even be going on the MAS. It's simply not worth it. It's just a distribution channel for Apple to show their latest features (the only way you get featured)",
    "points": null,
    "time": "2015-12-01T16:11:21.000Z"
  },
  {
    "author": "microtonal",
    "text": "Although I am happy that apps are moving out of the MAS (it is slow, updates are slow, no possibility to offer upgrade licenses), as a user, Sandboxing is something that I want for every possible application. The model where an app can e.g. touch your whole home directory should go.",
    "points": null,
    "time": "2015-12-01T18:17:30.000Z"
  },
  {
    "author": "ThomPete",
    "text": "I don't disagree but I think there must be ways around this.For instance I don't mind Apples requirement that you have to ask for permission to access various files or folders but it should be possible and not come up with things like a spinning gear skating around your menubar. Those things are just sloppy.A simple. \"I trust this app to do more crazy things with my machine\" feature must be possible to do.",
    "points": null,
    "time": "2015-12-01T19:04:08.000Z"
  },
  {
    "author": "api",
    "text": "Agreed, but it should be something you can change or opt out of if it is needed.There's a difference between limiting and requiring approval for a dangerous but often useful activity and outlawing it entirely.",
    "points": null,
    "time": "2015-12-01T22:14:39.000Z"
  },
  {
    "author": "oblio",
    "text": "Really? If that model is so awesome, how can I ever implement a screen reader for Hearthstone? Or how can I implement a deck tracker for Hearthstone?Or any other kind of wild shenanigan Apple hasn't ever thought of.Keep that stuff for mobiles.If PCs also become grandma only territory, how will really interesting apps ever be developed? Interesting almost always involves \"dangerous\" somewhere along the way.",
    "points": null,
    "time": "2015-12-01T22:56:00.000Z"
  },
  {
    "author": "nezza-_-",
    "text": "With a two tier system. I believe you should still be -able- to install apps that have wider rights but you should have to jump through some hoops and make sure the user is aware of what he's doing before installing them.",
    "points": null,
    "time": "2015-12-01T23:05:02.000Z"
  },
  {
    "author": "pkamb",
    "text": "And for those potentially dangerous Mac apps that need to touch your home directory or essentially become a key logger, I'd want them to be as watched by Apple as possible. Keep them in the Mac App Store, with a strict permission / entitlements model.That's what I've never understood about the Sandbox policy. Those apps will still be shipped... they're just another level removed from Apple's oversight. And it's not like iOS, where not allowing those apps ensures that 99.9% of users will never ever see those apps.Gatekeeper helps with this to a degree, but why not just allow them in the Mac App Store?",
    "points": null,
    "time": "2015-12-01T23:58:43.000Z"
  },
  {
    "author": "pietro",
    "text": "How is Paddle working for you?",
    "points": null,
    "time": "2015-12-01T18:43:34.000Z"
  },
  {
    "author": "ThomPete",
    "text": "Surprisingly good. They don't support anything out of the box but they always seem to have a workaround (for instance I am switching to a \"nag\" demo model instead of a time based one i.e. like Sublime)Stuff like that is not natively supported by Paddle but it will be and there are ways to do it through their framework.And as long as I price my app at around $10 or more it's cheaper than MAS.I am writing a \"year in review\" post about Ghostnote where I am going to spill all the beans :)",
    "points": null,
    "time": "2015-12-01T19:07:17.000Z"
  },
  {
    "author": "odbol",
    "text": "I'd love to read that post... what's your blog?",
    "points": null,
    "time": "2015-12-01T21:58:16.000Z"
  },
  {
    "author": "ThomPete",
    "text": "http://www.ghostnoteapp.com/blog/2015/03/ although I am probably also going to put it on my personal blog http://www.000fff.org.",
    "points": null,
    "time": "2015-12-01T21:59:42.000Z"
  },
  {
    "author": "kybernetyk",
    "text": "I tried them. Integrating their SDK is a breeze. 30 minutes and you're ready to go. I also signed up for their paid analytics package. It's OK - nothing revolutionary but enough to track events.A few weeks later I wanted to cancel the subscription (app development would take a little longer). But there's no button to cancel. So I wrote them an email and all I got was a reply where they'd like to give me a Skype call to \"talk over my decision\".That and their regular \"customer engagement\" emails (I just want to use your service, I don't want to video chat every weekend) made me choose Devmate instead.(I still pay the $10/month for the analytics so I guess their plan worked).",
    "points": null,
    "time": "2015-12-01T22:01:14.000Z"
  },
  {
    "author": "ThomPete",
    "text": "Looks interesting. Why did you change?I am working on another product too so I am always looking for new opportunties.",
    "points": null,
    "time": "2015-12-01T22:37:43.000Z"
  },
  {
    "author": "s73v3r",
    "text": "\"You would think that at least people would be able to turn off such a thing with apps they knew were ok. But no.\"If you allow that, then \"Amazing Super Awesome Free Desktop Calendars\" is going to ask for it as well.",
    "points": null,
    "time": "2015-12-01T20:09:41.000Z"
  },
  {
    "author": "ThomPete",
    "text": "It already can. You don't need to go through the MAS to download and install an app on your Mac.What I am talking about is if I am downloading something from the MAS. If I am using an app and it pops up first time with the spinning gear I should be able to hide the spinning gear for that specific app.I find it absurdly ironic that such a powerful system doesn't give me that simple ability.",
    "points": null,
    "time": "2015-12-01T21:10:31.000Z"
  },
  {
    "author": "shawn-butler",
    "text": "It's my understanding (albeit limited) that the spinning gear was an indicator to the user that AppleScript was doing something (did I ask the app to do this?!?!)You will always see the gear in the menu bar if you are using Automator.Not having the spinning gear just because app came from MAS implies a whole level of trust that Apple probably isn't ready to afford. But again I have no idea about Apple internal design mentality.I think the issue is that sometimes the spinning gear doesn't go away after the script completes confusing users. This is an OSX bug not anything to do with the Mac App Store.",
    "points": null,
    "time": "2015-12-01T23:35:10.000Z"
  },
  {
    "author": "ThomPete",
    "text": "The issue was literally that the gear would pop-up and start switching around the order of the icons in random order. It wasn't even consistent. Some users had it on Yosemite others didn't.Surely it should be possible to turn of the spinning gear without having to turn of the security measures.",
    "points": null,
    "time": "2015-12-02T00:04:02.000Z"
  },
  {
    "author": "s73v3r",
    "text": "That's like saying I should be able to turn off the lock icon in the browser address bar for HTTPS. Those spinning gears are there to tell the user that stuff is happening, even if they might not be aware that they requested something to happen. If you can turn it off, then every piece of malware is going to tell the user that they can't use the app unless they turn that off. And then they have no protection, which is the exact opposite thing that Apple wanted.If you let anyone turn it off, then effectively you've let everyone turn it off.",
    "points": null,
    "time": "2015-12-02T04:37:49.000Z"
  },
  {
    "author": "ThomPete",
    "text": "No it's not like saying that at all.Again. The gear is there to tell you something specific is going on but most people don't care about that. So of course it should be possible to turn it off for specific apps that you actually trust.This is only an issue with Sandboxed apps not apps outside the app store. And it wasn't an issue until Yosemite.Not sure why you keep insisting on arguing against something that isn't what is being suggested for a solution.",
    "points": null,
    "time": "2015-12-02T04:53:53.000Z"
  },
  {
    "author": "dav-",
    "text": "I'm not really an OSX developer, but shouldn't it be possible to bypass the sandbox in a way by offering the user to install an unsandboxed auxiliary application via a download from your website which then communicates with the main sandboxed App Store application using some protocol and performs any actions which the MAS version would be otherwise unable to?For example, perhaps the auxiliary application runs a local HTTP server with a REST API. The MAS application simply makes HTTP requests to the auxiliary application such as `POST /applescript/doStuff`.",
    "points": null,
    "time": "2015-12-02T03:20:57.000Z"
  },
  {
    "author": "ThomPete",
    "text": "Against Apple Terms I believe. They will ban you if they find out.I was talking with apple support and they basically said that if we even offered some extra component to get rid of the spinning gear we would most likely be banned.",
    "points": null,
    "time": "2015-12-02T03:23:43.000Z"
  },
  {
    "author": "mh-",
    "text": "I'm pretty sure this is exactly what Boom 2 does.https://itunes.apple.com/us/app/boom-2-best-audio-enhancemen...Note their reference in the description to an 'optional component' that enables system-wide effects.",
    "points": null,
    "time": "2015-12-02T05:38:38.000Z"
  },
  {
    "author": "vsl",
    "text": "> Against Apple Terms I believe.Citation of the specific term needed. It isn’t against any of them and plenty of apps do it (Things, Boom or Monity come to mind). Apple requires that the app is functional without extra downloads and the app itself must not download the extra executables. But it’s OK to use them for extended functionality (Things: system-wide popup; Monity: extra sensors) as long as you only point the user to where to download the extra helper and they do it themselves (see e.g. http://www.monityapp.com/helper/ for one such helper download page, linked from in app).",
    "points": null,
    "time": "2015-12-02T09:59:41.000Z"
  },
  {
    "author": "ThomPete",
    "text": "Bypassing the Sandbox is not extending the capabilities.",
    "points": null,
    "time": "2015-12-02T14:56:13.000Z"
  },
  {
    "author": "seanalltogether",
    "text": "I would love to take Space Gremlin away from the mac app store. I've had to do some pretty wonky workarounds to offer people a \"pro\" version to escape the sandbox and it's a constant support headache. I'm just not sure if managing the payment network, licensing and distribution support is going to be even more of a headache.I'm genuinely surprised that nobody as set up a 3rd party app store that can compete with apple and microsoft and offer a cross platform solution. Get a big company like Adobe to anchor it and I would jump over in a heartbeat.",
    "points": null,
    "time": "2015-12-01T16:12:56.000Z"
  },
  {
    "author": "eljimmy",
    "text": "I don't think Apple would ever allow something of that nature, unfortunately.",
    "points": null,
    "time": "2015-12-01T16:14:25.000Z"
  },
  {
    "author": "scarface74",
    "text": "Apple doesn't have to \"allow\" you to install apps on the Mac.",
    "points": null,
    "time": "2015-12-01T16:20:41.000Z"
  },
  {
    "author": "detaro",
    "text": "> I'm genuinely surprised that nobody as set up a 3rd party app store that can compete with apple and microsoft and offer a cross platform solution.Interestingly, the only option I can think of is Steam. They also sell non-game software, but mostly creative tools.",
    "points": null,
    "time": "2015-12-01T16:16:11.000Z"
  },
  {
    "author": "kybernetyk",
    "text": "> I'm just not sure if managing the payment network, licensing and distribution support is going to be even more of a headache.From my own experience (I have a few apps on the MAS + outside of it) something like Devmate+Fastrpring or Paddle makes licensing and payment processing pretty painless. Of course there's other issues like what happens when Paddle or Devmate go belly up ande stop processing license activations. But still it takes only a weekend to get it to work and once you get it to run it just works.The real problem though is that the Mac software ecosystem outside the MAS is dead. No user goes to those huge software directory websites anymore (my traffic from MacUpdate & co. is almost zero). (Funnily enough before the MAS went live Apple had a list of OS X software. It was a great source of high quality traffic back then. But it wen't offline with the introduction of the MAS).The only way to get your app infront of users is via SEO (which means that you take your eggs from the MAS basket and put them all into the Google basket) or by spending loads of money on PPC ads which won't give you a positive ROI because $39 is now considered hugely expensive for software.Social media, blog posts, etc. are all nice in theory but won't convert to paying users. You made a funny cat picture that went viral and sends thousands of reddit users to your website? Great, but no one will download your app. They just want the cat picture.The same goes for paying $10k for a blog post over at daringfireball. People will visit your website but won't download.Buying ads directly on blogs, forums or twitter/facebook? No one cares for those. You will just lose money.Marketing your own software got really hard nowadays and if you're not one of the \"famous\" developers removing your app from the Mac App Store just means that you will lose most of your revenue.Great for Sketch that they can pull it off. But most devs can't. Which makes Apple's negligence of the MAS even worse.",
    "points": null,
    "time": "2015-12-01T16:52:20.000Z"
  },
  {
    "author": "robmcm",
    "text": "The Mac app store is great for simple, do one thing apps. I purchased a little app that stitched panoramic photos together, and it worked great and cost next to nothing.However I think it's a long way off working for every app and developer.",
    "points": null,
    "time": "2015-12-01T16:17:52.000Z"
  },
  {
    "author": "kremdela",
    "text": "I'll just play devils advocate here. As a consumer, I really like buying from the Mac App store solely for the user experience of, when I eventually new a new Macbook Pro, I can easily sync all of my purchases, rather than having to retrieve the licenses and go download the latest version of each piece of software I've purchased. As a developer, I've heard countless horror stories and totally understand.",
    "points": null,
    "time": "2015-12-01T16:18:48.000Z"
  },
  {
    "author": "ismail",
    "text": "For syncing apps and tools have you tried homebrew and cask. Create a brewfile and stick it in your dotfiles.",
    "points": null,
    "time": "2015-12-01T16:25:45.000Z"
  },
  {
    "author": "laveur",
    "text": "Brew is not consumer friendly at all. My parents (in their 60's) own a mac that I bought for them. It was a great decision for me as I barely have to support them for technical problems. I only get questions on how to do something. If I was to try and explain brew to them it would be a disaster. Explaining the Mac App Store is far easier.",
    "points": null,
    "time": "2015-12-01T16:36:30.000Z"
  },
  {
    "author": "oalders",
    "text": "I feel the same way. https://www.cakebrew.com/ does make brew a bit friendlier, but it's still not simple enough for me to explain to my parents.",
    "points": null,
    "time": "2015-12-01T17:02:33.000Z"
  },
  {
    "author": "jasonbarone",
    "text": "Brew is not even tech-person friendly. I'm comfortable with the command line and I had a ton of problems getting cask to work. I LOVE the idea and I will use it every time I setup a computer, but there's so many issues to work out. Mainly, some apps not updating correctly, the storage of app versions in cask, settings, licensing. It's a mess.I really hope it gets better. I'd contribute if I was knowledgeable enough to do so.",
    "points": null,
    "time": "2015-12-01T17:13:58.000Z"
  },
  {
    "author": "integraton",
    "text": "Be aware that Homebrew Cask [1], which your comment is referring to, is a separate project being built on top of Homebrew (\"brew\") [2] and it currently has a number of shortcomings that are independent of anything to do with Homebrew itself.1. https://github.com/caskroom/homebrew-cask/2. https://github.com/Homebrew/homebrew",
    "points": null,
    "time": "2015-12-01T19:18:09.000Z"
  },
  {
    "author": "jasonbarone",
    "text": "Thanks, I did mean Cask. I follow both projects closely and am aware of a bunch of the current discussions. Both are great initiatives.",
    "points": null,
    "time": "2015-12-01T19:39:26.000Z"
  },
  {
    "author": "makecheck",
    "text": "The sad thing is, they didn't even need an App Store to provide this type of service, and it would have been more useful without a store. Apple already has iCloud; they only needed a variation of the current sync mechanism (something a bit smarter that knows how to find stuff in Applications and related files like Library->Preferences). If they're comfortable giving away free gigabytes of storage to people, they shouldn't care about uploading all of a user's apps — from a store or not — and syncing them anywhere.",
    "points": null,
    "time": "2015-12-01T16:52:35.000Z"
  },
  {
    "author": "zwetan",
    "text": "As a user/consumer I consider the search or discovery of new apps on the MAS quite horrible, the features you mention are nice but IMHO they come \"after you found the app\".IMHO an app dev is better off implementing the payment system and update than using MAS, for ex in my case there is no way I would wait 7 days to have an update out of the door (eg. I don't automate everything to get blocked on the last step).",
    "points": null,
    "time": "2015-12-01T17:55:20.000Z"
  },
  {
    "author": "xutopia",
    "text": "Migration assistant does the trick for me without having to use the MAS.",
    "points": null,
    "time": "2015-12-01T20:45:06.000Z"
  },
  {
    "author": "tammer",
    "text": "I've always wondered: is it the limitations of the sandbox that are the problem, or is it expectation? If we never had access to execute outside the sandbox, would we simply say we \"see the reasoning\" as we do for iOS?",
    "points": null,
    "time": "2015-12-01T16:23:13.000Z"
  },
  {
    "author": "glossyscr",
    "text": "Sketch was the killer app of the entire MAS.For me it's even the killer app for OSX, there's nothing equal for that price on Windows.",
    "points": null,
    "time": "2015-12-01T16:33:20.000Z"
  },
  {
    "author": "relaxatorium",
    "text": "The thing that's craziest about the MAS to me is how bad the actual application is.It's super slow, constantly hangs, and is just such a bad experience from the consumer side that it undermines the (very real) benefits of having a centralized store of applications you've purchased and installed.It'd be one thing (and a fairly standard Apple move) if the customer experience was good and they didn't care about trampling developers to get it that way, but the actual customer facing software that is the App Store is a shockingly bad piece of software.",
    "points": null,
    "time": "2015-12-01T16:39:36.000Z"
  },
  {
    "author": "to3m",
    "text": "I dread ever having to run the Mac App Store to get an upgrade. (Luckily, I only have to do it for Xcode and OS X.)It asks for my password literally every 15-20 seconds. Once I tell it to upgrade everything, it selects only one upgrade, and keeps telling me there are upgrades. While the upgrades are going, it keeps asking me for my password.At that point I go off and watch TV. When I come back, it's actually downloaded all of the upgrades, and there's a message about how there are more. After I've entered my password a few more times, it tells me I'm up to date.Then it asks me whether I'd like to upgrade.I guess once their work experience students get bored working on Xcode they put them on this instead.",
    "points": null,
    "time": "2015-12-01T17:02:00.000Z"
  },
  {
    "author": "sosborn",
    "text": "> It asks for my password literally every 15-20 seconds.This hasn't been my experience at all. I wonder what's going on because that sounds super annoying.",
    "points": null,
    "time": "2015-12-01T17:31:50.000Z"
  },
  {
    "author": "to3m",
    "text": "As far as I can tell, it's not universal, but still somewhat common. (My computer has always done it ever since I bought it new in April.) It is a bit annoying. But since I use the MAS so irregularly, I can get by. I do wonder what the cause is, though. I'm less certain I'd like to know how Apple have so far failed to get to the bottom of it.",
    "points": null,
    "time": "2015-12-01T18:46:45.000Z"
  },
  {
    "author": "vitd",
    "text": "Do you know for certain that they know about it? You can file bugs here: http://bugreport.apple.com/.",
    "points": null,
    "time": "2015-12-01T19:38:01.000Z"
  },
  {
    "author": "brazzledazzle",
    "text": "Radar is bullshit. Apple should make it easy to file bugs and get information about them but they've been using this piece of jank since forever. If I file a dupe I have to inquire about it every now and again because you can't just add me to the original? Yeah, I don't think so.",
    "points": null,
    "time": "2015-12-02T03:44:42.000Z"
  },
  {
    "author": "to3m",
    "text": "I've done my Radar time.If the reason Apple haven't fixed this is that I personally didn't sign on to Radar and log it as a bug, I can live with that.",
    "points": null,
    "time": "2015-12-02T10:22:28.000Z"
  },
  {
    "author": "acdha",
    "text": "On OS X and iOS Apple’s developers tend to treat every network error as a reason to nag you to reauthenticate. I have opened bugs for this in almost every app they make and it's like playing whack-a-mole where they'll fix one instance in one app and then it'll show up in the major release or a similar function somewhere else.",
    "points": null,
    "time": "2015-12-01T19:50:45.000Z"
  },
  {
    "author": "jasonlotito",
    "text": "I've had the same issue. And yes, it's annoying. The MAS is frustrating at the best of times.",
    "points": null,
    "time": "2015-12-01T20:03:18.000Z"
  },
  {
    "author": "BinaryIdiot",
    "text": "> It asks for my password literally every 15-20 seconds.That's really odd. It's a bad app but I've never seen that (in fact I've almost never need to enter my credentials). Are you sure it's your iTunes password? Maybe it's your keychain password and you have your keychain locked (which therefore you're going to be prompted for its password every time a service needs to grab the credentials stored within).",
    "points": null,
    "time": "2015-12-02T03:46:09.000Z"
  },
  {
    "author": "thirdsun",
    "text": "That's basically my experience as well. Now imagine that your connection is rather slow, which forces you to start larger updates before going to bed - I can't count the number of times I woke up to a password entry dialog and no download progress at all. It takes me ages to upgrade anything there since I really hate opening that app. With 1 Mbit/s connection even process of searching for updates will take a good minute.",
    "points": null,
    "time": "2015-12-02T11:20:12.000Z"
  },
  {
    "author": "makecheck",
    "text": "It's funny, too, that Apple feels there is enough development time to do things like implement completely non-standard UI components but not enough time to fix a growing list of real problems.To this day, I click on things and assume my click just didn't \"take\" because nothing seems to be happening. Sometimes that's true, and other times it's because the Mac decided to display progress in the least obvious places.Ironically the one thing that doesn't update cleanly through the App Store is the OS itself, even though I suspect that was Apple's main reason for creating all this. When El Capitán came out, at first I thought it wasn't even available because it wasn't structured as an \"update\" to anything (in direct contrast to the way every other upgrade works, including the minor 10.x.x updates!).",
    "points": null,
    "time": "2015-12-01T17:10:32.000Z"
  },
  {
    "author": "s73v3r",
    "text": "It's not structured as an update, and that's a good thing. This way, the update to 10.10 is treated as separate from the update to 10.11, meaning you can still download both should you need them.",
    "points": null,
    "time": "2015-12-02T04:32:49.000Z"
  },
  {
    "author": "netheril96",
    "text": "Frankly, the slowness of the Mac App Store and its connection in China is the starting reason that some Chinese developers seek Xcode outside the official channel, hence the XcodeGhost.",
    "points": null,
    "time": "2015-12-01T17:16:21.000Z"
  },
  {
    "author": "oneeyedpigeon",
    "text": "Great point. The \"updates\" tab is a complete mindfk, you can't filter by OS version (which the app presumably knows, yet chooses to ignore) so you can spend lots of time investigating an app, only to find out at the last moment that you can't actually run it, and - a personal bugbear of mine - none of the text is proper selectable text, so it can't be copied.And tell me I'm not the only person in the world who has to manage several Apple IDs ...",
    "points": null,
    "time": "2015-12-01T17:18:01.000Z"
  },
  {
    "author": "asd",
    "text": "The MAS is excruciatingly slow. Switching to each tab takes 7-10 seconds for me on my late '13 Macbook Pro Retina with a very fast internet connection. The tabs seem to work in a similar way in iTunes. You would think they could precache the other tabs after the current tab loads. Nope.",
    "points": null,
    "time": "2015-12-01T17:33:11.000Z"
  },
  {
    "author": "clumsysmurf",
    "text": "Every time I start MAS, softwareupdated goes from 30mb to about 500mb, without doing anything. When I close MAS it continues to steal that memory.",
    "points": null,
    "time": "2015-12-01T18:08:12.000Z"
  },
  {
    "author": "blinky88",
    "text": "This is really it. It's so painful to use. Slow, buggy, and unreliable.",
    "points": null,
    "time": "2015-12-01T18:11:50.000Z"
  },
  {
    "author": "OSButler",
    "text": "The one thing that keeps bothering me with MAS updates is that you cannot see the download/install progress. It will show it at first, but then the progress bar indicator simply disappears after a short time. I have to close the App Store window and reopen it, often multiple times, in order to be able to see the download progress again. This is not an issue for smaller updates, but larger Xcode updates are a pain trying to figure out how much data has been downloaded so far.",
    "points": null,
    "time": "2015-12-01T19:10:52.000Z"
  },
  {
    "author": "jcoby",
    "text": "For some reason Xcode updates are shown in Launchpad (both the dock icon and if you can manage to find the app in Launchpad itself) and then sync'd back to the App Store after some delay. The delay seems to be completely random.I think for some class of updates that includes Xcode and OS the App Store uses a separate tool to download and run the update so it has to use some sort of (very) delayed IPC mechanism. Regular apps update through the App Store itself so it shows progress immediately.",
    "points": null,
    "time": "2015-12-01T19:22:54.000Z"
  },
  {
    "author": "hungri-yeti",
    "text": "Try switching to the Purchases view, I've found that you can see the download/install progress better there.",
    "points": null,
    "time": "2015-12-02T04:59:13.000Z"
  },
  {
    "author": "jeffmk",
    "text": "Indeed, I actually have a ridiculous and frustrating ongoing problem, apparently insoluble, where no matter how many times I update an app that appears under \"Updates Available\", it will reappear after seemingly successfully updating.So I've installed the identical copies of XCode, iMovie, The Unarchiver, etc., etc., over and over. Then entries with identical versions and release dates very shortly after reappear in the list.This, on top of countless other frustrations (such as transferring my MBP from my home \"battlestation\" to offsite causing full system crashes about 1/3 of the time, Time Machine not working properly with my NAS setup, WiFi overheating/malfunctioning FUBAR right after upgrading to Yostemite, various other minor random things breaking and annoyances, and so on, including the generally arrogant attitude Apple takes of its customers and developers), I've had enough. Next computer I'm running back into the arms of Linux, because the main argument against it is that Linux eats up a lot of time configuring, but I'm already wasting way too much time dealing with my OS' issues, one that ostensibly \"just works\", so I might as well get the benefit of having a working, productive development system at the end of it.",
    "points": null,
    "time": "2015-12-01T21:20:44.000Z"
  },
  {
    "author": "cdnsteve",
    "text": "Has Sketch considered Steam? They support Mac.",
    "points": null,
    "time": "2015-12-01T16:51:31.000Z"
  },
  {
    "author": "theinternetman",
    "text": "The Steam mac client is pretty janky which might explain them not using it.",
    "points": null,
    "time": "2015-12-01T17:05:15.000Z"
  },
  {
    "author": "colmvp",
    "text": "Janky is putting it kindly",
    "points": null,
    "time": "2015-12-01T21:02:18.000Z"
  },
  {
    "author": "optimuspaul",
    "text": "I pretty much only use the Mac App Store anymore. There are maybe 2 apps I use that I get outside of it. I have a bunch that I are woefully out of date because their developers abandoned me. It's too bad that rather than trying to push to make it a better place developers are just leaving.",
    "points": null,
    "time": "2015-12-01T16:53:20.000Z"
  },
  {
    "author": "URSpider94",
    "text": "How exactly do developers \"push to make it a better place?\" It's owned by Apple, nobody else has a voice, and Apple must be 100% clear on the perceived shortcomings seen by developers. It's not like there's a quarterly App Store Community Meeting where people can go and complain ...",
    "points": null,
    "time": "2015-12-01T17:21:37.000Z"
  },
  {
    "author": "profmonocle",
    "text": "Developers have been sending feedback to Apple for many years, and they haven't listened. The only option left is to vote with their feet.Look on the bright side - losing big-name apps might finally force Apple to fix the MAS, then those devs might come back.",
    "points": null,
    "time": "2015-12-01T22:01:27.000Z"
  },
  {
    "author": "aerialcombat",
    "text": "They should seriously do something about the review times. I'm sure they can come up with a plenty of good solutions if they wanted to.I suggest maybe giving developers a bank of a set number of expedited review passes per year or so, so they can use it when they really need it. Damn it.",
    "points": null,
    "time": "2015-12-01T16:56:27.000Z"
  },
  {
    "author": "stevetrewick",
    "text": "It actually works like this in theory. You can get a couple of expedited reviews for critical or urgent fixes [0], but Apples definition of 'critical' and 'urgent' don't typically include having just shipped a crash bug that will effect your entire user base unless you are Rovio are a similarly large actor.[0] https://developer.apple.com/support/app-review/",
    "points": null,
    "time": "2015-12-01T17:24:50.000Z"
  },
  {
    "author": "chillacy",
    "text": "Yea, I'm a small dev and I did that last time a critical feature of my app was broken, and the review still ended up taking a a week. Meanwhile people were sending me support emails and I know even more were silently frustrated. It's not fun to be powerless over your own destiny like this.",
    "points": null,
    "time": "2015-12-01T21:37:13.000Z"
  },
  {
    "author": "profmonocle",
    "text": "I once got them to expedite an emergency bug fix, and my company was nowhere near a \"large actor\". But this was waaaay back in 2009 so I can't be sure they're still that willing to help small devs. The expedited review took 24 hours when the average was over ten days at that time.Still, any review time is really sucks as a developer. Shipping a big release and having to wait 10+ days to get feedback really slowed us down and hurt my enthusiasm as a developer. Honestly, I'm glad iOS development isn't the main focus of my job anymore - the SDK and tooling is fantastic, but provisioning and App Store submission is awful.",
    "points": null,
    "time": "2015-12-01T21:47:54.000Z"
  },
  {
    "author": "mrspeaker",
    "text": "Ha... nooow they do it. I purchased Sketch version 2 for 50 euros when I lived in France. Then I moved to the US and got a new computer - at the same time version 3 came out. There was no way for me to get version 2 back: I tried the old \"just re-purchase it and it'll end up costing you $0\" (which worked for a bunch of other apps - but they were still on the same version). Instead I payed another $70 for version 3. I wrote to Apple and got my money back... but now I'm stuck with a dodgy version of 3 (that I'm supposed to delete and can't get updates for) and no way to get 2 back. Do I actually own version 2? I don't know!",
    "points": null,
    "time": "2015-12-01T16:59:39.000Z"
  },
  {
    "author": "mosburger",
    "text": "What are the alternatives to MAS? I've been considering distributing a small OSX app at a fairly low price based on its value. Are there any good ways to sell low-priced licensed software that support pushing updates to users easily?Edit: I should mention that in my particular case, the app is an Electron (formerly Atom Shell) app, so a solution that involves an ObjC library might be a bit difficult to implement.",
    "points": null,
    "time": "2015-12-01T17:02:56.000Z"
  },
  {
    "author": "jawngee",
    "text": "http://paddle.com",
    "points": null,
    "time": "2015-12-01T18:35:04.000Z"
  },
  {
    "author": "mosburger",
    "text": "Yeah, Paddle looks cool but I'm not sure how I'd integrate it w/ a \"fake\" faux-native app builder like Electron. Probably just ignorance on my part. :)",
    "points": null,
    "time": "2015-12-01T19:44:05.000Z"
  },
  {
    "author": "tdkl",
    "text": "Also what's wrong with Apple and their approach to software lately ? Have they become just a hardware and accessories company?Chris Pirillo gave a great talk about all the issues with the upfront statement that Android Marshmallow runs better on older hardware then iOS 9 on theirs (20min): http://youtu.be/n5iuR8pKBfQ",
    "points": null,
    "time": "2015-12-01T17:04:38.000Z"
  },
  {
    "author": "jlarocco",
    "text": "Glad I'm not the only one noticing it.I dumped OSX and installed Debian on my iMac a couple months ago because Apple's software has just sucked the last few iterations, and if it weren't for Capture One and LightRoom I'd be running OSX on my MBP, too.If it doesn't get better soon, my next phone is going to be an Android.",
    "points": null,
    "time": "2015-12-01T23:53:20.000Z"
  },
  {
    "author": "Jasber",
    "text": "Two years ago I released a Mac app (https://heyfocus.com/) that couldn't be in the MAS due to sandbox restrictions (tried 3 times—frustrating experience).I sat on it for an entire year because I was convinced nobody buys stuff outside of the AppStore anymore.A year ago, the project still had really good traction, so I decided to try to sell it directly as a test (using Paddle.com).Boy, was I wrong! TONS of people buy outside the MAS, and Focus is doing better than ever. If you're questioning it like I was, give it a shot.",
    "points": null,
    "time": "2015-12-01T17:07:11.000Z"
  },
  {
    "author": "ThomPete",
    "text": "And there is a very good reason for that.People don't use the app store to find solutions to problems, they use google for that.I had my app all the way up on top selling apps on the MAS and it had no effect on my sales.",
    "points": null,
    "time": "2015-12-01T17:09:10.000Z"
  },
  {
    "author": "zanedeg",
    "text": "I use focus everyday, thanks for the great app!",
    "points": null,
    "time": "2015-12-01T18:03:29.000Z"
  },
  {
    "author": "jonnynezbo",
    "text": "Two things:- I use Focus, and it's awesome- I prefer to buy outside of the MAS, and always check to see if the developer sells directly before buying there",
    "points": null,
    "time": "2015-12-01T18:26:40.000Z"
  },
  {
    "author": "metasean",
    "text": "Tangent: From Firefox, if I increase the font n https://heyfocus.com/ (for accessibility reasons) the buttons _come apart_ (specifically the right sides overlap the lower center of their button). Even with that font size increase, the text under the buttons is still extremely hard to read!",
    "points": null,
    "time": "2015-12-01T18:41:10.000Z"
  },
  {
    "author": "chrisper",
    "text": "Good choice. I stopped using the AppStore because I hate how it connects an app to my apple ID. For example, when I came to the U.S. I had to create a new AppleID. So each time I want an app from the old AppleID I have to change to the German app store. Quite annoying.",
    "points": null,
    "time": "2015-12-01T19:19:25.000Z"
  },
  {
    "author": "eliteraspberrie",
    "text": "Does the Paddle checkout use Stripe?",
    "points": null,
    "time": "2015-12-01T22:50:13.000Z"
  },
  {
    "author": "vsl",
    "text": "No, it uses Paddle checkout.",
    "points": null,
    "time": "2015-12-02T10:02:54.000Z"
  },
  {
    "author": "netheril96",
    "text": "Sandboxing is one of the pain points of Mac App Store. I certainly would like to see sandboxing being more prevalent on the desktop, but not like the MAS way. The user should have the final say of the way in which a sandbox allows and restricts the application. Just for example, I should be able to completely trust an app with access to the filesystem, not with all the popups and confirmations, while disallowing network access from it.",
    "points": null,
    "time": "2015-12-01T17:14:25.000Z"
  },
  {
    "author": "ksk",
    "text": "I've always seen all app stores as a blatant money grab. A digital storefront like that does not require that much money to run (no comparison with supermarkets and the like which have heavy operational costs). I mean the search barely works, discoverability sucks. One of the primary drivers for app revenue is handpicked winners and losers via their own app lists, and some of the stores are so amateurish that you have to re-download the entire app to update it. Of the ones that we have, Steam is probably the least grubby.I would much rather they charge a flat review/update/host fee per app with maybe tiered hosting pricing for multi-GB apps (which apart from steam games, I'm pretty sure few people download anyway). It's hard enough trying to run a successful software business and then these companies go out and beat their chest with \"WE paid developers billions this year\" rather than \"we took away 30% revenue from developers\".",
    "points": null,
    "time": "2015-12-01T17:17:57.000Z"
  },
  {
    "author": "vbezhenar",
    "text": "IMO sandboxing on desktop is failed attempt. Browser is a sandbox platform. Nobody will download some shady application and run it, even if it's sandboxed (but a lot of people don't really mind to visit a shady website).If an application is in AppStore, it means that Apple got some legal documents from developer, it means that Apple performed some automated scans on application binaries. For me it's enough to have some trust. Sandboxing is not needed and it actually making some apps unusable or even impossible to implement.Desktop apps always were in control of the entire computer. And they are now, unless you are downloading them from the AppStore. That's why a PC is much more useful than an iPad or iPhone for power users.",
    "points": null,
    "time": "2015-12-01T18:36:35.000Z"
  },
  {
    "author": "pkamb",
    "text": "And it's not as if non-Sandboxed applications won't be used. They'll just be distributed outside the app store. So all of the potentially \"dangerous\" apps are one-more-step removed from Apple's oversight and ability to pull the app and halt downloads. Gatekeeper gives them some power in this regard, but what's the point of not allowing them in the Mac App Store? Is the PR from having a keylogger in the MAS really that different from the recent Instagram password harvester for iOS, or a Mac keylogger that was direct-downloaded?",
    "points": null,
    "time": "2015-12-02T19:34:51.000Z"
  },
  {
    "author": "timetraveller",
    "text": "All the reasoning is BS. They just want to cut the middleman and keep all the earning which is totally fine but don't insult our intelligence and come up with ridiculous reasoning.",
    "points": null,
    "time": "2015-12-01T18:48:40.000Z"
  },
  {
    "author": "brandon272",
    "text": "I told myself a few months ago that I would never put anything else on the MAS nor would I advise a client to. It's a nightmare.",
    "points": null,
    "time": "2015-12-01T18:52:00.000Z"
  },
  {
    "author": "xenadu02",
    "text": "The worst part about this is all the problems are easily solved if Apple simply put the resources into it.* The actual MAS store app itself is a horrible piece of garbage wrapping a bunch of web views. Just make it a real native app and rewrite it.* Sandboxing is great, but there will always be things that fall outside the sandbox. Have a \"Power User / Developer Tools\" category and associated checkbox in iTC that says \"My app needs to opt-out of these parts of sandboxing\". Put those apps through a much more strenuous review process.* Relatedly, add more entitlements to the Sandbox, even if they also trigger a more in-depth review.* Both iOS and the Mac app stores desperately need feedback mechanisms and some basic customer support tools. This has been obvious since at least iOS v4. I can only imagine this is due to Apple's inability to do good server-side software (and the organization doesn't value it like they value client software). This should automatically give you at least a private way to send a message to users leaving a bad review, then prompt the user to update their review if the response helped them. Asking users to review is hard enough... getting them to update a 1-star review is nearly impossible.* Hire more reviewers. There is no excuse for reviews taking so damn long.",
    "points": null,
    "time": "2015-12-01T19:12:06.000Z"
  },
  {
    "author": "dangero",
    "text": "\"The actual MAS store app itself is a horrible piece of garbage wrapping a bunch of web views. Just make it a real native app and rewrite it.\"Native app is not really a black and white concept when you're talking about an app that mainly just interprets and displays live data it receives. If it's not html, then it's going to be xml/json/some other markup with a custom presentation layer on top. Why would that be better? In this case I just don't think you can point the finger at webview vs native as a problem or a solution. Yes, the app may be crap, but that seems mostly unrelated to the technology used to build it. I'm guessing it's more a factor of lack of resources, team member quality, management, or inter-departmental communication issues in a large corporation.",
    "points": null,
    "time": "2015-12-01T19:50:34.000Z"
  },
  {
    "author": "janfoeh",
    "text": "You're probably right. I would still agree with the parent in that they feel like a badly done webview wrapper, because the symptoms are so similar.iTunes Store, App Store, MAS, Apple Music — there is definitely a pattern there, at least on the desktop. I find them all similarly clunky, slow, ugly and unpleasant to use.Apple almost seems to be inherently incapable of creating a decent store front, and I am curious as to why they have that organizational blindspot.",
    "points": null,
    "time": "2015-12-01T20:06:35.000Z"
  },
  {
    "author": "ethbro",
    "text": "> Apple almost seems to be inherently incapable of creating a decent store front, and I am curious as to why they have that organizational blindspot.Because when you have a captured userbase, there's no incentive to improve / innovate?",
    "points": null,
    "time": "2015-12-01T20:40:11.000Z"
  },
  {
    "author": "janfoeh",
    "text": "Even if you believe that Apple as a whole doesn't have the drive to make stuff as good as they can (fair, although I believe otherwise), and even if you believe they have a captured audience (how?) — do you indeed believe that Apple is happy with 15% (US) market share for desktops and laptops?Even accepting everything else, that seems like a huge incentive to me not to get complacent.",
    "points": null,
    "time": "2015-12-01T20:57:38.000Z"
  },
  {
    "author": "zdw",
    "text": "> do you indeed believe that Apple is happy with 15% (US) market share for desktops and laptops?Seeing as in 2009 they had >90% of the market of PC's above $1000 (see here: http://betanews.com/2009/07/22/apple-has-91-of-market-for-1-... ) which is the profitable part of the market, probably they are.",
    "points": null,
    "time": "2015-12-01T21:12:11.000Z"
  },
  {
    "author": "ethbro",
    "text": "Not sure where you're getting 15% from: the vast majority of articles I read have Apple's app stores generating far more revenue than the competition's.So yes, I believe Apple is probably perfectly happy (in an upper-echelon corporate strategy sense) sitting on their cash cow as opposed to fighting it out for less profitable market share.",
    "points": null,
    "time": "2015-12-01T21:13:43.000Z"
  },
  {
    "author": "janfoeh",
    "text": "The number is from Gartner for Q3 this year - for whatever they are worth :)http://www.gartner.com/newsroom/id/3146617",
    "points": null,
    "time": "2015-12-01T21:32:04.000Z"
  },
  {
    "author": "s73v3r",
    "text": "\"do you indeed believe that Apple is happy with 15% (US) market share for desktops and laptops?\"If that other 85% is cheap laptops with no margin in them, yes.",
    "points": null,
    "time": "2015-12-02T04:07:53.000Z"
  },
  {
    "author": "muddi900",
    "text": "Apple has had the largest market share in mobile revenue, yet iOS keeps improving.",
    "points": null,
    "time": "2015-12-02T04:48:42.000Z"
  },
  {
    "author": "nickonline",
    "text": "Most of the most visible features and improvements I've seen in iOS over the years were developed by the jailbreaking community and eventually apple incorporated into iOS.",
    "points": null,
    "time": "2015-12-02T05:01:45.000Z"
  },
  {
    "author": "rarepostinlurkr",
    "text": "Care to actually list that? I find that incredibly hard to believe. While there may be a list of 5-10 features that meet the criteria, seems like most OS releases have hundreds of improvements here & there.All of Apple is just sitting around waiting for jail breakers to innovate for them, no one has any ideas about what to do with their time.Don't even get me started on hardware! Incorporating all that stuff Samsung & Dell or whoever is doing.",
    "points": null,
    "time": "2015-12-02T05:42:23.000Z"
  },
  {
    "author": "muddi900",
    "text": "Well Control Center came from SBSettings, for one. On a 3GS running iOS4, you could quick reply to texts, play background music, have a visual multitasking interface, etc.This was years before iOS 7. Though most of the concepts seem to be taken from Android, which took most of the ideas from defunct WebOS. Well, mostly Apple and Google hired former Palm guys for their design teams.",
    "points": null,
    "time": "2015-12-08T17:27:12.000Z"
  },
  {
    "author": "TazeTSchnitzel",
    "text": "The pattern is because they're the exact same app. All of those are just the iTunes Store, which is a web page on every platform. The iTunes Store is a little clunky but it works fine.Apple also have the Apple Store, which is a separate thing that's a website - I believe it's a WebObjects app and the iTunes Store is as well.",
    "points": null,
    "time": "2015-12-01T21:04:47.000Z"
  },
  {
    "author": "jdminhbg",
    "text": "> Apple also have the Apple Store, which is a separate thing that's a website - I believe it's a WebObjects app and the iTunes Store is as well.This might have changed since they rolled the store into the main apple.com site, but as far as I know none of that is public for sure.",
    "points": null,
    "time": "2015-12-02T03:58:47.000Z"
  },
  {
    "author": "TazeTSchnitzel",
    "text": "They did roll it into the main site, yeah, but I'd be surprised if it's actually a different app now.",
    "points": null,
    "time": "2015-12-02T15:07:44.000Z"
  },
  {
    "author": "accommodavid",
    "text": "The saddest part about this is that using WebViews really doesn't have to mean that it's clunky and slow. Slack's interface is pure HTML, CSS and JavaScript and it works just fine.",
    "points": null,
    "time": "2015-12-02T08:04:55.000Z"
  },
  {
    "author": "Bjartr",
    "text": ">creating a decent store frontBecause when looking at the metrics they care about (see: $) they see a runaway success, and dismiss the idea that it isn't already \"decent\".",
    "points": null,
    "time": "2015-12-01T21:18:55.000Z"
  },
  {
    "author": "leonroy",
    "text": "I don't think that most web developers looking for a job think 'Apple'. Google and Facebook would likely be their top pick and not surprising since both of those companies are far more web centric - Apple has historically not been so.It's almost a chicken and egg situation where unless Apple builds top tier web apps they won't attract top tier web devs. Without top tier web devs they of course will struggle to build scalable, fast and user friendly web apps.I'd imagine inertia also plays a role. Apple clearly have a lot of talent who know Cocoa and Obj-C inside and out. Chances are their current devs prioritise those kinds of apps over the kinds you might see Google or FB prioritise. Heck look at how long it took FB to come out with a decent iOS app. Their first mobile version was HTML with a native wrapper. It took FB time to build the talent base to do a decent app (believe they even had to hire Loren Brichter to consult to help them with it!).Every company has its specialities. Apple is getting better but as their data loss issues with Photos and Apple Music, as well as their problems with MobileMe show they are clearly finding it hard getting web devs who can build what they need fast enough. It'll take them time - they have enough cash to get there but they sure are alienating a lot of users and devs with these issues.",
    "points": null,
    "time": "2015-12-03T10:47:13.000Z"
  },
  {
    "author": "rimantas",
    "text": "xml/json as uses now is data transfer format, not some UI markup. As for why would it be better — because Cocoa is light years ahead in UI libraries and optimizations compared to web mess.",
    "points": null,
    "time": "2015-12-01T20:22:33.000Z"
  },
  {
    "author": "nailer",
    "text": "The app store has never felt slower than native apps for me. Instagram also seems to do pretty well.",
    "points": null,
    "time": "2015-12-01T20:54:03.000Z"
  },
  {
    "author": "krschultz",
    "text": "Instagram is a native app.",
    "points": null,
    "time": "2015-12-01T22:27:20.000Z"
  },
  {
    "author": "s73v3r",
    "text": "Instagram's UI is made in HTML.",
    "points": null,
    "time": "2015-12-02T04:08:58.000Z"
  },
  {
    "author": "ThomPete",
    "text": "I agree with you on almost everything beside the web view part. In my understanding web view is used because it's a very advanced layout engine and way easier and more flexible to deal with than to set all this up using the native layout engine.Edit: For clarity.",
    "points": null,
    "time": "2015-12-01T20:02:26.000Z"
  },
  {
    "author": "0x4a42",
    "text": "Is it supposed to be a joke/sarcasm?",
    "points": null,
    "time": "2015-12-01T20:15:40.000Z"
  },
  {
    "author": "ThomPete",
    "text": "No but perhaps I wasn't being clear what I meant sorry.What I mean is that using web view make it way easier to layout out networked assets. At least thats my experience having worked with both.",
    "points": null,
    "time": "2015-12-01T20:17:41.000Z"
  },
  {
    "author": "rimantas",
    "text": "You had some reaaaaally reallly weird experience then. I don't even understand what you mean by \"laying out networked assets\". With proper architecture your UI won't even know where assets come from.",
    "points": null,
    "time": "2015-12-01T20:23:51.000Z"
  },
  {
    "author": "ThomPete",
    "text": "What I mean is that laying out using xcode isn't as easy as using a web view for the kind of layout that are needed for something like the app store.Not sure why this is such a crazy thing to say that I need to be down voted for it.",
    "points": null,
    "time": "2015-12-01T20:30:05.000Z"
  },
  {
    "author": "alextgordon",
    "text": "100% with you. I love AppKit, but the amount of code required to make a simple custom button is insane. What is 5 seconds of CSS takes a good 30 minutes of wrangling with NSButton/NSButtonCell. The very existence of PaintCode is an indictment.It doesn't make sense to say that WebViews aren't \"native\". With a little effort they can be made to blend in perfectly. It's the same CoreGraphics.",
    "points": null,
    "time": "2015-12-01T21:02:39.000Z"
  },
  {
    "author": "kitsunesoba",
    "text": "I think that’s countered a bit by less of a need for custom widgets. In fact I’d argue that one of the big points of appeal for native Mac apps is that they eschew tons of custom widgets in favor of the standard system kit whenever possible.There’s also a good deal of power that you gain when writing custom Cocoa widgets; drawing is usually done with Core Graphics, which is a blazing fast, extremely capable C API. There’s a lot you can do in custom Cocoa widgets that would be impractical or dog slow with HTML+CSS+JS.EDIT: Also, one big, big difference between WebView apps and AppKit apps is that while WebView apps might get their appearance reasonably close to native, they almost always miss the mark entirely when it comes to widget behavior.",
    "points": null,
    "time": "2015-12-02T00:44:09.000Z"
  },
  {
    "author": "ThomPete",
    "text": "Yes but the context is the mac app store which is much more a web-layout than a native app layout.",
    "points": null,
    "time": "2015-12-02T01:38:42.000Z"
  },
  {
    "author": "jjoonathan",
    "text": "That's the problem, yes.",
    "points": null,
    "time": "2015-12-02T05:16:02.000Z"
  },
  {
    "author": "jjoonathan",
    "text": "> What is 5 seconds of CSS takes a good 30 minutes of wrangling with NSButton/NSButtonCell. The very existence of PaintCode is an indictment.Imperative graphics and view hierarchies certainly make simple things tedious, but they'll never match the DOM's ability to occasionally make simple things nigh-impossible either.I'm curious, if you call drawRect ugly then what do you call the menagerie of frameworks required to strong-arm the declarative environment of the web into the simplest of desktop tasks (shadow DOM, anyone?) Pot, kettle?> With a little effort they can be made to blend in perfectly.I'll believe it when I see it. I'll grant you that this works OK on windows, but that's due to MS making the decision to bring the widget kit down to web-level rather than the other way around. Meanwhile, iTunes and the AppStore continue the long and well-established tradition of poor integration.> It's the same CoreGraphics.Hidden behind a dozen trendy frameworks, a hundred bloated abstractions, and a thousand crusty layout engine implementation details to glue it all together.",
    "points": null,
    "time": "2015-12-02T05:52:18.000Z"
  },
  {
    "author": "ThomPete",
    "text": "The context is layout not logic. There is a world of difference between the flexibility and portability of web formatting and desktop formatting.Apps like Uber, Instagram and others use the hybrid approach.",
    "points": null,
    "time": "2015-12-02T14:53:49.000Z"
  },
  {
    "author": "myhf",
    "text": "WebView can work, but with no loading meters or error displays it's very painful. If a third-party developer released an app using WebViews the way Apple does, they would get a ton of complaints.",
    "points": null,
    "time": "2015-12-02T01:28:58.000Z"
  },
  {
    "author": "ThomPete",
    "text": "Sure I am not saying their implementation is good, just that the reason why they use it is most probably because it's much less painful to layout.",
    "points": null,
    "time": "2015-12-02T01:39:46.000Z"
  },
  {
    "author": "joeblau",
    "text": "The layout in iTunes and the Mac App store app is something that you can implement with a native constraints based layout.",
    "points": null,
    "time": "2015-12-01T20:58:11.000Z"
  },
  {
    "author": "ThomPete",
    "text": "Yes but is it as easy to do? For all it's shortcomings very few things are as flexible and powerfull as being able to use web technologies to layout.",
    "points": null,
    "time": "2015-12-01T21:06:43.000Z"
  },
  {
    "author": "joeblau",
    "text": "If you know what you're doing(which Apple should since they created the constraint system), then it's not that hard especially with the current constraint structure. There really isn't any technical reason why they shouldn't be able to reimplement iTunes natively and use backend API's to just serve content.",
    "points": null,
    "time": "2015-12-02T02:21:37.000Z"
  },
  {
    "author": "ThomPete",
    "text": "I don't think it's as easy as you think.Having played around with apples layout and general UI related stuff myself quite a lot I can tell you that it's a lot harder than webviews. We are talking perhaps 50X for the kind of stuff like the App store.",
    "points": null,
    "time": "2015-12-02T02:41:01.000Z"
  },
  {
    "author": "joeblau",
    "text": "> I don't think it's as easy as you think. I've been developing iOS and Mac apps for 8 years so my response is based on that experience.",
    "points": null,
    "time": "2015-12-02T14:02:58.000Z"
  },
  {
    "author": "ThomPete",
    "text": "Yeah. So don't know how much web you have done. But in my experience and many others i know who have done both. It really is much harder than web.",
    "points": null,
    "time": "2015-12-02T14:55:07.000Z"
  },
  {
    "author": "joeblau",
    "text": "> So don't know how much web you have done. I've been developing websites since 1998.",
    "points": null,
    "time": "2015-12-02T17:10:53.000Z"
  },
  {
    "author": "ThomPete",
    "text": "OK then I guess we just have to very different experiences of doing layout :)",
    "points": null,
    "time": "2015-12-02T18:32:48.000Z"
  },
  {
    "author": "altonzheng",
    "text": "Apple totally has the resources to make a great native app experience, even if it's much more tedious. I don't see why they don't go the extra mile, especially since the app store generates so much revenue...",
    "points": null,
    "time": "2015-12-02T02:40:14.000Z"
  },
  {
    "author": "ThomPete",
    "text": "This is not a question of ability but what is gained from making it native vs. hybrid. You don't gain anything from using the native layout model that can't be done via web view.There is no doubt the App Store is horribly done, but for the kind of content that is going to be in the store I simply don't see why they would choose otherwise.Keep in mind that the apps also exist on the web. This would force apple to still make a web version and a native version.Don't see what is gained from this.",
    "points": null,
    "time": "2015-12-02T03:21:41.000Z"
  },
  {
    "author": "tmd83",
    "text": "Its also very slow and whole UI is extremely buggy. Buttons would often be in improper state, download would start very slow, sometimes progress bar wouldn't show up even though download is happening. Resume would fail, caching would fail and almost nothing would give you any reasonable error message or something to solve the problem.It;s probably the buggiest piece of software I have ever had to use. The backend service might be good (or not) but the basic store app feels like something written by an student.",
    "points": null,
    "time": "2015-12-01T20:53:26.000Z"
  },
  {
    "author": "duaneb",
    "text": "> Have a \"Power User / Developer Tools\" category and associated checkbox in iTC that says \"My app needs to opt-out of these parts of sandboxing\". Put those apps through a much more strenuous review process.I disagree with this. I like the sandbox constraint; i don't mind opting out of the app store if my needs necessitate dropping the sandbox. I also think the interface of the app store is the least of its concerns.Everything else you said is on fleek.",
    "points": null,
    "time": "2015-12-01T21:21:07.000Z"
  },
  {
    "author": "archagon",
    "text": "By Apple's own analogy, Macs are \"trucks\". So why cater to the non-power users when you know (by virtue of the fact that your other platform is strictly sandboxed) that practically all your power users are on the Mac?Strict sandboxing is not a good fit for the Mac.",
    "points": null,
    "time": "2015-12-01T23:35:44.000Z"
  },
  {
    "author": "duaneb",
    "text": "No, I think power users are not a good fit for the apple store. I don't see a huge problem with downloading signed code from another site.",
    "points": null,
    "time": "2015-12-04T06:12:01.000Z"
  },
  {
    "author": "mcphage",
    "text": "I think the reason it feels so sluggish is that the servers it pulls data from take so long to respond. I don't think a native view would help with that, but it's absolutely something they need to fix.",
    "points": null,
    "time": "2015-12-01T21:49:51.000Z"
  },
  {
    "author": "kalleboo",
    "text": "Agreed. The iTunes Store has always felt extremely slow to me, even back in the day when it was implemented as native views.",
    "points": null,
    "time": "2015-12-02T02:29:25.000Z"
  },
  {
    "author": "charlesism",
    "text": "* There's also the 30% cut, which makes no sense when you're talking about a well-known and well-trusted app like Sketch. Nobody fears installing Sketch outside of the MAS, so BC may as well host it themselves. I imagine the average new Sketch user discovers the app via recommendation, or article on the web, so BC will likely make more money away from the MAS. Especially when you factor in the improvements: faster bugfixes, and new features they can without sand-boxing.",
    "points": null,
    "time": "2015-12-02T00:31:26.000Z"
  },
  {
    "author": "kalleboo",
    "text": "Also for software more expensive than about $10, a trial is a must, and the Mac App Store doesn't allow for trials. So the user will seek out the trial version on their website, and then why even bother with the App Store?",
    "points": null,
    "time": "2015-12-02T02:28:12.000Z"
  },
  {
    "author": "xs",
    "text": "Sketch team. I am a Mac user and heard thing about your product but haven't yet checked it out. This blog post is the first time I've visited your website. Can you answer one thing for me? Why don't you have a link to sketch.com from blog.sketch.com?",
    "points": null,
    "time": "2015-12-01T19:56:47.000Z"
  },
  {
    "author": "kalleboo",
    "text": "It's there at the bottom (\"Home\"). Looks like it's a tumblr, I guess they don't have 100% control over the content?",
    "points": null,
    "time": "2015-12-02T06:38:56.000Z"
  },
  {
    "author": "eldilibra",
    "text": "I've downloaded the new, non-MAS version, but I'm not getting any migration instructions, though I should since I've purchased the old version. Troubling, since the post made it sound so easy!",
    "points": null,
    "time": "2015-12-01T19:59:30.000Z"
  },
  {
    "author": "geekamongus",
    "text": "So someone can just enter email addresses until one works, then get a license?",
    "points": null,
    "time": "2015-12-01T20:37:18.000Z"
  },
  {
    "author": "bolle",
    "text": "The license is sent to the email address (says the screenshot). If you have access to that mailbox, you get the license.",
    "points": null,
    "time": "2015-12-01T20:48:25.000Z"
  },
  {
    "author": "zulfishah",
    "text": ">App Review continues to take at least a week- this is one of the most frustrating things about Mac (and iOS) development. There's no good reason why this cannot be brought down to 1-2 days by hiring a ton of people to the App Review staff. App Review is not really a technical skill that should be very hard to scale up, and one that can't be outsourced to locations outside of Cupertino. Apple is the most cash-rich company in the world; they can easily throw some money at this problem if they cared about developer satisfaction. Far easier to resolve than problems like sandboxing and upgrade pricing, where there is a major cost for customer satisfaction to think about.",
    "points": null,
    "time": "2015-12-01T20:53:46.000Z"
  },
  {
    "author": "jhbadger",
    "text": "How do apps like \"Clozure Common Lisp\" get around the sandboxing? The Mac App Store version isn't crippled in any way I can see -- it can read and write outside its directory -- for example it can use the quicklisp package manager which stores files in my home directory?",
    "points": null,
    "time": "2015-12-01T20:57:03.000Z"
  },
  {
    "author": "kybernetyk",
    "text": "It seems not to be sandboxed at all. At least that's what codesign reports for the binary.",
    "points": null,
    "time": "2015-12-02T00:18:36.000Z"
  },
  {
    "author": "mh-",
    "text": "I just downloaded it.. there is indeed no entitlements, no container, nothing.I guess it must have an exemption given that it was originally in the app store prior to the mandatory sandboxing deadline[0].[0] http://www.macworld.com/article/1167055/sandboxing_deadline_...",
    "points": null,
    "time": "2015-12-02T20:12:31.000Z"
  },
  {
    "author": "Fizzadar",
    "text": "So the direct version instantly crashes on 10.11.2 beta, the app store version continues to run perfectly. Oh, the irony.",
    "points": null,
    "time": "2015-12-01T21:18:53.000Z"
  },
  {
    "author": "hakcermani",
    "text": "The certificate expiration issue apart I would move to a non appstore version at least for my 1Password. I started using 1Password to store all my passwords including iTunes password and the recovery email. One fine day, I try to launch 1P and i get an error box saying I need to authorize the app on the computer using my iTunes ! Rats now this is a deadlock ! Possible solutions are use the same password for 1Password vault and iTunes or buy iPassword from agilebits directly. I will go the latter route in future.",
    "points": null,
    "time": "2015-12-01T21:27:24.000Z"
  },
  {
    "author": "kyriakos",
    "text": "a bit off-topic but they should really port Sketch to Windows and Linux.",
    "points": null,
    "time": "2015-12-01T21:56:29.000Z"
  },
  {
    "author": "kitsunesoba",
    "text": "In addition to those mentioned here in the comments already, another problem that publishing through the Mac App Store is how buggy OS X’s sandboxing can be. I don’t know if the problem still exists under 10.11 (I bet it does but I haven’t checked), but one bug that I’ve hit consistently has to do with file open/save dialogs.Open/save dialogs in sandboxed apps aren’t opened directly. Instead, requests are handled by the privileged powerboxd helper daemon, which then passes back user choices to the sandboxed app. This sounds great in theory, but something that happens somewhat frequently is that some part of powerboxd’s dialog initialization silently fails and doesn’t open a dialog, leaving the user confused as to why his requested open dialog didn’t open. Worse, when it happens, it can happen several times in a row, meaning the user can try several times and not get any kind of feedback whatsoever.It’s been a known issue since at least 10.7 and last I checked (10.10) it still hadn’t been fixed. This is a showstopping bug for many kinds of apps but it’s simply been ignored.I’ve been wanting to move off of the MAS but as a one-man shop, writing in serial code support, trial mode, and registration is daunting, not to mention getting old users set up with a new license. I might just delay the move away from MAS until the next major release.",
    "points": null,
    "time": "2015-12-02T00:37:31.000Z"
  },
  {
    "author": "kilon",
    "text": "Dont get what the big deal is, Mac App Store is far from the most popular way to install new apps. The vast majority of my desktop apps for my iMac i got them from outside Mac App Store via the web. Out of the 20 apps I got on my dock only 2 are from App store.And I dont think that any of the other apps I have on my dock are even available from app store.",
    "points": null,
    "time": "2015-12-02T21:01:59.000Z"
  },
  {
    "author": "Rio_Tous",
    "text": "consider China market, things are even worse due to network problem.",
    "points": null,
    "time": "2015-12-07T05:09:00.000Z"
  }
]