{
  "meta.json": "{\n  \"rank\": 30,\n  \"title\": \"Scans prove there's no such thing as a 'male' or 'female' brain\",\n  \"url\": \"https://www.newscientist.com/article/dn28582-scans-prove-theres-no-such-thing-as-a-male-or-female-brain/\",\n  \"hn_url\": \"https://news.ycombinator.com/item?id=10659610\",\n  \"points\": 2,\n  \"author\": \"eplanit\",\n  \"comment_count\": 0\n}",
  "article.txt": "Scans prove there's no such thing as a 'male' or 'female' brain | New Scientist Close Advertisement Skip to content Sign in Search the website Events Tours Shop Subscribe now Explore by section News Features Newsletters Podcasts Video Comment Culture Games | This week's magazine Explore by subject Health Space Physics Technology Environment Mind Humans Life Mathematics Chemistry Earth Society Explore our products and services Events Tours Shop Subscribe now Subscribe now Humans Scans prove there's no such thing as a 'male' or 'female' brain By Jessica Hamzelou 30 November 2015 Facebook / Meta Twitter / X icon Linkedin Reddit Email Petr Strnad/Millennium Images, UK You may have read that having a male brain will earn you more money. Or maybe that female brains are better at multitasking. But there is no such thing as a female or male brain, according to the first search for sex differences across the entire human brain. It reveals that most people have a mix of male and female brain features. And it also supports the idea that gender is non-binary, and that gender classifications in many situations are meaningless. “This evidence that human brains cannot be categorised into two distinct classes is new, convincing, and somehow radical,” says Anelis Kaiser at the University of Bern, Switzerland. The idea that people have either a “female” or “male” brain is an old one, says Daphna Joel at Tel Aviv University in Israel. “The theory goes that once a fetus develops testicles, they secrete testosterone which masculinises the brain,” she says. “If that were true, there would be two types of brain.”Advertisement To test the theory, Joel and her colleagues looked for differences in brain scans taken from 1400 people aged between 13 and 85. The team looked for variations in the size of brain regions as well as the connections between them. In total, the group identified 29 brain regions that generally seem to be different sizes in self-identified males and females. These include the hippocampus, which is involved in memory, and the inferior frontal gyrus, which is thought to play a role in risk aversion. “There are not two types of brain” When the group looked at each individual brain scan, however, they found that very few people had all of the brain features they might be expected to have, based on their sex. Across the sample, between 0 and 8 per cent of people had “all-male” or “all-female” brains, depending on the definition. “Most people are in the middle,” says Joel. This means that, averaged across many people, sex differences in brain structure do exist, but an individual brain is likely to be just that: individual, with a mix of features. “There are not two types of brain,” says Joel. Spatial awareness Although the team only looked at brain structure, and not function, their findings suggest that we all lie along a continuum of what are traditionally viewed as male and female characteristics. “The study is very helpful in providing biological support for something that we’ve known for some time – that gender isn’t binary,” says Meg John Barker, a psychologist at the Open University in Milton Keynes, UK. The findings will still come as a surprise to many, including scientists, says Bruce McEwen at the Rockefeller University in New York. “We are beginning to realise the complexity of what we have traditionally understood to be ‘male’ and ‘female’, and this study is the first step in that direction,” he says. “I think it will change peoples’ minds.” Markus Hausmann at Durham University, UK, isn’t surprised by the findings, however. He has been studying sex differences in cognition, such as whether men, as commonly believed, really do have better spatial awareness than women. “Across all kinds of spatial skills, we find very, very few that are sensitive to sex,” says Hausmann. “We have also identified spatial problems where women outperform men – the black-and-white idea of a male or female brain is clearly too simple.” Cultural expectations Despite persisting stereotypes, girls are no worse than boys at science and maths subjects, either. “People get wedded to the idea that being male or female is highly predictive of having different aptitudes or career choices,” says Margaret McCarthy, who studies brain sex differences at the University of Maryland School of Medicine in Baltimore. “This study fights against the idea that these outcomes are based on biological differences, as opposed to cultural expectations.” Other body systems are also often wrongly considered to be either male or female, says Joel. Alexandra Kautzky-Willer, head of the Gender Medicine Unit at the Medical University of Vienna in Austria, agrees that things aren’t so simple. “There are differences between men and women when you look in large groups, and these are important for diagnosis and treatment,” she says. “But there are always more differences within genders. We always need to look at culture, environment, education and a person’s role in society,” she says. If a neuroscientist was given someone’s brain without their body or any additional information, they would still probably be able to guess if it had belonged to a man or a woman. Men’s brains are larger, for example, and are likely to have a larger number of “male” features overall. But the new findings suggest that it is impossible to predict what mix of brain features a person is likely to have based on their sex alone. Genderless future Joel envisions a future in which individuals are not so routinely classified based on gender alone. “We separate girls and boys, men and women all the time,” she says. “It’s wrong, not just politically, but scientifically – everyone is different.” But other scientists contacted by New Scientist don’t think that will ever be possible – as a sexually reproductive species, identifying a person’s biological sex will always be of paramount importance to us, they say. Even so, Joel’s findings can be used to help many people understand the non-binary nature of gender, says Barker. After all, some people don’t identify as either male or female, and others feel their gender identity shift over time. “It’s a shame that people’s experience alone isn’t enough for us to recognise as a society that non-binary gender is legitimate.” “We need to start thinking a lot more carefully about how much weight we give to gender as a defining feature of human beings, and stop asking for it in situations where it simply isn’t relevant,” says Barker. PNAS DOI: 10.1073/pnas.1509654112 Read more: “A welcome blow to the myth of distinct male and female brains” Topics:psychology/brains/education Advertisement Sign up to our weekly newsletter Receive a weekly dose of discovery in your inbox. We'll also keep you up to date with New Scientist events and special offers. Sign up More from New Scientist Explore the latest news, articles and features CommentThe best new popular science books of January 2026CultureMindThe emotion you never knew you had, and how to feel more of itFeaturesMindWhy it is important to make space for solitude over the festive seasonCommentMindWhat I’ll be doing to help detox my brain in the new yearComment Popular articles Trending New Scientist articles 1 Chess can be made fairer by rearranging the pieces 2 What if the idea of the autism spectrum is completely wrong? 3 Weird clump in the early universe is piping hot and we don’t know why 4 Low on energy? A new understanding of rest could help revitalise you 5 The secret weapon that could finally force climate action 6 The first commercial space stations will start orbiting Earth in 2026 7 Passwords will be on the way out in 2026 as passkeys take over 8 High-achieving adults rarely began as child prodigies 9 The best new science fiction books of January 2026 10 Jellyfish sleep about as much as humans do – and nap like us too Advertisement Close Close Download the app Find us on social media Instagram Facebook X / Twitter Tiktok LinkedIn BlueSky Subscriptions Subscriber benefits Gift Student & graduate Educational Corporate Support Contact us FAQs About us Press room Advertise Write for us Tools Events CoLab Syndication RSS feeds Legal and privacy Complaint policy Privacy policy Cookie policy Terms & conditions Cookie Settings © Copyright New Scientist Ltd. Back to the top",
  "comments.json": "[]"
}