{
  "meta.json": "{\n  \"rank\": 6,\n  \"title\": \"JSFiddle Updates\",\n  \"url\": \"https://medium.com/jsfiddle-updates/the-lifting-cb3c9f216c2f#.msjzxdzb1\",\n  \"hn_url\": \"https://news.ycombinator.com/item?id=10659787\",\n  \"points\": 38,\n  \"author\": \"insidethewebb\",\n  \"comment_count\": 0\n}",
  "article.txt": "HomepagePublished inJSFiddle UpdatesSign in / Sign up19829Oskar KrawczykBlockedUnblockFollowFollowingOskar KrawczykDec 13 min readThe LiftingSo this just happened, a JSFiddle update. There’s no denying that this doesn’t happen very often, to be more precise visual changes aren’t happening that often.I’m calling this a lifting for a reason, as opposed to many backend changes that happened over the years, this is a purely visual (or front-endish) one.There were a few ideas we were working towards with this update:Squeeze every inch out of the UI for more editing spaceMake the interface super-lightOptimize loading and rendering speedWe’ve removed some whitespace that was useless in the previous interface, like the gap between editors that was there purely for the the drag handles, which are now there but visually take just a single pixel (not it really is a pixel wide — there’s a 10 pixel overlay so it’s easier to grab the handle).A lot of effort was put into getting the ground for removing the sidebar altogether.Yes, the sidebar is still there, but it’ll be gone in the future updates.For now we’ve moved some sections of the sidebar into the appropriate editor panels — for example the JavaScript panel has all the JS related options.As it was pointed over at our Github Issues, the front-end wasn’t as optimized as it might have been. Namely the amount of assets requests made to the server.There were 49 requests made… Less than ideal. So one night I’ve end up putting together a Gulpfile to stitch and optimize some assets together. Result, ~9 requests, and around 3x less load time. Not bad.We’ve also figured that it’s a bit lame not to use asynchronous calls where it’s possible in 2015, so now, saving/updating/forking works asynchronously.Some other smaller updates:Bumped CodeMirror version to the newest oneActivated a few CodeMirror add-ons: matchbrackets.js, closebrackets.js, matchtags.js and closetag.jsIndent now defaults to 2 spacesNew syntax coloringInternal styles have been rewritten into PostCSSAdded Headway widget so everyone’s up to date will upcoming updates (notice the red badge over the logo)So, what’s next?Two things. Both very important to me and the future of JSFiddle.Last month Michał joined the team, he and myself started working full-time on the next major version of JSFiddle, a complete rewrite, full of new, awesome stuff. If you’re interested in following the progress follow Building the new JSFiddle publication.While we’re working on the new JSFiddle, the current version will get the same amount of support. It’s not going anywhere for now.JavaScriptWeb DevelopmentJsfiddle19829BlockedUnblockFollowFollowingOskar KrawczykCreator of @jsfiddle. Freshly roasted coffee buff. Front-ender. Music addict. Single-speed cyclist. Longobarder. Photographer, at times.FollowFollowingJSFiddle UpdatesA stream for upcoming JSFiddle updates×Don’t miss Oskar Krawczyk’s next storyBlockedUnblockFollowFollowingOskar Krawczyk",
  "comments.json": "[\n  {\n    \"author\": \"bloggerden\",\n    \"text\": \"Did anyone notice they changed their branding too?I remember it spelled jsFiddleIt seems they changed it to JSFiddle\",\n    \"points\": null,\n    \"created_at\": \"2015-12-01T23:46:41.000Z\",\n    \"depth\": 0\n  },\n  {\n    \"author\": \"Nadya\",\n    \"text\": \"The article uses jsFiddle while the legal disclaimer on JSFiddle reads JSFiddle. The announcement of &quot;The Lifting&quot; uses JSFiddle. Meanwhile, the documentation can&#x27;t make up its mind:    jsFiddle Documentation\\n\\n    To file a bug in JSFiddle\\n\\nThough it mostly uses jsFiddle.&#x2F;begin editThe Medium post uses JSFiddle: https:&#x2F;&#x2F;medium.com&#x2F;jsfiddle-updates&#x2F;the-lifting-cb3c9f216c2f...I think it&#x27;s safe to assume it has been changed to JSFiddle.&#x2F;end editMore on topic: I&#x27;ll have to see if there was anything new besides a facelift. Personally using Codepen atm.\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T00:39:32.000Z\",\n    \"depth\": 1\n  },\n  {\n    \"author\": \"erikpukinskis\",\n    \"text\": \"I&#x27;ve been really digging http:&#x2F;&#x2F;codepen.io but I&#x27;ll give jsfiddle another shot next time I&#x27;m in the need for a scratchpad.\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T01:38:49.000Z\",\n    \"depth\": 0\n  },\n  {\n    \"author\": \"iLoch\",\n    \"text\": \"One of the things that bugs me about JSFiddle is that I can&#x27;t do console.log and have it show up somewhere other than my console. Would be nice if I could replace the HTML&#x2F;CSS windows with a JS console for JS-only development.I&#x27;ve just started to use Node interactive mode instead, which works fine but doesn&#x27;t let me side load scripts easily.\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T02:08:11.000Z\",\n    \"depth\": 0\n  },\n  {\n    \"author\": \"dflock\",\n    \"text\": \"This might be what you&#x27;re looking for: http:&#x2F;&#x2F;jsconsole.com&#x2F;\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T02:21:11.000Z\",\n    \"depth\": 1\n  },\n  {\n    \"author\": \"dang\",\n    \"text\": \"Url changed from http:&#x2F;&#x2F;www.whatpixel.com&#x2F;jsfiddle-redesign-2015&#x2F;, which points to this.\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T03:32:06.000Z\",\n    \"depth\": 0\n  },\n  {\n    \"author\": \"iamleppert\",\n    \"text\": \"I&#x27;ll have to say I&#x27;m not really a fan. I liked the higher contrast better, it&#x27;s easier to read monospaced font on a darker background.At least give people a choice of light vs. dark?\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T05:20:45.000Z\",\n    \"depth\": 0\n  },\n  {\n    \"author\": \"drinchev\",\n    \"text\": \"JSFiddle is much more slower than jsbin.comAnother thing is that jsbin supports live-reload editing of html &amp; css. For jsfiddle I have to hit RUN every time I edit HTML &#x2F; CSS.Long time ago, when I was accumulating my stack overflow reputation, I used to do demos with jsfiddle. Back then I remembered how I switched to jsbin, which was so much faster and has a console.log panel which makes it even superior ( not to mention it&#x27;s open source ).Anyway jsfiddle has it&#x27;s place in the history and kudos for the team that supports it.\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T10:35:19.000Z\",\n    \"depth\": 0\n  }\n]"
}