{
  "meta.json": "{\n  \"rank\": 25,\n  \"title\": \"What could dark matter be?\",\n  \"url\": \"http://www.symmetrymagazine.org/article/what-could-dark-matter-be\",\n  \"hn_url\": \"https://news.ycombinator.com/item?id=10659633\",\n  \"points\": 2,\n  \"author\": \"micaeloliveira\",\n  \"comment_count\": 0\n}",
  "article.txt": "What could dark matter be? | symmetry magazine Skip to main content Topics Higgs boson Neutrinos Dark matter Dark energy New physics Applications Full archive Follow Search A joint Fermilab/SLAC publication Artwork by Sandbox Studio, Chicago What could dark matter be? 12/01/15 By Laura Dattaro Scientists don’t yet know what dark matter is made of, but they are full of ideas. Although nearly a century has passed since an astronomer first used the term “dark matter” in the 1930s, the elusive substance still defies explanation. Physicists can measure its effects on the movements of galaxies and other celestial objects, but what it’s made of remains a mystery. In order to solve it, physicists have come up with myriad possibilities, plus a unique way to find each one. Some ideas for dark matter particles arose out of attempts to solve other problems in physics. Others are pushing the boundaries of what we understand dark matter to be. “You don’t know which experiment is going to ultimately show it,” says Neal Weiner, a New York University physics professor. “And if you don’t think of the right experiment, then you might not find it. It’s not just going to hit you in the face, because it’s dark matter.” Artwork by Sandbox Studio, Chicago WIMPs The term WIMP encompasses many dark matter particles, some of which are discussed in this list. Short for weakly interacting massive particles, WIMPs would have about 1 to 1000 times the mass of a proton and would interact with one another only through the weak force, the force responsible for radioactive decay. If dark matter were a pop star, WIMPs would be Beyoncé. “WIMPs are the canonical candidate,” says Manoj Kaplinghat, a professor of physics and astronomy at the University of California, Irvine. But a recent surge in data has cast new doubt on their existence. Despite the fact that scientists are hunting for them in experiments in space and on Earth, including ones at the Large Hadron Collider, WIMPs have yet to show themselves, making the restrictions on their mass, interaction strength and other properties ever tighter. If WIMPs do fail to appear, the upshot will be a push for creative new solutions to the dark matter mystery—plus a chance to finally cross something off the list. “If we don’t see it, it will at least end up closing the chapter on a really dominant paradigm that’s been the guide in the field for many, many years,” says Mariangela Lisanti, a theoretical particle physicist at Princeton University. Artwork by Sandbox Studio, Chicago Sterile neutrinos Neutrinos are almost massless particles that shape-shift from one type to another and can stream right through an entire planet without hitting a thing. As strange as they are, they may have an even odder counterpart known as sterile neutrinos. These most elusive particles would be so unresponsive to their surroundings that it would take the entire age of the universe for just one to interact with another bit of matter. If sterile neutrinos are the stuff of dark matter, their reluctance to interact might seem to spell doom for physicists hoping to detect them. But in a poetic twist, it’s possible that they decay into something we can find quite easily: photons, or particles of light. “Photons, we’re pretty good at,” says Stefano Profumo, a physics professor at the University of California, Santa Cruz. Last year, physicists using space-based telescopes discovered a steady signal with the energy predicted for decaying sterile neutrinos streaming from the centers of galaxy clusters. But the signal could originate from a different source, such as potassium ions. (Profumo proposed this idea in a paper provocatively titled “Dark matter searches going bananas.”) A new Japanese telescope known as ASTRO-H has much better energy resolution and may be able to put an end to the debate. Artwork by Sandbox Studio, Chicago Neutralinos The canonical example of a WIMP, the neutralino, arises out of the theory of Supersymmetry. Supersymmetry posits that every known particle has a “super” partner and helps to fill some holes in the Standard Model, but its particles have stubbornly eluded observation. Some of them, like the partners of the photon and the Z boson, have properties akin to dark matter. Dark matter could be a mix of these supersymmetric particles, and the one we’d be most likely to observe is known as the neutralino. Discovering a neutralino would help solve two massive physics problems—it would tell us the identity of dark matter and would give us proof of the existence of Supersymmetry. But it would also leave physicists with the conundrum of all those other missing supersymmetric particles. “If dark matter is a neutralino, it’s essentially telling us there’s a whole host of other new stuff that’s out there that’s just waiting to be discovered,” Lisanti says. “It opens up a floodgate of really, really interesting and very exciting work to be done.” Artwork by Sandbox Studio, Chicago Asymmetric dark matter In the beginning of the universe, matter and antimatter collided furiously, annihilating each other on contact until, somehow, only matter was left. But there’s nothing in the Standard Model of particle physics that says this must be so. Antimatter and matter should have existed in equal amounts, wiping each other out and leaving an empty universe. That’s clearly not the case, and physicists don’t yet know why. It’s possible the same principle applies to dark matter. In a twist on the standard neutralino theory, which includes the property that neutralinos are their own antiparticle, an idea known as asymmetric dark matter proposes that anti-dark matter particles were wiped out by their dark matter counterparts, leaving behind the dark matter we see today. Finding asymmetric dark matter could help answer not only the question of what dark matter is, but also why we’re here to look for it. Artwork by Sandbox Studio, Chicago Axions As the search for WIMPs faces challenges, a particle known as the axion is generating new excitement. The axion itself is not new. Physicists first imagined its existence in the early 1980s, shortly after physicists Helen Quinn and Roberto Peccei published a landmark paper that helped to solve a problem with the strong nuclear force. While it’s been simmering in the background as a dark matter candidate for decades, experimentalists haven’t been able to search for it—until now. “We’re just recently getting to the stage of having experiments that are able to probe the most interesting regions of axion parameter space,” says physics professor Risa Wechsler of the Kavli Institute for Particle Astrophysics and Cosmology, a joint institute of Stanford University and SLAC National Accelerator Laboratory. The University of Washington’s Axion Dark Matter Experiment (ADMX) is on the hunt for axions , using a strong magnetic field to try to turn them into detectable photons. At the same time, theorists are beginning to imagine new types of axions, along with novel ways to search for them. “There’s been a renaissance in axion theory, leading to a lot more excitement in axion experiments,” says UCI theoretical physicist Jonathan Feng. Artwork by Sandbox Studio, Chicago Mirror world dark matter Just like strange objects and creatures inhabited the world beyond Alice’s looking glass, dark matter might exist in an entirely separate world full of its own versions of all the elementary particles. These dark protons and neutrons would never interact with us, save through gravity, exerting a pull on matter in our world without leaving any other trace. “The only reason we know there’s something out there called dark matter is because of gravity,” Feng says. “This embodies that very beautifully.” Beautiful as it may be, the theory leaves little hope for ever detecting dark matter. But there are hints that dark photons might be able to morph into regular photons, similar to the way neutrinos oscillate among flavors. This has spawned active research into understanding and finding these mysterious particles. Artwork by Sandbox Studio, Chicago Extra dimensional dark matter If dark matter doesn’t exist in another world entirely, it might live in a fourth spatial dimension unseen by humans and our experiments. Such a dimension would be too small for us to observe a particle’s movements within it. Instead, we would see multiple particles with the same charge but different masses, an idea proposed by Theodor Kaluza and Oskar Klein in the 1920s. One of these particles could be the dark matter particle, a much more recent concept known as Kaluza-Klein dark matter. These particles wouldn’t shine or reflect any light, explaining why dark matter can’t be seen by anyone in our three dimensions. Confirming that dark matter exists in another dimension could also be seen as support for string theory, which requires extra dimensions to work. “You can go out there and map out the extra-dimensional world just like 500 years ago people mapped out the continents,” Feng says. Artwork by Sandbox Studio, Chicago SIMPs Though physicists have never detected dark matter, they have a pretty good idea of how much of it exists, based on observations of galaxies. But observations of the inner regions of galaxies don't match up with some dark matter simulations, a puzzle physicists and astronomers are still working to solve. Those simulations often assume that dark matter doesn’t interact with itself, but there’s no reason to believe that has to be the case. That realization has led to the concept of strongly interacting massive particles, or SIMPs, the latest newcomer to the crowded field of dark matter candidates. Simulations run with SIMPs seem to eliminate the discrepancy in other models, Feng says, and could even explain the strange photon signal emanating from galaxy clusters, rather than sterile neutrinos. Artwork by Sandbox Studio, Chicago Composite dark matter Dark matter could be none of these candidates—or it could be more than one. “There is no reason for dark matter to be just one particle, not a single one,” Kaplinghat says. “We only assume it is for simplicity.” After all, visible matter is made up of a swarm of particles, each with their own properties and behaviors, each able to combine with others in countless ways. Why should dark matter be any different? Dark matter could have its own equivalents of quarks and gluons interacting to form dark baryons and other particles. There could be dark atoms, made of several particles linked together. Whatever the case, dark matter is likely to keep physicists probing the depths of the universe for decades, revealing new mysteries even as old ones are solved. Follow Print Facebook Bluesky LinkedIn Reddit Use your browser’s print dialog box to create a pdf. Dark Matter 101 Learn more about one of the most sought-after substances in the universe. 04/04/23 Is dark matter the most powerful wave in the universe? Dark matter could consist of particles so ultralight, they behave more like waves. 10/12/21 Is dark matter cold, warm or hot? The answer has to do with dark matter’s role in shaping the cosmos. 09/07/21 Curious physics results could shed light on dark matter Even experiments that aren’t looking for dark matter directly could give us hints about the mysterious substance that permeates our universe. 07/28/20 What dark matter is (probably) not No one knows for sure what dark matter is. But we know we need something to explain what we see in the universe, and we’ve crossed a few ideas off of our list. 02/11/20 What we know about dark matter Although scientists have yet to find the spooky stuff, they aren’t completely in the dark. 01/21/20 The other dark matter candidate As technology improves, scientists discover new ways to search for theorized dark matter particles called axions. view full collection popular on symmetry 07/28/16 The deconstructed Standard Model equation The Standard Model is far more than elementary particles arranged in a table. 08/23/16 Five facts about the Big Bang It’s the cornerstone of cosmology, but what is it all about? 04/30/20 The large boson-boson collider Scientists study rare, one-in-a-trillion heavy boson collisions happening inside the LHC. 08/01/07 The particle physics life list Bird watchers have \"life lists\" of species they hope to see in their lifetimes. Why shouldn'\u0092t particle physics fans do the same? With that in mind, in our April issue we asked readers to help us put together the first particle physics life list. more on topic 04/07/20 Dark matter decoys The ADMX experiment trains scientists to deal with real signals—by creating fake ones. 02/11/20 What we know about dark matter Although scientists have yet to find the spooky stuff, they aren’t completely in the dark. 01/21/20 The other dark matter candidate As technology improves, scientists discover new ways to search for theorized dark matter particles called axions. 01/07/20 Vera Rubin, giant of astronomy The Large Synoptic Survey Telescope will be named for an influential astronomer who left the field better than she found it. 09/30/19 A day in the life of a cosmic-ray ‘bookkeeper’ Early-career physicist Jonathan LeyVa is helping to build one of the world’s most sensitive dark matter detectors. 08/13/19 Testing DAMA An Italian experiment has a 20-year signal of what could be dark matter—and scientists are embarking on their most promising efforts yet to confirm or refute its results. 07/18/19 A day in the life of a dark matter data wrangler Maria Elena Monzani prepares an international team to search for clues to one of the biggest scientific mysteries. 06/10/19 Berkeley leans into search for light dark matter Dark matter could be much lower in mass and slighter in energy than previously thought. Load More View full archive An online magazine about particle physics. Subscribe Contact About Archive Copyright 2025 Symmetry Magazine A joint Fermilab/SLAC publication Symmetry receives funding through the US Department of Energy. Terms of Use",
  "comments.json": "[]"
}