{
  "title": "Singular 'They' Is Word of the Year",
  "summary": "In December 2015, linguist Dennis Baron wrote about singular 'they' being named Word of the Year by the Web of Language Distinguished Usage Panel (which he humorously notes consisted entirely of himself). The article traces the 650-year history of singular they in English, noting how it naturally fills a linguistic gap for gender-neutral pronouns. The discussion centered on whether singular they was a natural evolution (supported by centuries of usage by major writers) or an awkward linguistic imposition. Commenters debated grammatical correctness, practical necessity, alternatives like invented pronouns (xe, zie), and the politics of pronoun choice.",
  "what_happened": "Singular 'they' has become dramatically normalized and officially endorsed. The AP Stylebook accepted it in 2017. By 2020, major style guides (APA, Chicago Manual of Style, Oxford English Dictionary, Merriam-Webster) all accepted singular they. Merriam-Webster named it Word of the Year in 2019. The Chicago Manual of Style, 18th edition (2024), now explicitly endorses generic singular they as acceptable in formal writing. Oxford's dictionaries recognized it as established, correct usage. College-aged speakers use nonbinary they at high rates. What was controversial in 2015 became institutional consensus by 2024. The skeptics warning against forced linguistic change were proven wrong—the change happened organically, driven by genuine communication needs rather than engineering.",
  "most_prescient": {
    "user": "DennisP",
    "reason": "DennisP predicted in 2015: 'Singular they might well be the future.' This was precisely what happened. DennisP correctly grasped that singular they, despite grammatical purists' objections, would likely prevail because invented pronouns (like xe, zie) would fail to gain traction, leaving they as the natural default. By 2024, this prediction came true exactly as forecasted—singular they became standard while artificial neopronouns remained niche."
  },
  "most_wrong": {
    "user": "tosseraccount",
    "reason": "tosseraccount claimed singular they was an artificial imposition pushed by 'social engineering' and warned 'Language change should be natural, not forced.' This was entirely backward. Singular they succeeded precisely because it was natural and organic—600+ years of historical usage. Meanwhile, all the forced, engineered attempts at neopronouns failed. The user misdiagnosed the situation completely, confusing natural language evolution with artificial engineering."
  },
  "notable_aspects": "1. The article's self-deprecating humor ('The Web of Language Distinguished Usage Panel...consists entirely of me') set a tongue-in-cheek tone that the comments embraced.\n\n2. Several commenters made meta-jokes using singular they while discussing singular they, creating delightfully self-referential moments (e.g., jpmattia's comment about the author not including examples 'and they doesn't include any examples').\n\n3. The discussion revealed genuine linguistic arguments: some noted that 'you' underwent exactly the same transformation (from plural to singular with plural verbs), yet nobody complained about that precedent.\n\n4. Commenters from non-English-speaking backgrounds praised singular they as solving a problem their native languages handle better, while English speakers discussed which alternatives (made-up pronouns vs. they) felt less jarring.\n\n5. The emoji comparison: bitwize humorously noted that Oxford's actual 2015 Word of the Year was the crying emoji (U+1F602), making a joke article's choice of singular they seem more substantive by comparison.",
  "grades": {
    "DennisP": {
      "grade": "A+",
      "rationale": "Made an accurate, confident prediction that singular they would be 'the future.' Showed good linguistic intuition by recognizing that invented pronouns would fail and natural language solutions would win."
    },
    "dang": {
      "grade": "A",
      "rationale": "Correctly contextualized that singular they is not new language change but established usage going back 600 years. Accurately pointed out that the real linguistic engineers were the 18th-century grammarians who tried to impose generic 'he'."
    },
    "cpeterso": {
      "grade": "A",
      "rationale": "Wisely reframed the temporal question: 'singular they is also the past' in response to DennisP's 'might well be the future.' Understood that singular they represented restoration of ancient usage, not innovation."
    },
    "tosseraccount": {
      "grade": "F",
      "rationale": "Fundamentally misunderstood what was happening, claiming singular they was 'forced social engineering' rather than natural language evolution. The historical record proved the opposite: natural they vs. engineered pronouns."
    },
    "dragonwriter": {
      "grade": "A",
      "rationale": "Provided consistently accurate linguistic analysis throughout multiple threads, correctly explaining grammatical vs. semantic number, the precedent of 'you,' and the distinction between prescriptive and descriptive grammar."
    },
    "warfangle": {
      "grade": "A",
      "rationale": "Made prescient point that singular they would be needed by non-binary people specifically, not just for unknown-gender contexts. This prediction has borne out—nonbinary they usage is now documented and widespread in the linguistic literature."
    },
    "colept": {
      "grade": "D",
      "rationale": "Warned against 'this new trend of making gender irrelevant' as if singular they was a political invention. Proved wrong—singular they's adoption was organic and its use includes genuinely non-binary people seeking dignity, not merely political correctness."
    },
    "baddox": {
      "grade": "B+",
      "rationale": "Raised a legitimate technical linguistic point (singular they still pairs with plural verbs) but didn't recognize this wasn't actually a problem—the precedent of 'you' shows English had resolved this exact issue centuries ago."
    },
    "sampo": {
      "grade": "A",
      "rationale": "Made the insightful observation that requiring gender specification where unnecessary is like forcing speakers to specify color for objects where color is irrelevant. This framing proved prophetic as institutions embraced singular they for exactly this reason."
    },
    "ctdonath": {
      "grade": "C",
      "rationale": "Complained that singular they was now 'irritating' and 'ignoring the plural definition.' Proved wrong by history—most English speakers embraced it by 2024 precisely because it's not actually irritating to native speakers who use it intuitively."
    }
  },
  "score": 8
}