{
  "meta.json": "{\n  \"rank\": 15,\n  \"title\": \"Singular ‘They’ Is Word of the Year\",\n  \"url\": \"https://illinois.edu/blog/view/25/280996\",\n  \"hn_url\": \"https://news.ycombinator.com/item?id=10658372\",\n  \"points\": 77,\n  \"author\": \"secondary\",\n  \"comment_count\": 147\n}",
  "article.txt": "blog posts\nSingular they is word of the year\nNov 19, 2015 1:30 pm\nby\nDennis Baron\nShare on Facebook\nTweet\nEmail\nImages\nDelete\nEdit\nembedded media in the Files Tab and re-insert as needed.\nalign image left\nalign image center\nalign image right\nSingular\nthey\nis word of the year for 2015. A common-gender third-person pronoun, singular\nthey\nhas been popular in English speech and writing for over 650 years. Although frequently classified by purists as ungrammatical, its use seems undiminished, and it may even be on the rise because it fills an important linguistic niche. In recent years, more and more English speakers have sought a gender-neutral alternative to pronouns that express the traditional male/female binary, turning either to invented pronouns like\nxe\nand\nzie\n, or to that old stand-by, singular\nthey.\nBecause singular\nthey\nhas witnessed a dramatic rehabilitation over the past year\n,\nthe Web of Language Distinguished Usage Panel unanimously chose to honor it as word of the year for 2015.*\nSingular\nthey\nwas Word of the Year back in 1365, when it first appeared in English as a gender-neutral English pronoun. It won again in 1885, when it was praised in the Atlanta\nConstitution\nfor triumphing over the ignorant opposition of grammarians and lexicographers\n.\nThat award was later asterisked because most speakers of English, who regularly used singular\nthey\nin speech and writing, capitulated to the purists who insisted that it was an illiterate blunder.\nThe history of\nthey\ngoes back well before the fourteenth century.\nThey\nwas originally a plural pronoun, borrowed by the Anglo-Saxons from Scandinavian invaders. If you think that using\nthey\nas a singular offends the purity of English grammar, get over it. As we learn from the BBC docudrama, “The Last Kingdom,”\nthey\nis an immigrant word that waded ashore with undocumented Danes in the ninth century and became thoroughly English, just as the Danes did.\nTo be fair, the Anglo-Saxons probably thought, when they first heard it, that plural\nthey\nwas as barbaric as the Vikings who brought it, but English speakers gradually found themselves using plural\nthey—\njust as Modern English speakers use singular\nthey—\nbecause it did something no native English word could do. By the time “the Northmen” came to England, Anglo-Saxon third-person pronouns were starting to sound alike. Old English\nhē,\n‘he,’ was getting confused with\nhēo,\n‘she,’ and both were sounding more and more like\nhīe,\n‘they.’ Having so many pronouns with similar pronunciations made it harder to tell who was who in any given sentence: Are you talking to\nhim\n(singular)\n?\nAre you talking to\nhim\n(plural)\n?\nDespite its foreignness, an imported word made things so much clearer: Are you talking to\nthem?\nThen, over time, the newly-nativized plural\nthey\nbegan to fill in as a singular when gender was unknown or irrelevant. No other word seemed able to do that. This blurred the singular/plural distinction again, but that didn’t seem to matter, since context could still indicate whether the pronoun referred to one or more than one.\nFor most of its long history, singular\nthey\nwasn’t controversial. But toward the end of the eighteenth century, some American language commentators began fussing about its correctness. In 1794, three women responded to a complaint about their use of singular\nthey\nin a newspaper article by saying, \"we wished to conceal the gender,\" and they invited their critic to coin an alternative pronoun (\nThe Medley, or Newbedford (MA) Marine Journal,\nMarch 4, 1794, p.2).\nOther calls for a new pronoun \"of the common gender\" begin to appear around that time--in 1808 Samuel Taylor Coleridge suggested that the pronoun\nit\nmight work \"in order to avoid particularising man or woman, or in order to express sex indifferently\" (\nAnima Poetae\n[1897], p. 190). From the 1850s on, in newspaper columns headed “The Missing Word” or “A Needed Word,” wordsmiths complained that using\nhe\nfor both men and women was ungrammatical, since pronouns are supposed to agree with their antecedents—the words they refer to—in\ngender\nas well as number, and generic masculines like\nhe\nviolate that gender agreement rule. They also called singular\nthey\n“illiterate” because it violates the number agreement rule.\nAs early as 1851, a the Lowell, MA,\nMorning News\ncalled for the invention of a common-gender pronoun to solve the problem of what word to use when referring to a singular common-gender noun like\nperson\n, or\ngrammarian,\nor\nvoter\n: “Will not some of our grammar makers ‘fish us up’ one?” (reprinted in the Brattleboro, Vermont,\nSemi-Weekly Eagle,\nJan. 1, 1852). In 1875, an Ohio newspaper, also in the new-pronoun camp, called singular\nthey\na “blunder” sometimes found in good writing and ubiquitous in advertising, and in a burst of feminism, warned against the generic\nhe,\n“because the instincts of justice are stronger than those of grammar” (Findlay, Ohio,\nJeffersonian,\nMay 14, 1875, p.1). And two years later, a pseudonymous writer facetiously suggests that\num,\ncoined “years ago by some linguistic genius,” is as good a pronoun as any: “If any person is dissatisfied with the language as it now stands, we should recommend um to adopt it” (Inter Ocean, writing in the Nebraska\nAdvertiser,\nBrownville, NE, October 4, 1877, p. 1).\nRecommending the use of the invented common-gender pronoun\nE\n, in 1878 an Illinois paper observed that in order to avoid both generic masculine and singular\nthey,\n“scholars” must resort to ridiculous circumlocutions:\nLet every brother or sister examine himself or herself, and, looking into his or her heart, find out his or her besetting sin and resolutely cast it from him or her.\nSteering a course between illiteracy and pretension, the author of “The Missing Word” promotes\nE\nas “just as good a pronoun for the third person as ‘I’ is for the first,” claiming that the paradigm\ne, es, em\nhad been proposed “by somebody over a year ago,” and illustrating its aptness with this sentence:\nLet every brother and sister examine “emself,” and, looking into “es” heart, find out “es” besetting sin and resolutely cast it from “em.”\nDelete\nEdit\nembedded media in the Files Tab and re-insert as needed.\nalign image left\nalign image center\nalign image right\nExcerpt from “The Missing Word,”\nThe Morning Star and Catholic Messenger,\nNew Orleans, Nov. 17, 1878, p. 1; reprint of an article that first appeared in the\nMoline\n(IL)\nDispatch,\nand referencing an earlier discussion of pronouns in the Peoria, IL,\nDaily Tribune.\nE\nnever took off, despite being\nreinvented independently\nin 1890, 1977, 1989, and 1992 (and perhaps more recently as well). Other invented common-gender pronouns like\nthon\n(1884) and\nheer\n(1912) shared the same oblivion, even though they appeared in respected dictionaries. Lately, pronouns like\nxe and zie,\nhave generated interest, particularly among transgender and gender-nonconforming persons, but even when these coined words aren't stirring up controversy, they always seem out of place, and their use remains limited.\nIn contrast,\nsingular\nthey\n,\nwhich arose naturally and has been in widespread use for centuries both in speech and in writing, is showing strong signs of becoming accepted. Although frequently condemned as ungrammatical, singular\nthey\nhad at least one early advocate. C. K. Maddox, writing in the\nAtlanta Constitution\nin 1885, rejects the invented\nse, sis, sim,\nand calls grammarians and dictionary makers “positively stupid” for failing to recognize the popular common-gender use of singular\nthey,\nwhich is “in daily practice among the people.” As Maddox notes, singular\nthey\nin literature “is so natural to the genius of our language that hardly one in a hundred has noticed it as an intrusion” (\nAtlanta Constitution,\nreprinted in the Anderson, South Carolina,\nIntelligencer\n, May 21, 1885, p. 4; a C. K. Maddox is listed as alderman and tax collector in Atlanta around that time).\nIf you think singular\nthey\nis wrong because a plural pronoun can't refer to a singular noun, you're wrong:\nyou,\noriginally plural, has doubled as the standard English singular second person pronoun for hundreds of years, and no one's longing to return to the good old days of of Merrie England when people called each other\nthou, thee,\nand\nthy.\nSome of today’s style guides continue to regard singular\nthey\nas an error, but that opposition is evaporating rapidly. The fourteenth edition of the\nChicago Manual of Style\napproved singular\nthey\n(1993, pp. 76-77n.), but responding to criticism of this decision, the editors of the influential style guide walked back that decision in the current, sixteenth, edition (2010; sec. 5.227). But most of the other major style books now authorize singular\nthey,\nparticularly in reference to an indefinite noun.\nThe latest edition of\nThe New Fowler’s Dictionary of Modern English Usage\n(1996) dismisses objections to singular\nthey\nas unsupported by the historical record of English and observes that, with few exceptions, the construction is “passing unnoticed” by speakers of standard English as well as by copy editors. Singular\nthey\nis also \"approved\" by the\nOxford English Grammar; The New Fowler's Dictionary of Modern English Usage; The New Oxford Dictionary; the New Oxford American Dictionary; Merriam-Webster's Collegiate Dictionary;\nand the\nCambridge Guide to English Usage.\nThis year singular\nthey\nwas recommended by the Candian Department of Justice Style Guide and by the\nWashington Post Style Book.\nSingular\nthey\nhas passed the test of time and good usage. Even its harshest critics use singular\nthey--\na sure sign that resistance is futile. As popular resistance to grammatical and to gender nonconformity continues to weaken, it’s time for singular\nthey\nto take its rightful place in the paradigm of English personal pronouns. Singular\nthey\nwon’t bring about a linguistic meltdown or end gender discrimination, but it’s been flourishing bravely despite fierce opposition, and it clearly merits the honor of being the 2015 Word of the Year.\n-----\n*Truth in advertising: The Web of Language Distinguished Usage Panel, charged each year with picking the Word of the Year, consists entirely of me.\nFor the whole story on gender-neutral and nonbinary pronouns, click to order your copy of my new book,\nWhat’s Your Pronoun? Beyond ‘he’ and ‘she.’\nstats\n17,136 Views\n9 Comments\nadditional actions\nAdd Comment\nShare on Facebook\nTweet\nEmail",
  "comments.json": "[\n  {\n    \"author\": \"padobson\",\n    \"text\": \"This bit:Singular they was Word of the Year back in 1365, when it first appeared in English as a gender-neutral English pronoun. It won again in 1885, when it was praised in the Atlanta Constitution for triumphing over the ignorant opposition of grammarians and lexicographers.Reads like an Onion article. Am I not in on the joke?\",\n    \"points\": null,\n    \"depth\": 0,\n    \"created_at\": \"2015-12-01T20:32:33.000Z\"\n  },\n  {\n    \"author\": \"qntty\",\n    \"text\": \"Truth in advertising: The Web of Language Distinguished Usage Panel, charged each year with picking the Word of the Year, consists entirely of me.\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T20:35:42.000Z\"\n  },\n  {\n    \"author\": \"Shog9\",\n    \"text\": \"Black humor, I think. The author is ruefully noting that, while this usage has existed for hundreds of years, it manages to keep dropping out of fashion only to be reinvented in a new generation.\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T20:37:06.000Z\"\n  },\n  {\n    \"author\": \"bitwize\",\n    \"text\": \"I find it interesting that a joke article has a better choice for Word of the Year than the OED's actual Word of the Year (the emoji U+1F602, \\\"FACE WITH TEARS OF JOY\\\").\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T21:02:17.000Z\"\n  },\n  {\n    \"author\": \"untothebreach\",\n    \"text\": \"> turning either to invented pronouns like xe and zieThis made me pause...aren't all pronouns (and for that matter, words in general) \\\"invented?\\\" Are they (see what I did there...) just making a distinction between words that are adapted or modified from other words, and ones that aren't?\",\n    \"points\": null,\n    \"depth\": 0,\n    \"created_at\": \"2015-12-01T20:34:34.000Z\"\n  },\n  {\n    \"author\": \"jnevill\",\n    \"text\": \"Perhaps \\\"Newly invented pronouns\\\" would have been more clear. The distinction being Singular \\\"They\\\" has been around for a long time, and \\\"Xe\\\" can't be pronounced by the human mouth and confuses the older folk. Or something...\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T20:40:37.000Z\"\n  },\n  {\n    \"author\": \"untothebreach\",\n    \"text\": \"Ha, well as one of the \\\"older folk,\\\" I will say that while \\\"xe\\\" doesn't confuse me, it is definitely a bit jarring when I see it used. I have no problem with it's use, I am just not used to seeing it. I recently read a book by a fantasy author whose stories I enjoy, but in this latest book she used \\\"xe\\\" quite often to describe some non-binary characters, and it always managed to pull me out of the story.\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-01T20:45:35.000Z\"\n  },\n  {\n    \"author\": \"coke12\",\n    \"text\": \"I'm reading Greg Egan's Diaspora right now and he uses ve, ver, and vis for the (post-/non-human) main characters. It's definitely exciting in a worldbuilding sort of way but I still prefer they, them, and their because it's much less jarring.\",\n    \"points\": null,\n    \"depth\": 3,\n    \"created_at\": \"2015-12-01T20:59:07.000Z\"\n  },\n  {\n    \"author\": \"chc\",\n    \"text\": \"AFAIK most words in our language are evolved rather than invented. You may as well call our height \\\"invented.\\\"\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T20:59:05.000Z\"\n  },\n  {\n    \"author\": \"DennisP\",\n    \"text\": \"I've never liked this, but I have to admit that logically, a mismatch in number is no worse than the mismatch in gender we get by using \\\"he,\\\" which has the disadvantage of being annoying to many people. And I don't think efforts to make up a new pronoun are likely to succeed. Singular \\\"they\\\" might well be the future.But if I could have my pick I'd go with \\\"um.\\\"\",\n    \"points\": null,\n    \"depth\": 0,\n    \"created_at\": \"2015-12-01T20:37:15.000Z\"\n  },\n  {\n    \"author\": \"cpeterso\",\n    \"text\": \"> Singular \\\"they\\\" might well be the future.As the article describes, singular they is also the past. Its usage has a long historical precedent over 650 years.\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T20:54:02.000Z\"\n  },\n  {\n    \"author\": \"baddox\",\n    \"text\": \"The interesting thing is that the singular usage of \\\"they\\\" doesn't get used with singular verbs. It seems that the syntactic pluralness of \\\"they\\\" is too strong for it to simply get thrown in place of \\\"he\\\" or \\\"she\\\" without changing the verbs.I would say \\\"she is here\\\" or \\\"he is here,\\\" but not \\\"they is here.\\\"\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T20:58:29.000Z\"\n  },\n  {\n    \"author\": \"davesque\",\n    \"text\": \"In that case, it seems like you would say \\\"they are here.\\\" and realize that it's only one person from context.\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-01T21:06:23.000Z\"\n  },\n  {\n    \"author\": \"progval\",\n    \"text\": \"One of the things I find weird in English is you do that too “you”: “you are” even when talking to a single person; whereas in French (for instance) there are two different pronouns for the singular and plural use of “you” (“tu” and “vous”), with different forms forms for the verbs.So using plural form of verbs with singular “they” does not seem that surprising to me.\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-01T21:17:54.000Z\"\n  },\n  {\n    \"author\": \"dragonwriter\",\n    \"text\": \"English \\\"you\\\" is the grammatically plural (previously used also to denote formality, where it is not semantically plural) form, corresponding to French \\\"vous\\\". The English grammatically singular form (\\\"thee/thou\\\") corresponding to French \\\"tu\\\" has generally fallen out of use, so \\\"you\\\" has in effect become the all-purpose 2nd-person pronoun, but its still grammatically plural.Likewise, \\\"they\\\" is grammatically plural, regardless of its contextual semantics.\",\n    \"points\": null,\n    \"depth\": 3,\n    \"created_at\": \"2015-12-01T21:23:13.000Z\"\n  },\n  {\n    \"author\": \"fian\",\n    \"text\": \"Some sub-cultures of Australian society use: \\\"youse\\\" as the plural for \\\"you\\\" when addressing more than one person. For example: \\\"Youse guys are late\\\". Here there is a double plural \\\"youse\\\" and \\\"guys\\\" for one group of people. Also \\\"guy\\\" is generally considered to refer to men, but in this context \\\"guys\\\" is gender neutral - the group of people being referred to can be composed of both men and women.\",\n    \"points\": null,\n    \"depth\": 3,\n    \"created_at\": \"2015-12-01T23:59:48.000Z\"\n  },\n  {\n    \"author\": \"ward\",\n    \"text\": \"But you also use \\\"vous\\\" as a form of politeness, be it to people older than yourself, more formal situations, or just people you do not know. It is very prevalent. This form also still has the verb in its plural form despite talking to only one person.\",\n    \"points\": null,\n    \"depth\": 3,\n    \"created_at\": \"2015-12-02T00:52:05.000Z\"\n  },\n  {\n    \"author\": \"dragonwriter\",\n    \"text\": \"> The interesting thing is that the singular usage of \\\"they\\\" doesn't get used with singular verbs.Verb forms agree with the grammatical number of the subject, independent of the semantic number; in English those almost always are the same, but aside from \\\"they\\\", \\\"you\\\" (which is grammatically plural, even though its semantics are sometimes singular) is a case where they can diverge.\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-01T21:25:56.000Z\"\n  },\n  {\n    \"author\": \"baddox\",\n    \"text\": \"> Verb forms agree with the grammatical number of the subject, independent of the semantic numberThat's what I find interesting: that \\\"they\\\" isn't actually being used grammatically as a singular pronoun that can be dropped in to replace \\\"he\\\" or \\\"she.\\\" The entire grammatical construct is exactly the same as if \\\"they\\\" was referring to multiple people. It's the context that makes it clear that only a single person is being referred to.\",\n    \"points\": null,\n    \"depth\": 3,\n    \"created_at\": \"2015-12-02T01:15:04.000Z\"\n  },\n  {\n    \"author\": \"untothebreach\",\n    \"text\": \"I would say that it is no worse only in the context of \\\"grammatical correctness.\\\" In practice, assuming that a subject is one gender or another ends up favoring half the population over the other half, while using the surrounding context to make a usually-plural pronoun singular favors no group over another.I also really like \\\"um\\\" too, though :)\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T20:59:09.000Z\"\n  },\n  {\n    \"author\": \"DennisP\",\n    \"text\": \"By saying \\\"they\\\" is no worse I didn't mean to imply it's no better. Perhaps my bit on \\\"he\\\" annoying people understates the issue though.\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-01T21:48:59.000Z\"\n  },\n  {\n    \"author\": \"wces\",\n    \"text\": \"South Asian languages routinely employ plurals to refer to/call a person with added respect. Even when speaking English many South Asians won't find anything amiss when he/she is replaced by they.\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T21:13:04.000Z\"\n  },\n  {\n    \"author\": \"JoshTriplett\",\n    \"text\": \"> South Asian languages routinely employ plurals to refer to/call a person with added respect.Sounds almost like a third-person equivalent of the first-person use of \\\"royal we\\\".\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-01T21:13:55.000Z\"\n  },\n  {\n    \"author\": \"jacobolus\",\n    \"text\": \"In Old English, thou was the singular second person pronoun and ye the plural, but would be used when talking to someone of higher status. From what I understand, the ye evolved into you while thou mostly disappeared, so now we all get to be plural. I’m not sure about third person pronouns though.See https://en.wikipedia.org/wiki/T–V_distinction\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-01T21:29:53.000Z\"\n  },\n  {\n    \"author\": \"dragonwriter\",\n    \"text\": \"> In Old English, thou was the singular second person pronounNot just Old English; it survived in active, everyday use well into Modern English.\",\n    \"points\": null,\n    \"depth\": 3,\n    \"created_at\": \"2015-12-01T21:41:30.000Z\"\n  },\n  {\n    \"author\": \"mitchty\",\n    \"text\": \"Don't the Pennsylvania Dutch still use it? I vaguely recall there being a community out east that uses either thee or thou still with regularity.\",\n    \"points\": null,\n    \"depth\": 4,\n    \"created_at\": \"2015-12-01T22:09:59.000Z\"\n  },\n  {\n    \"author\": \"Florin_Andrei\",\n    \"text\": \"> South Asian languages routinely employ plurals to refer to/call a person with added respect.Fairly common for some Eastern European languages, too.\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-01T21:32:50.000Z\"\n  },\n  {\n    \"author\": \"mei0Iesh\",\n    \"text\": \"\\\"They\\\" isn't really used illogically.If someone wants to understand, they only need to examine it beyond what they learned as rules in English class.The use of \\\"they\\\" is usually general, when not really pointing to a specific person. If Dennis is standing in front of me, and someone asked me whom to speak to, I wouldn't point at Dennis and say, \\\"They is the one to speak to\\\".But if I was talking about DennisP online, and I didn't know who was behind that vague identifier, and someone asked whom could help, I might say, \\\"I talked to DennisP earlier, and they helped me with my problem.\\\"For all I know, \\\"DennisP\\\" is an organization, or shared account. It's a vague generality, when the individual attributes of a person are unknown or irrelevant.It's like when one speaks in general ways that apply to all mankind, and you might even use the word \\\"you\\\" to refer to, not YOU, but anyone.\\\"They\\\" works great because a group is a vague fuzzy kind of thing. In the plural form, speaking of them, over there, and their attributes, it's not so much about the plurality, as it is the abstract fuzziness of it.All that we're doing is applying that same fuzziness in the direction of what could possibly be a smaller target in terms of numeration.That is why, I don't think those rules about singular and plural were ever really correct. It isn't the numbers that we were trying to convey with the words, but the fuzziness.\\\"He\\\" and \\\"She\\\" are referencing specific object types with common properties across the whole of the specific object. Whereas \\\"They\\\" is referencing an object with either mixed or unknown properties.Do you see what I'm saying? It isn't about the count, but the uniqueness of known attributes for a specific target. It just so happens that when you have many of an object, the commonality of attributes blurs, and so the \\\"they\\\" pointer appears to be about the number of objects. Then some people who aren't thinking beyond that get upset if you violate the number when using they to point to >1.When really, it's just about fuzz.I don't use \\\"they\\\" as any kind of feminist thing. I just think that \\\"he or she\\\" is not only incredibly distracting and inefficient, but it is the illogical one. Also referring to fuzzy things as \\\"he\\\" or \\\"she\\\" are both wrong, because they are trying to instantiate objects using a template that requires certain attributes when the properties of the spoken of object are unknown or irrelevant to the conveyed concept.\\\"He\\\" when the boy template is needed. \\\"She\\\" when the girl template is needed. \\\"They\\\" when a fuzzy generic container works better. The number of people references is irrelevant. Just like how an organization may contain many people, but we refer to it as if it were a person. Even an individual person is an organization of smaller components.\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T21:23:03.000Z\"\n  },\n  {\n    \"author\": \"erikpukinskis\",\n    \"text\": \"> I wouldn't point at Dennis and say, \\\"They is the one to speak to\\\".The correct conjugation is \\\"They are the one to talk to\\\" which to me is a perfectly sensible to way to refer to DennisP.\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-02T02:29:22.000Z\"\n  },\n  {\n    \"author\": \"undersuit\",\n    \"text\": \">a mismatch in number is no worseAnd we've had that same issue for years with you and you.\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T23:46:36.000Z\"\n  },\n  {\n    \"author\": \"patrickfl\",\n    \"text\": \"Scanned the article, can someone give me a solid example of how this is used in a sentence?\",\n    \"points\": null,\n    \"depth\": 0,\n    \"created_at\": \"2015-12-01T20:38:29.000Z\"\n  },\n  {\n    \"author\": \"untog\",\n    \"text\": \"\\\"patrickfl didn't bother to read the article, as a result they were uninformed.\\\"\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T20:40:02.000Z\"\n  },\n  {\n    \"author\": \"g4k\",\n    \"text\": \"This may be right, but it does not sound right.\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-01T20:56:02.000Z\"\n  },\n  {\n    \"author\": \"dang\",\n    \"text\": \"It doesn't sound right because the username includes \\\"patrick\\\", which implies a \\\"he\\\". Singular \\\"they\\\" doesn't replace \\\"he\\\" or \\\"she\\\" when gender is known.It sounds a bit more natural if you say \\\"That user didn't read the article, so they were uninformed.\\\"\",\n    \"points\": null,\n    \"depth\": 3,\n    \"created_at\": \"2015-12-01T21:14:33.000Z\"\n  },\n  {\n    \"author\": \"warfangle\",\n    \"text\": \"> Singular \\\"they\\\" doesn't replace \\\"he\\\" or \\\"she\\\" when gender is known.It does when the gender identity of the subject is known to be neither he nor she!\",\n    \"points\": null,\n    \"depth\": 4,\n    \"created_at\": \"2015-12-01T21:36:36.000Z\"\n  },\n  {\n    \"author\": \"untog\",\n    \"text\": \"Why not? This is not new at all, I've used it whenever I'm not sure of the gender of a subject for as long as I can remember.\",\n    \"points\": null,\n    \"depth\": 3,\n    \"created_at\": \"2015-12-01T21:30:45.000Z\"\n  },\n  {\n    \"author\": \"Afton\",\n    \"text\": \"It's not right. There are linguistic restrictions on gender-neutral, singular 'they'.[1] When the referent is known, it can't be used (i.e. it's not about 'patrick' and 'he' matching up, it's about 'they' not being usable with a known person).[2]My favourite real-life example of it's usage is one in which we know that the gender is female, and we know it's singular:\\\"If a mother wants to use the nursing room, they can just key in the code in their pamphlet\\\".[1] https://www.reddit.com/r/linguistics/comments/3cgbyv/limitat... gives some good discussion[2] I can't help but feel that these restrictions are related to nondefinite contexts for \\\"(negative polarity items)[https://en.wikipedia.org/wiki/Polarity_item]\\\", like 'no-one' and 'any', where you can't say e.g. *I ate any cake but you can say: I didn't eat any cake but you can also use it in questions: Did you eat any cake? This seems related to usages like If someone comes, tell them to wait vs *If John comes, tell them to wait.\",\n    \"points\": null,\n    \"depth\": 3,\n    \"created_at\": \"2015-12-01T22:05:52.000Z\"\n  },\n  {\n    \"author\": \"corysama\",\n    \"text\": \"\\\"...they was uninformed.\\\"I'm not a fan. If we have to go somewhere, I'd rather go with 'it'.\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-01T20:56:41.000Z\"\n  },\n  {\n    \"author\": \"dang\",\n    \"text\": \"That would be awful, but is a misunderstanding. People say \\\"they were\\\" for the singular, just like \\\"you were\\\" (not \\\"you was\\\").\",\n    \"points\": null,\n    \"depth\": 3,\n    \"created_at\": \"2015-12-01T21:27:37.000Z\"\n  },\n  {\n    \"author\": \"aaronbrethorst\",\n    \"text\": \"\\\"Alex has decided that they no longer want to be addressed by a gendered pronoun, and has requested that we all refer to them as 'they' and 'them' from now on.\\\"edit: I'd be interested in understanding why people find this very real scenario to be so downvote worthy. Is it because you find the idea of non-gendered pronouns upsetting, or because you think my example is unrealistic for some reason? Or something else entirely?\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T20:40:10.000Z\"\n  },\n  {\n    \"author\": \"pvg\",\n    \"text\": \"It's a contrived example since the typical use of the singular they is when the gender of the subject is unknown. You might be getting downvotes for complaining about downvotes.\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-01T20:56:18.000Z\"\n  },\n  {\n    \"author\": \"aaronbrethorst\",\n    \"text\": \"I am guessing you haven't talked with that many people who describe themselves as non-gender conforming, then. I was actually paraphrasing a conversation I had with some recently about their partner.\",\n    \"points\": null,\n    \"depth\": 3,\n    \"created_at\": \"2015-12-01T21:09:39.000Z\"\n  },\n  {\n    \"author\": \"pvg\",\n    \"text\": \"I'm not sure what to tell you other than 'I'm guessing I'm going to make unwarranted assumptions about you'\",\n    \"points\": null,\n    \"depth\": 4,\n    \"created_at\": \"2015-12-02T08:31:29.000Z\"\n  },\n  {\n    \"author\": \"jasonkostempski\",\n    \"text\": \"I think you're example is one of the few I would think of as specifically \\\"singular\\\". In most other examples I feel \\\"they\\\" refers to some instance of an nonspecific person from within a group of people, which is still singular but related to a group.\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-01T21:18:06.000Z\"\n  },\n  {\n    \"author\": \"jnevill\",\n    \"text\": \"patrickfl wished to be referred to with the gender-neutral, and more recently invented pronoun \\\"xe\\\", but no one could figure out how to pronounce it so they referred to them as they when they were using the third-person to refer to them.\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T20:44:19.000Z\"\n  },\n  {\n    \"author\": \"mhurron\",\n    \"text\": \"Very nice, singular and plural they.\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-01T21:16:45.000Z\"\n  },\n  {\n    \"author\": \"portmanteaufu\",\n    \"text\": \"\\\"If the user needs further assistance, they will need to open a support ticket.\\\"The leading clause of the sentence makes it clear that we're talking about an individual but does not indicate their (!) gender. You can use it anywhere that one might also use 'he or she'.\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T20:45:08.000Z\"\n  },\n  {\n    \"author\": \"volaski\",\n    \"text\": \"You see it in notifications from social apps. \\\"Jenny has started following you. Follow them back\\\", etc. Because a lot of apps don't ask people to enter their gender they just resort to \\\"them\\\" instead of \\\"him\\\" or \\\"her\\\". It's really as annoying as people just using \\\"her\\\" everywhere just to be safe.\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T20:45:33.000Z\"\n  },\n  {\n    \"author\": \"panglott\",\n    \"text\": \"Why is it annoying?\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-01T20:50:18.000Z\"\n  },\n  {\n    \"author\": \"volaski\",\n    \"text\": \"There are certain cases where it feels very ridiculous. For example, some authors use \\\"her\\\" to refer to even a group of people generally known to be predominantly male oriented. While it definitely won't be criticized by any feminist group, it really is distracting from narrative point of view because most readers feel it's unnatural. I remember thinking \\\"This guy is clearly talking about dudes, why is he using female pronoun?\\\" I also think it's stupid to have to use female pronoun just to be safe, because this in itself is sexism--it implies that they are afraid of feminists accusing them but not afraid of masculinists (if it even exists). When I say it's annoying I am not saying these people are annoying, I'm saying the reality we live in is annoying. In some non-english cultures they don't have this problem because they have ways to refer to people without being gender specific.\",\n    \"points\": null,\n    \"depth\": 3,\n    \"created_at\": \"2015-12-02T20:06:15.000Z\"\n  },\n  {\n    \"author\": \"JoeAltmaier\",\n    \"text\": \"Now we know how women feel, all day long every day. It'd be reasonable to say \\\"get over it\\\", which is essentially what women hear all their lives.\",\n    \"points\": null,\n    \"depth\": 4,\n    \"created_at\": \"2015-12-02T20:08:26.000Z\"\n  },\n  {\n    \"author\": \"volaski\",\n    \"text\": \"Your sentence is obviously valid but i'm not sure how it relates to my comment\",\n    \"points\": null,\n    \"depth\": 5,\n    \"created_at\": \"2015-12-02T21:17:20.000Z\"\n  },\n  {\n    \"author\": \"JoeAltmaier\",\n    \"text\": \"Its equally ridiculous to use either gendered form for the wrong group. But groups of women are called 'guys' all the time. The observation that it sounds funny/annoying when a group of 'dudes' is labeled using a feminine term, is only something a male would notice. I'm suggesting 'get over it' because men have no special right to be not-annoyed by this.\",\n    \"points\": null,\n    \"depth\": 6,\n    \"created_at\": \"2015-12-02T22:43:27.000Z\"\n  },\n  {\n    \"author\": \"volaski\",\n    \"text\": \"Please don't try to use wordplay to get your feminist ideology across. Nobody calls a girl \\\"Him\\\" in real life, just like nobody calls a guy \\\"Her\\\" in real life. That's what I pointed out, not some interpretation of \\\"guys\\\" (I can go on forever talking about the semantics for that term too but that's not even what I was talking about)\",\n    \"points\": null,\n    \"depth\": 7,\n    \"created_at\": \"2015-12-04T18:06:30.000Z\"\n  },\n  {\n    \"author\": \"JoeAltmaier\",\n    \"text\": \"I didn't think equality was a 'feminist ideology'. Its just humanism. That original point is, using 'her' to refer to a group of people, even men, seems odd. Its no less reasonable than using 'him'. So there are good reasons to mix it up.On a similar topic, I find it more amenable in an HN discussion to remove all references to 'you' and 'your'. Its adding nothing to the discussion, can feel like an attack, and distracts from the topic, to the people talking. Its close to Ad Hominem.\",\n    \"points\": null,\n    \"depth\": 8,\n    \"created_at\": \"2015-12-05T16:05:41.000Z\"\n  },\n  {\n    \"author\": \"GFK_of_xmaspast\",\n    \"text\": \"Why is using \\\"her\\\" everywhere worse than using \\\"him\\\" everywhere?\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-01T21:24:18.000Z\"\n  },\n  {\n    \"author\": \"dragonwriter\",\n    \"text\": \"> Why is using \\\"her\\\" everywhere worse than using \\\"him\\\" everywhere?Because its just as gendered and conflicts with standard usage (which, in English, accepts the use of the masculine linguistic gender for subjects of unknown sex or gender identity, so it is not better from either a \\\"gender neutrality, regardless of accepted usage\\\" standpoint or from a \\\"clarity of communication through conforming to accepted usage\\\" standpoint.)\",\n    \"points\": null,\n    \"depth\": 3,\n    \"created_at\": \"2015-12-01T21:31:32.000Z\"\n  },\n  {\n    \"author\": \"volaski\",\n    \"text\": \"Tell me, where did I say that? This behavior of yours (putting words in people's mouth and accusing or insinuating them of sexism/racism/elitism etc.) is exactly why this stupid \\\"singular they\\\" phenomenon has arisen.\",\n    \"points\": null,\n    \"depth\": 3,\n    \"created_at\": \"2015-12-02T19:50:52.000Z\"\n  },\n  {\n    \"author\": \"vorg\",\n    \"text\": \"It seems annoying because personal names like Jenny and John have grammatical gender in English, so the unknown grammar use of they/them/their seems unnatural. It's also perhaps why similar-sounding names are generally spelt differently between genders, e.g. Danny/Danni, Jerry/Jeri, Tony/Toni, Billy/Billie, Francis/Frances, Robin/Robyn, Sidney/Sydney.\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-01T22:32:13.000Z\"\n  },\n  {\n    \"author\": \"panglott\",\n    \"text\": \"No, they don't. There is only natural gender here, not grammatical gender.\",\n    \"points\": null,\n    \"depth\": 3,\n    \"created_at\": \"2015-12-03T20:00:36.000Z\"\n  },\n  {\n    \"author\": \"warfangle\",\n    \"text\": \"You'll see this in Facebook, too. Even though they ask for your gender.But that's because you can choose which set of pronouns you prefer.(They also have a pretty okay list of genders to choose from, if you're into labeling things)\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-01T22:50:39.000Z\"\n  },\n  {\n    \"author\": \"mkrfox\",\n    \"text\": \"I just wish they had \\\"Nonbinary\\\" for people who feel weird about the word genderqueer.\",\n    \"points\": null,\n    \"depth\": 3,\n    \"created_at\": \"2015-12-02T16:42:01.000Z\"\n  },\n  {\n    \"author\": \"Strilanc\",\n    \"text\": \"\\\"After the customer presses the button, they will be surprised by the machine giving them a donut.\\\"\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T20:45:46.000Z\"\n  },\n  {\n    \"author\": \"dang\",\n    \"text\": \"Pretty much every great English writer uses it freely: https://news.ycombinator.com/item?id=9364411. Also, listen to how people really speak, and you'll find that everybody puts it in their sentences without noticing.The funny thing is that in terms of actual usage, it's uncontroversial and has been for 600 years. The debate about it is a real-life version of the joke, \\\"I can see it will work in practice, but will it work in theory?\\\"\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T20:46:54.000Z\"\n  },\n  {\n    \"author\": \"panglott\",\n    \"text\": \"The author was very clear in their piece.\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T20:47:25.000Z\"\n  },\n  {\n    \"author\": \"bradleyjg\",\n    \"text\": \"There are at least three different usages of singular they. The newest is where a specific person for various possible reasons has asked to be referred to in that way. The oldest usage is where the referent is unknown or generic. E.g. \\\"The technician sent by the company isn't here yet, they may have gotten stuck in a traffic.\\\" Finally, some people use singular they even where the referent is specified and that person hasn't expressed a preference for singular they. E.g. \\\"President Obama is on vacation, they must be tired after dealing with ISIS all last week.\\\" I find this last usage jarring.\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T20:54:38.000Z\"\n  },\n  {\n    \"author\": \"ryangittins\",\n    \"text\": \"I've had enough of this discussion! The new gender-neutral singular pronoun is thou! That's right, thou was the answer we were looking for.\",\n    \"points\": null,\n    \"depth\": 0,\n    \"created_at\": \"2015-12-01T20:40:08.000Z\"\n  },\n  {\n    \"author\": \"jnevill\",\n    \"text\": \"Is \\\"thou\\\" third-person though? I never use it, so it might be. I dunno.\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T20:41:30.000Z\"\n  },\n  {\n    \"author\": \"thescriptkiddie\",\n    \"text\": \"It's second-person. The third person singular pronoun is \\\"it\\\".\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-01T20:46:09.000Z\"\n  },\n  {\n    \"author\": \"mordechai9000\",\n    \"text\": \"It's the informal version of 'you', so it is second-person singular.You can use 'thou' to force Google translate to translate from English to the informal form of another language. Otherwise, it will give you the formal translation. This is safer if you don't know the social/cultural implications of using the informal form (it can be insulting or inappropriate in some contexts), but it's not always what you want.\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-01T21:03:10.000Z\"\n  },\n  {\n    \"author\": \"bradleyjg\",\n    \"text\": \"I think thou is second person (\\\"you\\\"), not third (\\\"he\\\" and \\\"she\\\"). We are in need of a second person plural though--at least outside of the South where they have \\\"y'all\\\" and NJ where they have \\\"youse guys\\\".\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T20:42:27.000Z\"\n  },\n  {\n    \"author\": \"jnevill\",\n    \"text\": \"Let's not forget about the folk's from the \\\"Show Me\\\" state's second-person plural: \\\"Ya'llsins\\\"\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-01T20:46:16.000Z\"\n  },\n  {\n    \"author\": \"clarkmoody\",\n    \"text\": \"Don't forget \\\"all y'all\\\" when referring to more than a couple people.\\\"Y'all\\\" is plural, \\\"all y'all\\\" is more plural.\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-01T20:57:13.000Z\"\n  },\n  {\n    \"author\": \"JoshTriplett\",\n    \"text\": \"In conversations with people who also speak multiple languages, I've sometimes explained the distinction between \\\"y'all\\\" and \\\"all y'all\\\" as similar to the one between \\\"allí\\\" and \\\"allá\\\" in Spanish. Both \\\"allí\\\" and \\\"allá\\\" mean \\\"there\\\" (as opposed to \\\"aquí\\\", \\\"here\\\"), but \\\"allá\\\" is further away in a progression; informally you could translate it as \\\"way over there\\\".For instance, suppose you know a family of people. Two people out of that family are currently visiting you. You might say \\\"Y'all should bring the whole family over next time; all y'all are welcome anytime.\\\" The first \\\"y'all\\\" refers to the two people visiting; the \\\"all y'all\\\" refers to the whole family.\",\n    \"points\": null,\n    \"depth\": 3,\n    \"created_at\": \"2015-12-01T21:24:13.000Z\"\n  },\n  {\n    \"author\": \"vorg\",\n    \"text\": \"I've heard \\\"These, them, or those?\\\" used to indicate a 3-step progression.\",\n    \"points\": null,\n    \"depth\": 4,\n    \"created_at\": \"2015-12-01T22:19:34.000Z\"\n  },\n  {\n    \"author\": \"gotchange\",\n    \"text\": \"> We are in need of a second person plural thoughWhat about \\\"Vou\\\" from the French \\\"Vous\\\" ?\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-01T21:08:14.000Z\"\n  },\n  {\n    \"author\": \"Strilanc\",\n    \"text\": \"Using the post's title on hacker news is probably misleading. It sounds more official out of context, whereas in the post the \\\"award\\\" is just a tongue-in-cheek framing device:> -Truth in advertising: The Web of Language Distinguished Usage Panel, charged each year with picking the Word of the Year, consists entirely of me.The comments keep up the joke:> Kudos to the Distinguished Usage Panel! \\\"They\\\" chose wisely and well.\",\n    \"points\": null,\n    \"depth\": 0,\n    \"created_at\": \"2015-12-01T20:43:27.000Z\"\n  },\n  {\n    \"author\": \"dang\",\n    \"text\": \"I see your point, but all \\\"word of the year\\\" awards are made up anyhow. If anybody suggests a more accurate title we can change it.\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T20:51:24.000Z\"\n  },\n  {\n    \"author\": \"dkarapetyan\",\n    \"text\": \"I use this all the time. Easier than worrying about gendered nonsense.\",\n    \"points\": null,\n    \"depth\": 0,\n    \"created_at\": \"2015-12-01T20:44:38.000Z\"\n  },\n  {\n    \"author\": \"nailer\",\n    \"text\": \"+1. Reading Ben Horowitz's book, every fictional CEO is 'he' or 'she' which makes you think you've missed something and they're not fictional. 'They' could have sufficed perfectly.\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T21:32:18.000Z\"\n  },\n  {\n    \"author\": \"dimitar\",\n    \"text\": \"I've noticed that economists and other academics like to use \\\"she\\\" in the same cases as the singular \\\"they\\\" - a common-gender third-person pronoun, the \\\"he or she\\\". Yes, it intentionally uses the feminine third-person, but I guess it makes a point about inclusion this way.\",\n    \"points\": null,\n    \"depth\": 0,\n    \"created_at\": \"2015-12-01T20:45:24.000Z\"\n  },\n  {\n    \"author\": \"lsaferite\",\n    \"text\": \"It's a political statement.Usage of the male pronoun is historic just like the usage of the plural pronoun. The choice to go agains hundreds of years of usage is very political.Personally I prefer the plural when you do not know or do not wish to highlight the gender. It jibes more with my personal sense of right.\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T21:45:23.000Z\"\n  },\n  {\n    \"author\": \"ams6110\",\n    \"text\": \"I was taught that \\\"he\\\" is gender-neutral as/when needed, and in true Humpty-Dumpty fashion that's what I use.\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-01T21:50:34.000Z\"\n  },\n  {\n    \"author\": \"efes\",\n    \"text\": \"> Yes, it intentionally uses the feminine third-person, but I guess it makes a point about inclusion this way.I end up feeling suspicious of an author that uses she about ~75% of the time since it seems they remember to use it more often when referring to people in a customer/student/etc role or with an example question/mistake, yet more often use he or avoid pronouns when referring to an expert or people with titles.Meanwhile, they works perfectly fine, if it confuses someone that is their problem and if I said her problem there it would be because I was sexist for one reason and his for another. :)\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T21:53:43.000Z\"\n  },\n  {\n    \"author\": \"dcole2929\",\n    \"text\": \"Does this article really not give a single example of use of singular 'they' or did I just read too fast?\",\n    \"points\": null,\n    \"depth\": 0,\n    \"created_at\": \"2015-12-01T20:50:31.000Z\"\n  },\n  {\n    \"author\": \"jpmattia\",\n    \"text\": \"> or did I just read too fast?I must have read too fast as well. The author would have done well to include several examples, and they doesn't include any examples. Almost makes me feel like they is pranking me, to be frank.\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T20:55:55.000Z\"\n  },\n  {\n    \"author\": \"mhurron\",\n    \"text\": \"> The author would have done well to include several examples, and they doesn't include any examples.There's your example.\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-01T20:59:33.000Z\"\n  },\n  {\n    \"author\": \"dang\",\n    \"text\": \"I think jpmattia was joking. But it's fascinating how, when someone mistakenly thinks that it's a new proposed rule and tries to apply it, they frequently come up with an awkward overcorrection, when they're almost certainly already using it naturally in their own speech without noticing.If anyone wants examples there are 500 years' worth here: https://web.archive.org/web/20150328135337/http://www.crossm.... And as many again from Jane Austen alone: http://www.pemberley.com/janeinfo/austhlis.html.\",\n    \"points\": null,\n    \"depth\": 3,\n    \"created_at\": \"2015-12-01T21:02:03.000Z\"\n  },\n  {\n    \"author\": \"mhurron\",\n    \"text\": \"> I think jpmattia was joking.Honestly, with the way the comments are for this article, it's impossible to tell.\",\n    \"points\": null,\n    \"depth\": 4,\n    \"created_at\": \"2015-12-01T21:21:45.000Z\"\n  },\n  {\n    \"author\": \"jpmattia\",\n    \"text\": \"> I think jpmattia was joking.Guilty as charged, your honor.> But it's fascinating how, when someone mistakenly thinks that it's a new proposed rule and tries to apply it, they frequently come up with an awkward overcorrectionI'd note that there is a great deal of verbiage about grammar rules requiring rewrite to allow singular they . For example: A foreign speaker would be well within bounds to look at the first google hit for \\\"define are\\\" [1] : are1 är,ər/ 2nd person singular present and 1st, 2nd, 3rd person plural present of be. Google should note that \\\"are\\\" is also 3rd person singular present, consistent with 500 years of usage. But we also have to point out that singular \\\"are\\\" is disallowed in cases other than they, and we can't even add a gender-specific conjugation, since the neuter \\\"it\\\" is still not paired with \\\"are\\\".Fortunately, rules in language are not subject to mathematical rigor, and people and authors and poets (and smartasses) are given free license to use language in any way that facilitates communication.\",\n    \"points\": null,\n    \"depth\": 4,\n    \"created_at\": \"2015-12-01T22:10:47.000Z\"\n  },\n  {\n    \"author\": \"JoshTriplett\",\n    \"text\": \"> The author would have done well to include several examples, and they doesn't include any examples. Almost makes me feel like they is pranking me, to be frank.\\\"Singular they\\\" still normally pairs with plural forms of other words, not singular forms: \\\"I talked with a person today. They were interested in grammar.\\\". (Rather than \\\"They was interested\\\", which sounds completely wrong.)\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-01T21:13:25.000Z\"\n  },\n  {\n    \"author\": \"jpmattia\",\n    \"text\": \"> \\\"Singular they\\\" still normally pairs with plural forms of other wordsI'd point out those \\\"plural forms\\\" are now \\\"singular forms\\\" as well, so it looks like those terms will need refining.\",\n    \"points\": null,\n    \"depth\": 3,\n    \"created_at\": \"2015-12-01T22:13:47.000Z\"\n  },\n  {\n    \"author\": \"dragonwriter\",\n    \"text\": \"> I'd point out those \\\"plural forms\\\" are now \\\"singular forms\\\" as wellNo, they're still plural, just as they are when combined with other grammatically plural pronouns that are used with singular semantics (the royal/editorial use of \\\"we\\\" and -- even more commonly -- \\\"you\\\", the second-person plural pronoun that has in virtually all uses displaces the singular one.)\",\n    \"points\": null,\n    \"depth\": 4,\n    \"created_at\": \"2015-12-01T22:28:42.000Z\"\n  },\n  {\n    \"author\": \"jpmattia\",\n    \"text\": \"Like I said: Those terms will need refining, and all you've done is add \\\"grammatical\\\" and \\\"semantic\\\" to differentiate the cases.\",\n    \"points\": null,\n    \"depth\": 5,\n    \"created_at\": \"2015-12-01T22:38:09.000Z\"\n  },\n  {\n    \"author\": \"dragonwriter\",\n    \"text\": \"> Those terms will need refiningBut they won't. We've used \\\"plural\\\" and \\\"singular\\\" fine in referring to the grammatical features of verb tenses and the nouns/pronouns they agree with just fine for centuries, despite the fact that grammatical number of \\\"we\\\", \\\"they\\\", and especially \\\"you\\\" has often -- for longer than we've even had formalized descriptions of English grammar -- disagreed with semantic number.There's nothing new here to necessitate \\\"refining\\\" anything.\",\n    \"points\": null,\n    \"depth\": 6,\n    \"created_at\": \"2015-12-01T22:44:50.000Z\"\n  },\n  {\n    \"author\": \"logfromblammo\",\n    \"text\": \"Singular \\\"they\\\", for the purposes of grammatical agreement, is indistinguishable from plural \\\"they\\\", in much the same way that singular \\\"you\\\" acts like plural \\\"you\\\". The distinct singular 2nd person pronouns and verb forms are now archaic and obsolete.You wouldst not match the verb form associated with \\\"thou\\\" when using the singular \\\"you\\\". When anyone does, they sounds wrong to the ear of a native speaker.(The above is intentionally wrong for illustrative purposes.)\",\n    \"points\": null,\n    \"depth\": 3,\n    \"created_at\": \"2015-12-01T22:37:16.000Z\"\n  },\n  {\n    \"author\": \"josu\",\n    \"text\": \"Examples: https://illinois.edu/blog/view/25/247504\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T21:03:05.000Z\"\n  },\n  {\n    \"author\": \"dragonwriter\",\n    \"text\": \"The article (blog post) links to an earlier blog post by the same author which contains previous discussion and plenty of examples of the singular they: https://illinois.edu/blog/view/25/247504\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T21:50:34.000Z\"\n  },\n  {\n    \"author\": \"tosseraccount\",\n    \"text\": \"They be utterly pretentious. Germanic languages have gender.Language change should be natural, not forced based on some nebulous social engineering goal.Speakers of Old English considered each noun to have a grammatical gender.If anyone has a serious citation for \\\"he\\\" was imposed by \\\"meddling grammarians\\\", please let us know.Don't we already have a neutral pronoun: \\\"it\\\"?\",\n    \"points\": null,\n    \"depth\": 0,\n    \"created_at\": \"2015-12-01T20:55:26.000Z\"\n  },\n  {\n    \"author\": \"dang\",\n    \"text\": \"The point is that it has nothing to do with language change. It has been settled usage since Chaucer.It's generic 'he' that was the interloper. Ironically, the language engineers of today have most in common with the meddling grammarians who tried (never entirely successfully) to impose it.\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T21:00:16.000Z\"\n  },\n  {\n    \"author\": \"Avshalom\",\n    \"text\": \"Singular 'they' is one of the most natural changes to language I've ever been aware of. Certainly more natural than the 'he or she' malarkey people (and don't think I don't notice the precedent given to he) have been forcing on students in the name of better conforming to a nonexistent English grammar, that we only pretend exists so we can give people shit when they fail to remember when they should put it on.\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T21:04:05.000Z\"\n  },\n  {\n    \"author\": \"dang\",\n    \"text\": \"> If anyone has a serious citation for \\\"he\\\" was imposed by \\\"meddling grammarians\\\"There are lots of citations about this on the web and even a whole bunch in past HN threads. This is one of the more fascinating articles:http://www.nytimes.com/2009/07/26/magazine/26FOB-onlanguage-...\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T21:19:02.000Z\"\n  },\n  {\n    \"author\": \"tosseraccount\",\n    \"text\": \"Sorry. I removed the complaint. Thanks for the link. I'll note this ...https://en.wikipedia.org/wiki/Singular_they#Trend_to_prescri... reports that\\\"In spite of continuous attempts on the part of educationalists to proscribe singular they in favour of he, its use remained widespread, and the advice was largely ignored\\\".\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-01T21:35:14.000Z\"\n  },\n  {\n    \"author\": \"dragonwriter\",\n    \"text\": \"> \\\"In spite of continuous attempts on the part of educationalists to proscribe singular they in favour of he, its use remained widespread, and the advice was largely ignored\\\".> So, it appears that \\\"they\\\" is the imposition, \\\"he\\\" is the widespread use.I think you are confusing the word \\\"proscribe\\\" with the sounds-and-looks-very-similar-but-means-almost-exactly-the-opposite \\\"prescribe\\\".proscribe: forbid, especially by law; denounce or condemnprescribe: recommend (a substance or action) as something beneficial; state authoritatively or as a rule that (an action or procedure) should be carried out.\",\n    \"points\": null,\n    \"depth\": 3,\n    \"created_at\": \"2015-12-01T21:55:27.000Z\"\n  },\n  {\n    \"author\": \"tosseraccount\",\n    \"text\": \"dang. you're right. mea culpa.\",\n    \"points\": null,\n    \"depth\": 4,\n    \"created_at\": \"2015-12-01T22:00:36.000Z\"\n  },\n  {\n    \"author\": \"jaquers\",\n    \"text\": \"I've noticed certain papers/essays posted here using \\\"she\\\" when referring to a hypothetical person, which I think is a nice touch—since \\\"he\\\" is contained within the word.\",\n    \"points\": null,\n    \"depth\": 0,\n    \"created_at\": \"2015-12-01T20:56:26.000Z\"\n  },\n  {\n    \"author\": \"colept\",\n    \"text\": \"When writing \\\"he or she\\\" - they does seem like a viable substitute when gender is irrelevant.But I cannot stand this new trend of making gender irrelevant for the sake of pushing gender lines. We use gendered pronouns for context clues, metadata, and comedy. It's a natural construct and universal to many languages.\",\n    \"points\": null,\n    \"depth\": 0,\n    \"created_at\": \"2015-12-01T21:03:48.000Z\"\n  },\n  {\n    \"author\": \"davesque\",\n    \"text\": \"Just because people use singular they doesn't mean we can't still use gender-specific, third-person pronouns.\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T21:04:46.000Z\"\n  },\n  {\n    \"author\": \"thescribe\",\n    \"text\": \"I think the grandfather post is saying that this is motivated by people who wish to eliminate gender, not that we are precluded from he or she.\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-02T01:57:31.000Z\"\n  },\n  {\n    \"author\": \"Avshalom\",\n    \"text\": \"As ever: http://www.cs.virginia.edu/~evans/cs655/readings/purity.html\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T21:05:02.000Z\"\n  },\n  {\n    \"author\": \"warfangle\",\n    \"text\": \"'They' isn't a viable substitute just when gender is irrelevant.There isn't really a label for what I identify as, but it is not 'she' or 'he,' it's somewhere in-between and neither at the same time. So even 'he or she' wouldn't apply to me: I'm not one or the other.I _prefer_ xe/etc; but I'm absolutely 100% fine with they/them. Just don't call me he (because I'm not) or she (because I'm not). ;)Does that make sense?> It's a natural construct and universal to many languages.I think this ignores too much how language imposes itself on a culture - and a culture on a language. The gender neutral pronoun is a natural construct and universal to many languages, too. We just don't have an \\\"official\\\" one in English.\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T21:31:16.000Z\"\n  },\n  {\n    \"author\": \"mkrfox\",\n    \"text\": \"I saw a comic strip once where someone was talking to a nonbinary person. Somewhere in it, the (presumably) cisgendered person said \\\"but then I won't know your gender!\\\"And the nonbinary person replied \\\"that's okay, because I don't know it either.\\\"(I probably mis-remembered parts, and I'm not telling it anywhere near as well)\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-02T18:15:19.000Z\"\n  },\n  {\n    \"author\": \"erikpukinskis\",\n    \"text\": \"I do this. I'm sorry I'm offending you. That's not my intention.I use it not for some political purpose, but because I actually believe gender is irrelevant to the things I'm saying. I am almost never trying to say \\\"I went with Dave in his essential maleness to his house\\\" I'm just trying to say I went to Dave's house. I'm not trying to reference occupation or nationality or anything else. Referencing gender is noise.It's also impractical to have to ask everyone their gender and keep that huge database in my head. Much easier just to use one word.\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-02T02:38:01.000Z\"\n  },\n  {\n    \"author\": \"ChuckMcM\",\n    \"text\": \"A pretty fun read, I also like the disclaimer :-). I was always much more comfortable with the singular they and the plural yall.\",\n    \"points\": null,\n    \"depth\": 0,\n    \"created_at\": \"2015-12-01T21:11:54.000Z\"\n  },\n  {\n    \"author\": \"davesque\",\n    \"text\": \"I've always used this intentionally in spite of being fully aware that it's \\\"ungrammatical.\\\" Saying that singular they is ungrammatical is rather like saying that irregular verbs are ungrammatical or uncountable nouns are ungrammatical. It doesn't matter because there are already a significant number of irregularities in English and having one more isn't going to cause any problems and, relatively speaking, isn't going to make English any less systematic.\",\n    \"points\": null,\n    \"depth\": 0,\n    \"created_at\": \"2015-12-01T21:16:04.000Z\"\n  },\n  {\n    \"author\": \"amsilprotag\",\n    \"text\": \"I find myself doing the same, despite increasing preference for \\\"she\\\" by academicians and journalists.See the top post in another HN thread for my criticism, copied below. When \\\"she\\\" becomes the default, I find myself veering off from the topic at hand to consider gender politics and try to infer the author's intention. Does OP see makers as \\\"us\\\" and managers as \\\"them\\\"? Is OP using \\\"she\\\" because /they/ believe managers are disproportionately male and so chooses a pronoun to prevent further exclusion? An ideal grammar solution should not require the author to disclose his politics, either by omission or commission, just to communicate effectively.https://news.ycombinator.com/item?id=10658187\\\"Manager time\\\" is a small allocation. Since the manager's heap only uses blocks this size, she can do this all day without any problems or fragmentation.\\\"Maker time\\\" is a large contiguous block. If the heap is empty, you can allocate them without any problem. But stick one manager-sized block in the middle and now you've split your heap such that the total time available is large enough, but it's not contiguous. Classic heap fragmentation[2].\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T21:40:58.000Z\"\n  },\n  {\n    \"author\": \"0xdeadbeefbabe\",\n    \"text\": \"Tell CMOS then. You are in the same state after all.They said (tee hee hee) this: A. I’m afraid your gender-neutral pronoun (at least in the sense you need) does not exist in our lexicon. I agree that the plural pronoun with a singular noun seems inadequate; I would suggest that you recast the sentence altogether or at least make “mind” plural for agreement: their minds. Other writers alternate between using “his” and “her” in such constructions in order to give equal status to each pronoun. http://www.chicagomanualofstyle.org/qanda/data/faq/topics/Pr...\",\n    \"points\": null,\n    \"depth\": 0,\n    \"created_at\": \"2015-12-01T21:16:08.000Z\"\n  },\n  {\n    \"author\": \"untothebreach\",\n    \"text\": \"Elsewhere on that page they seem to give, if not approval of the construct, than at least acknowledgment that it is solving the problem:> The use of they as a singular pronoun is a hot topic in online grammar forums. By traditional standards, the sentence is incorrect because it contains no plural noun for they to refer to. Traditionally, the correct versions are “The telltale sign of right-wingers: they can’t write in English to save their lives” and “The telltale sign of a right-winger: he can’t write in English to save his life.”> The growing acceptance of they as singular is in response to a need for a gender-neutral pronoun that avoids the use of he to mean he or she. Good writers would make right-winger plural to avoid the appearance of incorrectness or gender bias, but in other sentences the plural is not a good option: “Someone ate my Twinkie, and they’d better watch out!” In those contexts, many language experts now approve of the use of they. You can learn more by searching online for “singular they.”\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T21:24:43.000Z\"\n  },\n  {\n    \"author\": \"dragonwriter\",\n    \"text\": \"> Tell CMOS then.The article specifically discusses the history of the CMOS with singular \\\"they\\\", which recommended singular they in the 14th Edition, and reversed for the following versions (15th and the current 16th.)\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T22:01:21.000Z\"\n  },\n  {\n    \"author\": \"spdionis\",\n    \"text\": \"When I was taught italian grammar I was told explicitly that if the gender of the subject is unknown the masculine one should be used by default as a rule. Sounds totally alright to me.Now I'm wondering how many people would be offended by this.\",\n    \"points\": null,\n    \"depth\": 0,\n    \"created_at\": \"2015-12-01T21:17:19.000Z\"\n  },\n  {\n    \"author\": \"sampo\",\n    \"text\": \"My native language doesn't have gendered pronouns, and it is surprisingly difficult to learn to fluently and effortlessly use 'he' (or 'she') in English in situations when there is no need to specify the gender, or when the gender is not known (\\\"After the user clicks the button, he/she receives ...\\\"). My brain is just not wired that way, I feel like I am forced to create information when there is none, and potentially incorrect information, lies.Almost as if a language didn't have a construct to talk about cars without specifying their color at the same time, so you all the time have to create random colors in order to talk about cars in the abstract.I was very happy when I learned that 'they' is a mostly acceptable solution.I understand gendered nouns can also be a politically loaded topic, but I only meant this as a perspective from someone who learned English as a second language.\",\n    \"points\": null,\n    \"depth\": 0,\n    \"created_at\": \"2015-12-01T21:33:47.000Z\"\n  },\n  {\n    \"author\": \"kibwen\",\n    \"text\": \"I don't think anyone would dispute that gendered pronouns make learning a language harder. Here in the US most kids will learn a rudimentary amount of a foreign language in school, at which point they realize just how lucky they are that most nouns in their native language use gender-neutral pronouns (I distinctly remember wondering just what made tables female when we were required to say la mesa). There's even a famous Mark Twain essay where he laments at length the chaos of German's genders: https://www.cs.utah.edu/~gback/awfgrmlg.html\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T21:51:05.000Z\"\n  },\n  {\n    \"author\": \"gyardley\",\n    \"text\": \"This is pretty close to how I, as a native English speaker, feel about gendered inanimate objects. I have no idea why so many other languages force you to stick a gender on something without any genitals.I would've preferred not to have to learn that something as simple as 'milk' is feminine in Spanish, masculine in Italian, and neuter in Russian - that hunk of my brain could surely be put to better use.\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T21:55:04.000Z\"\n  },\n  {\n    \"author\": \"mitchty\",\n    \"text\": \"The first thing you need to do is realize that grammatical gender has nothing to do with actual gender or lack thereof.Unless you really think a turnip is feminine, and a little girl has no gender like in German.All they're doing is describing a category of like nouns. The term for the grouping happens to be the word gender. The word is overloaded in this case to mean multiple things and is at best a false cognate.The fact that the same thing can have multiple genders or lack thereof as you noted should be the biggest clue that grammatical gender has nothing to do with genitals.\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-01T22:03:49.000Z\"\n  },\n  {\n    \"author\": \"dragonwriter\",\n    \"text\": \"> The first thing you need to do is realize that grammatical gender has nothing to do with actual gender or lack thereof.And, more fully, realize that none of these four things are different axis of variation: grammatical gender, biological sex, socially-ascribed gender, personal gender identity.Most importantly, the first two things are different kinds of things from each other and the last two things (the last two are closely related, and there is very good reason to try to align them; alignment between grammatical gender and gender identity can be important instrumentally to that goal, however, especially in contexts where there is an established expectation of alignment between socially-ascribed gender and grammatical gender, since then a divergence between gender identity and grammatical gender used communicates and reinforces the divergence between ascribed gender and gender identity.)\",\n    \"points\": null,\n    \"depth\": 3,\n    \"created_at\": \"2015-12-01T22:12:04.000Z\"\n  },\n  {\n    \"author\": \"mitchty\",\n    \"text\": \"What you're saying is true as well and goes much further in the use of gender itself.But it has a bit of a snag for some languages if you were to try to \\\"fix/correct/whatever\\\" the genders of certain nouns to fit a social context. Take German with das Mädchen (das being neuter gender), the plural of this is die Mädchen, aka all plurals in German are feminine gender. Changing the gender of this noun in its singular state is... problematic at best and grammatically would amount to almost a new language. You would also have to tackle do you make all plurals not feminine gender?Additionally you'd have to handle/tackle use of er/es/sie/Sie/usw... I think I can speak for the Germans here and say changing the language to suit these social constructs would be ludicrous. I know other languages and their grammar would also have issues with revisions along these lines akin to not being the same language.Aligning gender like people are want to do in English lately is problematic and possibly misguided grammatically.\",\n    \"points\": null,\n    \"depth\": 4,\n    \"created_at\": \"2015-12-01T23:04:49.000Z\"\n  },\n  {\n    \"author\": \"dragonwriter\",\n    \"text\": \"> But it has a bit of a snag for some languages if you were to try to \\\"fix/correct/whatever\\\" the genders of certain nouns to fit a social context. Take German with das Mädchen (das being neuter gender), the plural of this is die Mädchen, aka all plurals in German are feminine gender.This is a complicated area and I'm not sure that the issues in German occur in the same places as in English: in English, for people, the exclusive dual grammatical gender has been paired with and directly mapped to (but for the use of the masculine grammatical gender to include generic ascribed gender) the exclusively dual socially ascribed gender, to which personal gender identity has been generally expected to conform. With languages with a more complex gender structure and where the mapping between grammatical gender and socially ascribed gender of persons is more complex, the particular problem areas (if any) where grammatical gender is problematic in terms of interfering with the desire to encourage socially ascribed gender to align with gender identity and, also, to avoid communicating gender(-identity/ascription) biased norms, may be different than in English.It may be different, for that matter, even within a single language, based on the history and expectations around the use words and their associations in different places and cultures using the same language.\",\n    \"points\": null,\n    \"depth\": 5,\n    \"created_at\": \"2015-12-01T23:16:46.000Z\"\n  },\n  {\n    \"author\": \"SilasX\",\n    \"text\": \"It doesn't matter whether it's related to biological gender[1]; the fact remains that these languages force you to remember extra information that serves no semantic purpose, which causes the same problem as English does/did when forcing you to pick a gender for the pronoun of a generic person.Whether you call it \\\"grammatical gender\\\" or \\\"gender\\\" or \\\"noun class\\\" is irrelevant; it all burns down the same cigarette butt.[1] Although it pretty clearly is, since languages consistently lump in the female version of a human noun (cartera) with the grammatical gender of woman, and male (cartero) with man; the little-girl exception you mention from German is because that diminutive suffix (-chen in Mädchen) takes the neuter case with higher priority. The (fact that this is such a predictable, rare) exception proves the (general validity of the) rule.\",\n    \"points\": null,\n    \"depth\": 3,\n    \"created_at\": \"2015-12-02T01:16:04.000Z\"\n  },\n  {\n    \"author\": \"dragonwriter\",\n    \"text\": \"> Although it pretty clearly is, since languages consistently lump in the female version of a human noun (cartera) with the grammatical gender of womanLanguages with grammatical gender don't even consistently have \\\"masculine\\\" and \\\"feminine\\\" categories (though certainly that's the most common distinction, with or without a \\\"neuter\\\" category, in a grammatical gender system.) E.g., several have the grammatical genders of \\\"animate\\\" and \\\"inanimate\\\" (or something similar), but not \\\"masculine\\\" and \\\"feminine\\\".\",\n    \"points\": null,\n    \"depth\": 4,\n    \"created_at\": \"2015-12-02T01:25:34.000Z\"\n  },\n  {\n    \"author\": \"SilasX\",\n    \"text\": \"I know -- I perhaps should have clarified that I meant \\\"languages with [something commonly referred to as grammatical] gender for nouns\\\", although I feel it was clear from context, since the footnote was referred to after \\\"these languages\\\" (not languages in general).\",\n    \"points\": null,\n    \"depth\": 5,\n    \"created_at\": \"2015-12-02T01:35:22.000Z\"\n  },\n  {\n    \"author\": \"sampo\",\n    \"text\": \"> I have no idea why so many other languages force you to stick a gender on something without any genitals.Btw, Swedish has a nice version of this, the masculine and feminine genders have merged together into the common gender, and then the other is the neutral gender. For example: en katt (a cat, common) ett hus (a house, neutral) You are still burdened by having to memorize the gender for each noun, but at least you are spared from having to think the words as masculine or feminine.https://en.wikipedia.org/wiki/Swedish_grammar#Nouns\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-01T22:29:46.000Z\"\n  },\n  {\n    \"author\": \"warfangle\",\n    \"text\": \"What'll really blow your mind is that gender only tangentially has to do with genitals in the first place ;)\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-01T22:45:07.000Z\"\n  },\n  {\n    \"author\": \"ctdonath\",\n    \"text\": \"The perspective from someone who learned English as a first language is that it's just as annoying a linguistic issue as it is to those who learned English later. Those of us raised on English likewise have a bad time with ambiguous gender situations (\\\"he/she\\\"). Used to be just \\\"he\\\" when ambiguous/irrelevant, but sociopolitical outrage over possible misapplication of the pronoun discourages such use, so our choice is either the obnoxious \\\"he/she\\\" (raising the issue of alternate applicability in a context where it really doesn't matter) or the now-common but still irritating singular \\\"they\\\" (ignoring the plural definition, and implying attempted reconciliation for the originating sociopolitical angst).\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T21:56:29.000Z\"\n  },\n  {\n    \"author\": \"cmdkeen\",\n    \"text\": \"\\\"now common\\\" - the singular they was used by Chaucer, Shakespeare, Austen, Thackery and Shaw. Traditional grammar types might not like it but that doesn't mean it is some new usage.\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-01T22:05:57.000Z\"\n  },\n  {\n    \"author\": \"ctdonath\",\n    \"text\": \"I didn't insinuate it was \\\"new usage\\\". I've seen it go from rarely & uncomfortably used to, as I said, \\\"now common\\\".\",\n    \"points\": null,\n    \"depth\": 3,\n    \"created_at\": \"2015-12-02T14:43:01.000Z\"\n  },\n  {\n    \"author\": \"SilasX\",\n    \"text\": \"Agree about it being annoying for native English speakers as well, but I don't think you have to be PC to balk at the use of \\\"he\\\" for the ambiguous case. Brains work by association, and forcing \\\"he\\\" to do double-duty is simply confusing.For example, let's say you tell a story and refer to a generic surgeon as \\\"he\\\", when some patient's father is known to be far away. Later, you have the surgeon saying \\\"I can't operate on this patient; he's my son!\\\" People will feel deceived if it turns out the surgeon was a woman after you used \\\"he\\\" to refer to her, and no amount of lecturing about how \\\"'he' is a perfectly fine for ambiguous cases\\\" is going to change this.Btw, Douglas Hofstadter (somewhere in Metamagical Themas) made a great point that the use of \\\"they\\\" vs \\\"he\\\" for the generic singular being an issue of whether people are more offended at being called a man when a woman or multiple when singular. There are fewer interest groups looking out for the latter...\",\n    \"points\": null,\n    \"depth\": 2,\n    \"created_at\": \"2015-12-02T01:32:45.000Z\"\n  },\n  {\n    \"author\": \"SamReidHughes\",\n    \"text\": \"> I don't think you have to be PC to balk at the use of \\\"he\\\" for the ambiguous case.You're right. When I was a kid, I'd go with \\\"they\\\" for both ambiguous and the generic case, simply because it's illogical to have an arbitrary assumption, which is maybe a post-hoc justification that I made as a teenager. Eventually I ended up trying to train myself to use \\\"he\\\" in the generic case, because it seemed to me like my habit was just super-semantic nerdiness. But for the ambiguous case, if it's talking about a specific person, but whose sex you don't know, it'd still be very weird to not use \\\"they\\\".\",\n    \"points\": null,\n    \"depth\": 3,\n    \"created_at\": \"2015-12-02T04:29:03.000Z\"\n  },\n  {\n    \"author\": \"ctdonath\",\n    \"text\": \"\\\"There are fewer interest groups looking out for the latter...\\\"As an introvert, I find the implicit plurality of \\\"they\\\" more disturbing than gender ambiguity of the known-singular \\\"he/she\\\". I'm not a group, I'm a singular self, and the speaker/author shouldn't apply a plural to a known singular; being an anonymous audience/subject, gender ambiguity is more understandable.\",\n    \"points\": null,\n    \"depth\": 3,\n    \"created_at\": \"2015-12-02T16:43:42.000Z\"\n  },\n  {\n    \"author\": \"peteratt\",\n    \"text\": \"One of the advantages of Spanish over English is that the problem that singular 'they' is trying to solve doesn't even exist. Gotta love that always-on gender alignment feature :)\",\n    \"points\": null,\n    \"depth\": 0,\n    \"created_at\": \"2015-12-01T21:39:06.000Z\"\n  },\n  {\n    \"author\": \"yarrel\",\n    \"text\": \"I've used this since the 90s, so -oh God, I'm a pronoun hipster. ;-(\",\n    \"points\": null,\n    \"depth\": 0,\n    \"created_at\": \"2015-12-01T21:53:34.000Z\"\n  },\n  {\n    \"author\": \"Renevith\",\n    \"text\": \"Language Log has posted for many years about singular they, often spotting examples of it in well-edited publications.http://languagelog.ldc.upenn.edu/nll/?cat=27See also the wikipedia page on singular they, chock full of usage examples:https://en.wikipedia.org/wiki/Singular_they\",\n    \"points\": null,\n    \"depth\": 0,\n    \"created_at\": \"2015-12-01T22:04:57.000Z\"\n  },\n  {\n    \"author\": \"kbutler\",\n    \"text\": \"English already has a perfectly good singular, gender-netural pronoun: \\\"it\\\". We're just not used to using \\\"it\\\" for non-child people: When the baby is hungry, it eats. When the person is hungry, it eats. If you adopt \\\"they\\\", you have to either adopt plural verbs, or allow \\\"they\\\" to be associated with singular verbs: When the person is hungry, they eat. When the person is hungry, they eats.\",\n    \"points\": null,\n    \"depth\": 0,\n    \"created_at\": \"2015-12-01T22:29:02.000Z\"\n  },\n  {\n    \"author\": \"dragonwriter\",\n    \"text\": \"> If you adopt 'they', you have to either adopt plural verbsWhich we already do with semantically singular uses of the first-person and second-person grammatically-plural pronouns in English, so that's not really a big deal. (And already do with semantically singular uses of \\\"they\\\": its been \\\"adopted\\\" in English-as-actually used for over half a millennium.)\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T22:32:19.000Z\"\n  },\n  {\n    \"author\": \"warfangle\",\n    \"text\": \"\\\"it\\\" comes with the linguistic/cultural baggage of being associated primarily with inanimate objects, which I think you can understand is rather disconcerting to those who are genderqueer and very much alive.\",\n    \"points\": null,\n    \"depth\": 1,\n    \"created_at\": \"2015-12-01T22:47:24.000Z\"\n  }\n]"
}