{
  "meta.json": "{\n  \"rank\": 16,\n  \"title\": \"Launching a Mac App and Becoming the Top Paid App Globally\",\n  \"url\": \"https://medium.com/developers-writing/how-to-launch-a-mac-app-and-become-1-top-paid-app-globally-4434bbfb51ee\",\n  \"hn_url\": \"https://news.ycombinator.com/item?id=10650020\",\n  \"points\": 192,\n  \"author\": \"jerols\",\n  \"comment_count\": 55\n}",
  "article.txt": "How To Launch a Mac App and Become #1 Top Paid App GloballyDenys Zhadanov15 min read·Nov 24, 2015--13ListenShareThis article was originally published on my personal blog.It’s pretty hard to put eight months of your life in a single blog post, but I’ll try to outline the most interesting and crucial facts behind how Readdle created our first Mac app and how it became a #1 top paid on Mac App Store globally.Press enter or click to view image in full sizePDF Expert for Mac instantly became #1 Top Paid app globally.Readdle makes great productivity apps for iPhones and iPads. We managed to build a sustainable business with 8 apps (Scanner Pro, Spark, Documents, etc) that are used by 45 million people, got numerous reviews and awards, and even pre-installed on demo devices in Apple Retail stores.It’s been almost 8 years and now we finally released our first Mac app — PDF Expert. PDF Expert is a fast, robust and beautiful PDF editor.After All These Years on iOS, Why Go Mac?Good question. About a year ago, we started the conversation of ‘what’s next?’ What new challenges can we tackle, and what have been our top customer requests?Readdle’s first Mac app.That discussion brought us to the Mac. Here’s why:PDF Expert grew to the point where we wanted to provide a consistent user experience across iPhone, iPad, and Mac.Readdle is now in a position where we have enough resources and a good base to launch a Mac app.Building a sustainable, profitable business around just one platform is getting increasingly harder.Is It Harder To Develop a Mac App?Yes.According to our developers, it’s about three times harder, largely because it requires:More input sourcesMore devices and OS versions to supportMac Core Framework is much older its iOS counterpartDeveloping two versions of the same app — one for Mac App Store, and one for distribution through our websiteConsistent user experience across platforms.Although it’s harder to make a desktop app, we wanted to keep Readdle’s core principles: we want our apps to be lightweight and easy to use from the first glance, yet powerful enough to solve most use case scenario for users.Using our core principles for design and user experience helped us to build a product that stands out. But it wasn’t easy.CompetitionMany people told me that it doesn’t make sense to build a product that already has some decent alternatives. But honestly, I like competition. Healthy competition indicates that there is a good addressable market out there. Having a superior product that does things better and is differentiated enough can lead to a successful and sustainable business.Thanks to our research and preparation, we were able to position PDF Expert for Mac really well. It steps in where Apple Preview is too basic and Adobe Acrobat is too cumbersome. With PDF Expert, people can actually do their PDF work much faster and easier, including reading, annotating, form filling, and signing documents.Press enter or click to view image in full sizeBut we didn’t just build for 1.0. We are already working towards the next destinations on our roadmap for PDF Expert, which includes more PDF editing tools, OCR, conversion to other formats, and much more. Once again, having a superior product is the key to a successful launch and marketing.Distribution: Mac App Store vs Web SiteWhen the app was 90 percent ready, we had to decide which distribution channel to choose: Mac App Store or our site.If you’d like to see our research and thought process, here’s a quick comparison table for Mac App Store vs site distribution.Mac App Store vs Site Distribution.After we weighted all of this, we decided to use both distribution channels, even with the higher overhead. So now we have to continuously support two separate versions of PDF Expert for Mac.Ultimately, it proved to be a great decision. I’ll tell you why in a bit.The Business ModelIt was crucial to pick the right business model for PDF Expert. Since we are a privately owned company and never raised any capital, we have to make profit in order to develop great software — an expensive endeavor these days.Consider these realities of the current software space: people don’t like subscriptions unless you give them a very good reason to subscribe, and productivity software rarely succeeds with freemium business models. At least for now, the choice was clear.We decided to go with a paid upfront business model because it’s already working for us on iOS, and Mac seems to be a good fit for it as well. PDF Expert is available at an introductory price of $19.99, but that will rise in the near future to $60–70 once we add PDF editing and OCR.The Hard Choice of a TrialIt’s hard to convince a person to spend $5 on software, how do we do that for $70?Trial!All the major players on Mac provide trials. But how do you pick the best trial terms that both convert people into paying users and demonstrate the ultimate value of the product?I can make an entirely separate blog post about trials, but to keep it short for now: we decided on a time limited trial with full functionality. However, watermarks will be added soon.Giving full functionality with a limited time window won’t convert users who are coming to do one-time task (say, fill out a tax form). Since they have completed that task there is no reason to pay for the product. And we know, that it’s better to ask for money when the need is high and the maximal perception of value is at its peak.Since this is the very first version, I wanted to get the full version into customers hands for a full seven days. We may have gained millions of customers on iOS over the years, but remember that this is the big version 1.0 debut of our first Mac app. We need to test the waters and give customers the best opportunity for feedback.Surprisingly enough, the conversion from trial to paid is about 20%, though it’s worth pointing out these are highly motivated users who know Readdle and probably use PDF Expert on their iOS devices.Launch PreparationSo I had PDF Expert for Mac ready, and now it’s time to prepare for a big launch. But where do I start, and how do I launch on a completely new platform?ResearchIt was crucial to see what other people are doing in this market. So I spent a decent amount of time learning and analyzing how people do business. A quick analysis of CleanMyMac, Waltr, 1Password, Fantastical, and other major players set the right narrative towards the next actions.Backend and LicensingNow, the App Store is a great distributional tool, but it’s also a great platform that empowers developers to focus only on making great products. I came to realise how powerful this is once I had to design and code the backend for our app to be distributed outside the App Store.There were a few new challenges that Readdle has never had to deal with:Distribution — hosting and bandwidth for an app that we have high hopes to reach hundreds of thousands, if not millions, of customersAn update mechanism for easy delivering new versions to all existing customersA licensing and activation frameworkPayment processingSecurityDealing with all this can be its own blog post as well. But for another short summary for now, we ended up using a combination of tools: DevMate for activation workflow and security, FastSpring for payments, and our own system for distribution and updates.Once I had the backend ready, I could design the process for how to put this all together.9 Marketing StepsOf course, if an app is released but no one is told about it, was it ever really released? This is when we started preparing the marketing.Press enter or click to view image in full sizeSchemes always help.Some of my friends call me “the launch guy”, and I believe they do it for a reason.Let me share my secrets with you.1. Figure Out PositioningIt’s vital for every business to position itself right and to establish a strong brand. Fortunately, with PDF Expert for Mac, we had a clear product vision from the start, so this task was fairly easy this time around — it’s a fast, robust, and beautiful PDF reader for Mac. It fits where Preview is too basic and Adobe Acrobat is too complicated and expensive.Defining your core audience might be hard sometimes, but another advantage we had in this case is the hundreds of thousands of customers who already use PDF Expert for iOS. These are people who want a better user experience and advanced functionality.2. Craft a Great PitchOnce you solidify the position of your product, it’s much easier to create a compelling pitch that should resonate with its intended audience and media. This topic is outside the scope of my post, but there are many articles on how to make a great pitch. I personally recommend “Pitch Perfect” by my friend Steve Sande and Erica Sadun.3. You Need a VideoPeople are lazy. Or at least, a lot of them are.Watching 51 seconds and understanding the concept is much easier than reading a webpage or article, no matter how great they are. That’s why I strongly recommend shooting a professional video for your product launch. It should be simple, short, stylish, and engaging. Don’t forget about call to action at the end.PDF Expert for Mac video got 32K views in just 6 days.Every product at Readdle has a video. Some of them have over 220K views on Vimeo.P.S. Let me know if you need a video for your product or app, I’ll get you in touch with professional guys who did this video for me in just 6 days!4. Effective SiteJust like focus is absolutely necessary when positioning your product, you need it when building your site’s messaging about it.Press enter or click to view image in full sizeThe Site provides clear positioning and call to action.An effective product site needs these core principles:SimpleStylishInformativeEffective — it has to convert visitors into trial usersThis is what we kept in mind when building http://pdfexpert.com, and I think we did a pretty good job.5. EmailsAs I’ve mentioned before, email is an effective, but often overlooked, tool for communicating with your customers. While we are fortunate to have built a pretty good subscriber base over these past eight years, we had to start at zero like everyone else.I absolutely recommend adding an email signup form on your site or apps for existing and soon-to-be customers, and make it clear what and how often you intend to share. The point is that there are people who want to hear from you and about your products. Newsletters about what’s new and tips for getting more out of your product can do wonders for your company.Press enter or click to view image in full sizeExample of an invitation letter. No, we did not use that Toy Story image ;)There are too many articles on the topic of what and how to write to your audience, so I won’t rehash them here. However, there is one tip I don’t see mentioned often enough: don’t forget to localize all your marketing materials! It’s vital if you are aiming for a bigger reach.Not only did we do promotional emails when PDF Expert when live, we also send:Informational email — On the 3rd day of a trial, we share some cool tips to keep prospective customers interested and show the value of PDF Expert.Trial Expiration email — This mentions the 7 days trial is about to expire and suggests getting a full version to continue using advanced features.Post-expiration email — This targets all those who didn’t get the full version and offers a one-time, 20% discount code for a lifetime license.iOS emails come when a person asks to try PDF Expert for Mac either on his/hers iOS devices or while browsing pdfexpert.com from an iOS deviceI am very careful with email marketing since it’s the most sensitive medium of communication, so it’s important to build trust and be relevant.6. In-app CorrespondenceBeing a multi-product company sometimes helps! Since we have millions of users across our various apps, it made sense to cross-promote PDF Expert for Mac within our other apps by showing a friendly, informative message about it.What’s interesting is that those banners were shown on iOS devices, so people were going to our web site. Since PDF Expert for Mac is a desktop app we had to come up with a smart way for the next action.That is why, when you visit pdfexpert.com from your mobile device and click on “Get a Free Trial”, a pop-up asks you to leave your email. Once you do that, you will get an email with more info, video and a download link that you can use when you are back to your desktop.Don’t forget to A/B test!A/B testing — the practice of trying variations of content to see which performs best — can double your results. I highly recommend it, and as an example, I came up with two different versions for our email. Guess which one performed better.Press enter or click to view image in full sizeA/B Testing gave us 20K more clicks.The dark one was 80% better, which generated 20,000 more clicks. Not bad, hey?7. Apple EditorialApple is being very helpful these days, and they want developers to succeed. That is why you really should keep in touch with App Store Business Management and keep them updated on what you’re building and when you’re getting ready for a launch.I wrote an article on how to get featured by Apple, and those points are still relevant today. If you do it right , working with Apple can do wonders for your product. Of course, you can’t avoid the most important detail of all: make a great product that people will love.Press enter or click to view image in full sizePDF Expert is Editor’s Choice on the App StoreThis time, we were chosen as Editor’s Choice on Mac App Store. As you’ve heard plenty of times elsewhere, this gave PDF Expert a lot of traffic and downloads.8. iOS Free App of The WeekPDF Expert for iOS regularly costs $9.99 on the App Store, and it is the most robust editor on the platform. Apple has long wanted to feature it on Free App of the Week, so I thought this Mac launch would be a good time to do it. There are two reasons for that:* We would gain millions of new users.* We can sell the Mac version to those users.Apple wound up picking PDF Expert as Free App of The Week at the very same time when the Mac version went live. This is what I mean by communicating with your Apple App Store staff.Press enter or click to view image in full sizePDF Expert for iOS is Free App of The Week = 3,800,000 downloads in 7 days.We got 3,800,000 new users of PDF Expert on iOS in just a week, which means we got 3,800,000 chances to recommend PDF Expert for Mac to new customers.I will make a separate blog post to delve further into when and how Free App of The Week can make sense for developers, even though we lost money for that week.9. Talk to The PressThe best way to get covered by media is to make a product that they like and use themselves.",
  "comments.json": "[\n  {\n    \"id\": 10663863,\n    \"author\": null,\n    \"text\": \"It's interesting that their views on competition run counter to what YC / Peter Thiel advocate for in all startups - that is, avoiding competitive spaces and going for monopolies. Perhaps monopolies are necessary for huge growth and investor upside, but it should be made clear that there's obviously space in startups for modest goals like a nice PDF reader, and I hope their employees makes a reasonable living off it at the very least.Not sure if their business model will work out (given the sad state of affairs that is the Mac App Store) but I liked that they were transparent about it.On another note... the Vimeo ad they released https://vimeo.com/145400917 features a white, well-dressed man working at an empty desk with nothing on it but a macbook, coffee mug, iPhone, and Moleskine notebook. I find this marketing trope hilarious and want to amass a collection of such images. Is someone already curating such a thing?\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T16:24:46.000Z\",\n    \"depth\": 1\n  },\n  {\n    \"id\": 10663954,\n    \"author\": null,\n    \"text\": \"My office setup is almost exactly what you describe. Switch out the macbook for an imac and then add a height adjustable desk, some headphones, and a hydroflask.The article though was pretty effective in making me want to try the app since I make a handful of pdfs and exporting from photoshop is a pain since I always forget the settings I want to use to make the file not gigantic.But to your point, I kind of like the idea that people can make a business like this and eke out a nice income and have happy customers. It reminds me of a tooth whitening supply company I temped for a while back. They had 4 employees and were 100% happy with the number of customers they had and would get more via tradeshows, dentists liked their product, and the profits were really good. I imagine the owners knew that at a certain size managing the business would not allow them to live the lifestyle they enjoyed, so they just maintained it as is.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T16:39:00.000Z\",\n    \"depth\": 2\n  },\n  {\n    \"id\": 10665872,\n    \"author\": null,\n    \"text\": \"Well, PDF Expert can potentially bring $10M a year if we do it right. We just feel that the PDF experience with Adobe isn't great... And for people who work with PDFs that does matter.Speaking about lifestyle business: we definitely decided not to do it. It's been 7 years, we grew to 85 people and 45 million users... that is why we are aiming for something that is much bigger and has much more impact! Have a look at Spark!\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T21:16:03.000Z\",\n    \"depth\": 3\n  },\n  {\n    \"id\": 10667349,\n    \"author\": null,\n    \"text\": \"Here's to hoping you bring Spark to the Mac ;)On PDF Expert, one feature I'd love to see would be an option to add links to sections of images in a PDF. That's the only thing I use Acrobat for, and it'd be incredible to be able to quit using it forever.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-03T02:29:55.000Z\",\n    \"depth\": 4\n  },\n  {\n    \"id\": 10666881,\n    \"author\": null,\n    \"text\": \"> I imagine the owners knew that at a certain size managing the business would not allow them to live the lifestyle they enjoyed, so they just maintained it as is.This is what a 'small business' is. Not every entrepreneur is out to take over the world.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-03T00:15:17.000Z\",\n    \"depth\": 3\n  },\n  {\n    \"id\": 10663980,\n    \"author\": null,\n    \"text\": \"Make as many as you like: https://placeit.net/\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T16:42:38.000Z\",\n    \"depth\": 2\n  },\n  {\n    \"id\": 10665269,\n    \"author\": null,\n    \"text\": \"Something I've been thinking about recently: does anyone think Slack followed Thiel's advice? It entered a space that already existed (didn't go from 0 to 1), with several competitors, solving a problem that was widely known (email is a broken way to get work done). Yet it's becoming a monopoly and will likely be a very valuable business. It seems like there can be tremendous value in making something really good when the existing solutions are not good, and that creating an extremely valuable business doesn't require doing something entirely new.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T19:37:35.000Z\",\n    \"depth\": 2\n  },\n  {\n    \"id\": 10665657,\n    \"author\": null,\n    \"text\": \"Thiel doesn't advocate for an immediate monopoly because the alternative _can't_ work, it's because it's _harder_ to get a startup off the ground in an already-competitive market\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T20:43:37.000Z\",\n    \"depth\": 3\n  },\n  {\n    \"id\": 10665718,\n    \"author\": null,\n    \"text\": \"There's a lot of business advice that makes sense if you are a VC fund seeking to beat the market and that must \\\"only invest in things able to return the entire fund\\\" but that does not make sense if you just want to build a reasonable business. Hell, some of that advice doesn't even make sense if your goal is to build a very successful startup with a good but not quite \\\"sure I'll take another airstrip on my island\\\" exit.Sometimes the domain specificity of advice is not immediately obvious from its context.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T20:52:22.000Z\",\n    \"depth\": 2\n  },\n  {\n    \"id\": 10665893,\n    \"author\": null,\n    \"text\": \"Thiel also forced entrepreneurs to ask what they think is true that others don't. With PDF apps, the answer was that there is a gap in between where they can provide a better experience. As you noted, it may not be enough to take on Adobe but it fulfills a niche from which the vision could become broader. See Dropbox who wanted to replace thumb drives and rewritable CD-Rs to popularizing the cloud storage consumer option with all its additional possibilites.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T21:18:31.000Z\",\n    \"depth\": 2\n  },\n  {\n    \"id\": 10667620,\n    \"author\": null,\n    \"text\": \"The best one I've seen yet is the twitter background for Salesforce's Desk.comhttps://twitter.com/Desk?ref_src=twsrc%5Egoogle%7Ctwcamp%5Es...If you look for more than a second, you realize nothing, absolutely nothing about it makes sense. It's insane.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-03T03:42:57.000Z\",\n    \"depth\": 2\n  },\n  {\n    \"id\": 10667959,\n    \"author\": null,\n    \"text\": \"I've been staring at that for 5 minutes and I can't for the life of me see what doesn't make sense. What doesn't make sense?!\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-03T05:38:26.000Z\",\n    \"depth\": 3\n  },\n  {\n    \"id\": 10668505,\n    \"author\": null,\n    \"text\": \"Probably the lack of power going to the iMacs, which could also explain why they have to use their mobile devices instead... :)\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-03T08:22:28.000Z\",\n    \"depth\": 4\n  },\n  {\n    \"id\": 10667624,\n    \"author\": null,\n    \"text\": \"You can succeed as a fast follower but you won't become a monopoly.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-03T03:44:45.000Z\",\n    \"depth\": 2\n  },\n  {\n    \"id\": 10664085,\n    \"author\": null,\n    \"text\": \"I'm trying to figure out what's so great about this app.  Is it just that it's available on iOS and OSX?\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T16:55:39.000Z\",\n    \"depth\": 1\n  },\n  {\n    \"id\": 10664625,\n    \"author\": null,\n    \"text\": \"It's a good PDF utility.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T18:03:51.000Z\",\n    \"depth\": 2\n  },\n  {\n    \"id\": 10664660,\n    \"author\": null,\n    \"text\": \"It scratches an itch.It is polished.It works well.They marketed it like hell.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T18:09:31.000Z\",\n    \"depth\": 2\n  },\n  {\n    \"id\": 10664859,\n    \"author\": null,\n    \"text\": \"It's a few steps above Preview.app (Apple's built-in PDF viewer), but without all the bloat and the high price of Acrobat.And it probably doesn't have anywhere near as many security vulnerabilities as Acrobat.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T18:38:38.000Z\",\n    \"depth\": 3\n  },\n  {\n    \"id\": 10664158,\n    \"author\": null,\n    \"text\": \"Although not a top paid app for a side project my app is doing surprisingly well even outside the app store after I took it out recently.The number one factor which he alluded to is which pricing strategy to follow. My app is not 70 but 9.99.I too am using a time limited version and I am realizing that this isn't the best approach for my app either. So I am working towards something like what Sublime is doing.One of the biggest learnings I have gotten from this experience is that an app is rarely a business and that the MAS is rarely a good distribution channel if you are doing something unique.I could make at a minimum double as much as I am doing right now if i spent som more time on it (I will make around $50K the first year) and there is money to be made if you have something unique. Unfortunately thats hard to do on the MAS with Sandbox.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T17:05:45.000Z\",\n    \"depth\": 1\n  },\n  {\n    \"id\": 10664420,\n    \"author\": null,\n    \"text\": \"How did/do you market/promote it?\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T17:36:44.000Z\",\n    \"depth\": 2\n  },\n  {\n    \"id\": 10664453,\n    \"author\": null,\n    \"text\": \"A combination. HN was a good first boost https://news.ycombinator.com/item?id=9145007Then got in contact with a lot of websites. Was lucky to get som really good reviews on LifeHacker and MacUpdate plus other places. And then people started telling their friends about it.Plus I have an email list now with +10K customers or potential customers.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T17:40:50.000Z\",\n    \"depth\": 3\n  },\n  {\n    \"id\": 10664545,\n    \"author\": null,\n    \"text\": \"It's interesting how he says videos are important. I find videos to be much slower to parse than reading features or reviews from notable people within the industry the app is part of. For example, in the case of Sketch, I didn't watch the video (didn't even know they had them until I checked today) but instead read what it's like to use the application from a couple different designers.In the case of Dropbox (whoa, that was a long time ago), I think I just had it verbally recommended to me from techies or I just read about it on HN.In fact, all of what I end up installing and using comes from the backs of people rather than videos. Maybes it's a generational thing.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T17:53:28.000Z\",\n    \"depth\": 1\n  },\n  {\n    \"id\": 10665857,\n    \"author\": null,\n    \"text\": \"Thanks for your comment, but from my experience - a good video can benefit greatly to the product. And true, younger crowd prefers video to the text :)\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T21:13:32.000Z\",\n    \"depth\": 2\n  },\n  {\n    \"id\": 10667046,\n    \"author\": null,\n    \"text\": \"I'm with you.  The majority of these videos are just fluff and filler.  I don't need 51 seconds of video (with maybe 10 seconds actually demonstrating the bit I might be interested in).If you want video, go for it, but make sure to also include text somewhere because if the only way to find out what your product does is to watch a video I'll probably just close the tab.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-03T01:02:30.000Z\",\n    \"depth\": 2\n  },\n  {\n    \"id\": 10664551,\n    \"author\": null,\n    \"text\": \"The time-limited trial is essential for selling productivity software, unfortunately most companies are doing it wrong.Beyond Compare[1] has a 30-day trial that is 30 days of use - not just 30 consecutive days. If I actually use a piece of software 30 different times on different days, then it's definitely worth a purchase. It's too bad more developers don't design their trials this way.[1] - http://www.scootersoftware.com/\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T17:53:46.000Z\",\n    \"depth\": 1\n  },\n  {\n    \"id\": 10664593,\n    \"author\": null,\n    \"text\": \"I find time limited trials useless. For user, it is inconvenient, because maybe the time is not enough to test complex software. For developers it's bad because user can simply reinstall the software again when trial period is over.In my apps, I limit the amount of data you can store in trial version. So, you can try it as much as you can. For example, if your software was an e-mail client, you could limit it to 30 messages in any folder (inbox, sent, trash).\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T18:00:20.000Z\",\n    \"depth\": 2\n  },\n  {\n    \"id\": 10664742,\n    \"author\": null,\n    \"text\": \"Depends how you do it.  Many apps that use time trials will often leave behind some preference file or registry key to block re-installing.But it's probably not worth building that into your software (I don't) - customers will either get so sick of reinstalling every 30 days that they just buy your software, or they're so poor that they were never really going to be a customer anyway, so you may as well let them continue with the workaround until they can afford it.Time trials can be useful though.  While most customers buy within the first day of use (and typically the first hour!), anyone who tracks metrics knows that expiring the trial version also generates a boost in sales around day 29 / day 30 of the trial.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T18:21:11.000Z\",\n    \"depth\": 3\n  },\n  {\n    \"id\": 10666795,\n    \"author\": null,\n    \"text\": \"I am not sure that this can be applied to any kind of app. You have to give user as much as possible until the product becomes valuable enough for him to buy, and that's when update option should be displayed. For example, in the case of an email app, time-limited trial can actually be a better option. User get's used to it, maybe he stores some additional information inside it or uses some specific features. Just limiting a number of emails would not let the user see the full potential of the app.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T23:58:01.000Z\",\n    \"depth\": 3\n  },\n  {\n    \"id\": 10668016,\n    \"author\": null,\n    \"text\": \"One scheme I saw required a code that worked for a day. They had a server that generated a new code and posted it to their web site every day. So you could use it as long as you wanted, but you had to go to their website every day to get a code to use it that day. If you used it every day, you probably got sick of going to the website and just purchased it.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-03T06:00:24.000Z\",\n    \"depth\": 2\n  },\n  {\n    \"id\": 10664599,\n    \"author\": null,\n    \"text\": \"10. Release a quality appIt's not a buggy, slow, unusable piece of crap that a lot of low-end software is. It's easy to use and it works well.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T18:01:15.000Z\",\n    \"depth\": 1\n  },\n  {\n    \"id\": 10664661,\n    \"author\": null,\n    \"text\": \"Purely from a user's perspective, the Mac app store has a considerable advantage in centrally managing updates. Non-MAS apps each have their own eclectic ways of updating. Some support automatic update checks, while users have to explicitly check others.  For the ones with automatic updates, there are a number of ways it's handled.  Users don't generally want scores of update daemons running, and the whole business of \\\"On launch, check for update, notify the user and let them choose whether to update now\\\" really feels like the web page pop-ups that are so popular. (\\\"I launched the app to do work, not to see if there was an update.  The update prompt is in my way.\\\")  This cries out for a better user experience.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T18:09:46.000Z\",\n    \"depth\": 1\n  },\n  {\n    \"id\": 10664757,\n    \"author\": null,\n    \"text\": \"Update on the way out? ie. Pop up with two options \\\"close\\\" and \\\"update and close\\\", at least this time you've already accomplished what you were after with the application.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T18:22:59.000Z\",\n    \"depth\": 2\n  },\n  {\n    \"id\": 10664784,\n    \"author\": null,\n    \"text\": \"Maybe it's just me, but when I am ready to quit an app the last thing I want to do is go through an update process.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T18:26:05.000Z\",\n    \"depth\": 3\n  },\n  {\n    \"id\": 10664847,\n    \"author\": null,\n    \"text\": \"Especially one that will relaunch the app when it's done.Ideally, you'd want a system-level daemon that downloads and preps updates in the background, and either waits until the system is idle (I think Apple has some tech like this already for running Time Machine backups), with pending updates optionally installed on system shutdown (am I shutting down to save on battery, to restart, or because I'm about to leave the office and I don't care how long it takes for the system to shut down).\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T18:36:03.000Z\",\n    \"depth\": 4\n  },\n  {\n    \"id\": 10665141,\n    \"author\": null,\n    \"text\": \"I think Kelly Sutton (of the late layervault) figured this out with his fork of sparkle, called \\\"autosparkle\\\" - https://github.com/layervault/Sparkle . I haven't personally integrated it into my app yet, but supposedly it makes updates a much more silent process - which is really important for 'always-on' tray apps like layervault was, or the one I'm making.Here's their announcement of it from 2013: http://layervault.tumblr.com/post/50501747774/open-sourced-a...\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T19:16:43.000Z\",\n    \"depth\": 5\n  },\n  {\n    \"id\": 10666520,\n    \"author\": null,\n    \"text\": \"What I've always wanted, and no one seems to do, is to have the update box pop up on startup (as usual), and then have a button that says \\\"Install on quit.\\\" Then I wouldn't have to be interrupted when I opened an app to do something, and it would be taken care of when I finished so that it's ready for the next time.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T22:57:37.000Z\",\n    \"depth\": 3\n  },\n  {\n    \"id\": 10665920,\n    \"author\": null,\n    \"text\": \"So would you think that MAS is generally better in terms of perception and trust?\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T21:21:16.000Z\",\n    \"depth\": 2\n  },\n  {\n    \"id\": 10666775,\n    \"author\": null,\n    \"text\": \"Yeah it's a little insane how long it's taken for Apple and Microsoft to get software updates right when it's so common and humdrum on the linux side of things.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T23:54:15.000Z\",\n    \"depth\": 2\n  },\n  {\n    \"id\": 10664823,\n    \"author\": null,\n    \"text\": \"How do they get in touch with that \\\"App Store Business Management\\\" they spoke about? It's not like they make their emails available for any Joe Developer to talk to them.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T18:32:33.000Z\",\n    \"depth\": 1\n  },\n  {\n    \"id\": 10664871,\n    \"author\": null,\n    \"text\": \"I'm wondering about the same thing:Apple is being very helpful these days, and they want developers to succeed. That is why you really should keep in touch with App Store Business Management and keep them updated on what you\\u2019re building and when you\\u2019re getting ready for a launch.It's a highly rarefied group of developers who have a contact in App Store management that would be interested in hearing about an upcoming launch.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T18:40:30.000Z\",\n    \"depth\": 2\n  },\n  {\n    \"id\": 10664910,\n    \"author\": null,\n    \"text\": \"And how do they achieve it? Where do they even start?We have two apps that have had nearly 4 million downloads across both app stores. Here's been the growth of our Mac app, for example: http://qbix.com/calendar . Our average reviews are very close to 5 stars out of 5 after thousands of reviews.It's all organic. People just found us in the store. We were never contacted by Apple to get featured, and we had no way of contacting them, that we knew of. So I'm curious. It's not just about numbers.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T18:46:13.000Z\",\n    \"depth\": 3\n  },\n  {\n    \"id\": 10664945,\n    \"author\": null,\n    \"text\": \"The article mentions that they've been on iOS for almost eight years, so they must have been in the App Store at the very start. I imagine that helps to build a relationship.That also makes their advice on this point rather difficult to apply. It's sort of like this marketing advice:\\\"It can be really helpful if the New York Times writes a two-pager about you. You should call up your contact on the editorial team in advance and tell them about what you're doing, so the story will be ready on launch day.\\\"\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T18:51:47.000Z\",\n    \"depth\": 4\n  },\n  {\n    \"id\": 10665138,\n    \"author\": null,\n    \"text\": \"The author of the article has an answer to this question: \\\"Go to WWDC\\\"\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T19:16:36.000Z\",\n    \"depth\": 5\n  },\n  {\n    \"id\": 10665948,\n    \"author\": null,\n    \"text\": \"True :) they asked us to be on the first day of the App Store 7 years ago!\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T21:25:31.000Z\",\n    \"depth\": 5\n  },\n  {\n    \"id\": 10665075,\n    \"author\": null,\n    \"text\": \"Most of the people with these relationships attended WWDC, met a developer or product manager and held onto their card.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T19:08:09.000Z\",\n    \"depth\": 3\n  },\n  {\n    \"id\": 10665935,\n    \"author\": null,\n    \"text\": \"Guys, I recommend attending WWDC in SF! You can meet all the Apple folks there.For us, we launched our first web app in 2008 even before the App Store. Apple loved it - they called us and told about App Store that is being launched so they wanted us to be there on day 1. We consistently delivered great products that people loved. Here, I wrote a post on how to get featured on the App Store http://denzhadanov.com/2014/03/26/how-to-get-featured-on-the...\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T21:23:56.000Z\",\n    \"depth\": 3\n  },\n  {\n    \"id\": 10667996,\n    \"author\": null,\n    \"text\": \"I would love to go to WWDC. However isn't having the honor of paying the 2k or so a bit like winning lotto? I mean - since you have to enroll to be (hopefully) selected as one of the lucky few who can attend, and if you're selected you're allowed to pay them to attend?I have been a solo mac developer for the past 15 years or so (you can see my stuff at http://macdaddy.io), and I have never been able to attend a WWDC. It does strike me as unfair when I see other companies having the opportunity to attend, getting advice and recognition, and then getting featured by Apple and so forth. I have seen other companies allowed to have their apps on the mac app store which require root access, while I write a competing app data recovery app and it's never allowed on the mac app store - only to see that they blogged about attending WWDC and rubbing shoulders with the right people at Apple. Sometimes I feel that I write good software, but I lack the political connections to make real progress.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-03T05:50:29.000Z\",\n    \"depth\": 4\n  },\n  {\n    \"id\": 10669884,\n    \"author\": null,\n    \"text\": \"I posted Denys article to HN: https://news.ycombinator.com/item?id=10669628Our apps have been featured dozens of times and there is definitely a method to the madness. I shared my 2 cents on how to get featured as a comment on that HN link.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-03T15:03:15.000Z\",\n    \"depth\": 2\n  },\n  {\n    \"id\": 10664907,\n    \"author\": null,\n    \"text\": \"Nice article. On a completely unrelated subject, the guy in the video left the machine unlocked. Bad guy.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T18:45:35.000Z\",\n    \"depth\": 1\n  },\n  {\n    \"id\": 10665102,\n    \"author\": null,\n    \"text\": \"> PDF Expert is available at an introductory price of $19.99, but that will rise in the near future to $60\\u201370 once we add PDF editing and OCR.$60\\u201370 for a fancy PDF reader ? By doing this you will get only the people that really, really need your software, the others will turn away unable to justify such an expense for a non vital software.A bit like an iPhone in fact. I could afford one, but I don't want to make sacrifices on other more important things. Sometimes I wonder if the peoples that make these prices live in a kind of \\\"rich people bubble\\\" where money grows on trees and 70 bucks for a PDF reader or almost a grand for a smartphone is just chump change.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T19:12:17.000Z\",\n    \"depth\": 1\n  },\n  {\n    \"id\": 10665569,\n    \"author\": null,\n    \"text\": \"Those that can justify the $70 need the software. Those that can't didn't need it in the first place, and probably wouldn't pay $1.99. If it saves me an hour, worth $70. YMMV, and it obviously does.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T20:28:13.000Z\",\n    \"depth\": 2\n  },\n  {\n    \"id\": 10666817,\n    \"author\": null,\n    \"text\": \"But other PDF editors cost a lot more. PDFpen is worth $75, and Adobe Acrobat DC costs like $450 if purchased fully, not by subscription model.Finally, it all depends on what exactly you need from the app. Fast, reliable and well-designed software can't be cheap - and I don't think it should.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-03T00:02:29.000Z\",\n    \"depth\": 2\n  },\n  {\n    \"id\": 10667652,\n    \"author\": null,\n    \"text\": \"I must admit I found the proposed $60 price a bit shocking when I read the article. Surely there are free software solutions which do much the same thing. I believe Okular can do most of the things the article alluded to.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-03T03:53:26.000Z\",\n    \"depth\": 3\n  },\n  {\n    \"id\": 10669982,\n    \"author\": null,\n    \"text\": \"That's true, $60 would be too much for current set of features. But this is a supposed price for updated version, which will be released soon, which includes powerful PDF editing features as well (similar to those in Acrobat Pro, for example).\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-03T15:20:18.000Z\",\n    \"depth\": 4\n  },\n  {\n    \"id\": 10666230,\n    \"author\": null,\n    \"text\": \"It was crucial to pick the right business model for PDF Expert. Since we are a privately owned company and never raised any capital, we have to make profit in order to develop great software\\u200a\\u2014\\u200aan expensive endeavor these days.Kudos to someone else who actually wants to make money these days, not just spark investor interest, burn a ton of other people's money and then retire to write a book while their company goes down in flames.\",\n    \"points\": 0,\n    \"created_at\": \"2015-12-02T22:10:08.000Z\",\n    \"depth\": 1\n  }\n]"
}