{
  "meta.json": "{\n  \"rank\": 20,\n  \"title\": \"Use micromorts to fight terrorism\",\n  \"url\": \"https://web.archive.org/web/20151117064805/https://blog.arty.name/2015/\\u043c\\u0438\\u043b\\u043b\\u0438\\u043c\\u043e\\u0440\\u0442\\u043e\\u043c-\\u043f\\u043e-\\u0442\\u0435\\u0440\\u0440\\u043e\\u0440\\u0443/en.html\",\n  \"hn_url\": \"https://news.ycombinator.com/item?id=10571077\",\n  \"points\": 184,\n  \"author\": \"N/A\",\n  \"comment_count\": 90\n}",
  "article.txt": "use micromorts to fight terrorism — software simian's typewritings\nuse micromorts to fight terrorism\n(\nмикромортом по террору\n)\nSince years I do my little contribution to the war on terrorism. I can't really defeat it, but I can prevent it from defeating me. After all the goal of shootings and explosions is not to physically destroy citizens, it is to scare them. So when people are not afraid, terrorists do not reach their goals. And if you succumb to fear, terrorists win.\nRecently I've got a new tool to fight terror, and I want to recommend it to you as well. It is called\nmicromort\nand is used to calculate the probability of unnatural death. One micromort is one chance in a million to die neither from old age nor from disease. Incidentally the normal daily risk to die is around one micromort. We live with that every day and are not particularly concerned about it.\nKnowing about micromorts you can convert other, less readable descriptions of risks to micromorts to compare them with normal life. Here's an example: \"135 skydives of 15 million resulted in death\" becomes 9 micromorts per jump. So a jump is as safe as living 9 days normally. While riding a motorcycle for 100 kilometers is 10 micromorts, and is slightly more dangerous. With micromorts risks become much more obvious and easy to understand and to compare.\nSo here is how I use micromorts to fight terrorism. 153 people of 67 million French citizens have died in attacks on Friday. This is 2.5 micromorts. This is slightly more dangerous than normal life, but even a short ride on the motorcycle is more risky. Armed with that knowledge I am not afraid of terrorists, and they can't defeat me.\nАртемий Трегубенко\n,\n15 ноября 2015\npsychology\n,\npolitics\n,\nsociety\nPlease enable JavaScript to view the\ncomments powered by\nDisqus.\ncomments powered by\nDisqus\nпостоянная ссылка\n← «the biggest audience ever»\n«live testing on members of parliament» →\nглавная страница\nархив\nтеги",
  "comments.json": "[\n  {\n    \"id\": 10578925,\n    \"depth\": 0,\n    \"author\": \"gtirloni\",\n    \"text\": \"Some types of death do have a stronger emotional effect on us.Perspective is everything. Good approach :)\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T03:04:17.000Z\"\n  },\n  {\n    \"id\": 10578947,\n    \"depth\": 0,\n    \"author\": \"gesman\",\n    \"text\": \"You have a point, but I&#x27;d suggest to replace fight with be ok with.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T03:12:44.000Z\"\n  },\n  {\n    \"id\": 10578974,\n    \"depth\": 1,\n    \"author\": \"saulrh\",\n    \"text\": \"Given the way terrorism works (http:&#x2F;&#x2F;slatestarcodex.com&#x2F;2014&#x2F;12&#x2F;17&#x2F;the-toxoplasma-of-rage&#x2F;), being OK with it translates pretty directly into denying it a chance to reproduce and thereby killing it.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T03:22:44.000Z\"\n  },\n  {\n    \"id\": 10579002,\n    \"depth\": 2,\n    \"author\": \"derefr\",\n    \"text\": \"Right; you fight terrorism by being okay with terorrists.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T03:31:05.000Z\"\n  },\n  {\n    \"id\": 10579314,\n    \"depth\": 3,\n    \"author\": \"saulrh\",\n    \"text\": \"Yes, because they can&#x27;t hurt you in absolute terms (as pointed out by the OP) and if you fight back you just make them stronger.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T05:22:11.000Z\"\n  },\n  {\n    \"id\": 10578951,\n    \"depth\": 0,\n    \"author\": \"haomself\",\n    \"text\": \"The risk of riding a motocycle can be estimated from a large sample. The risk of a terror attack in Paris can not. Friday&#x27;s attach is 2.5 micromorts, but how do you know there is not another larger scale attach in the works? That is what worries, scares most people, until these attack become normal and people get used to it, like those live in Jerusalem.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T03:14:17.000Z\"\n  },\n  {\n    \"id\": 10579006,\n    \"depth\": 1,\n    \"author\": \"giaour\",\n    \"text\": \"Isn&#x27;t that kind of the point? Successful attacks are incredibly rare, and the risk of being killed in one is therefore very small.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T03:32:14.000Z\"\n  },\n  {\n    \"id\": 10579013,\n    \"depth\": 1,\n    \"author\": \"NhanH\",\n    \"text\": \"Everyday passing by is a sample day that you can use to estimate the risks. Even if you argue that terrorism is a relatively new risk in the past few decades and start your sampling from September 2001, we still have more than a decade of sample days to estimate the risk. That&#x27;s a huge sample.There might not be enough sample to know how many people would be harmed during a terrorist attack. But there is definitely enough information to estimate the risk of an attack itself.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T03:34:19.000Z\"\n  },\n  {\n    \"id\": 10579062,\n    \"depth\": 2,\n    \"author\": \"jndsn402\",\n    \"text\": \"Actuary here. I don&#x27;t have the math at my fingertips, but to confidently estimate the risk of any occurrence you need a significant sample of the event, not just a significant amount of exposure.So for instance, if you are estimating the mortality rate of a 25 year old and the rate for an 85 year old you would be equally confident in each estimate if your data sample contained an equal amount of deaths for each, not an equal amount of life-years.So while we have many days of exposure to terrorism risk, we do not have many occurrences and therefore do not have a confident estimate of the rate of major terror attacks.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T03:50:12.000Z\"\n  },\n  {\n    \"id\": 10579088,\n    \"depth\": 3,\n    \"author\": \"jacquesm\",\n    \"text\": \"Definitely not an actuary here so forgive my ignorance: Isn&#x27;t the fact that &#x27;we do not have many occurrences&#x27; by itself enough to establish a lower bound?\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T03:59:23.000Z\"\n  },\n  {\n    \"id\": 10579111,\n    \"depth\": 4,\n    \"author\": \"hawkice\",\n    \"text\": \"You mean upper bound -- being a more likely killer than heart attacks is a statistical impossibility. Same for car accidents. Same for iron deficiency, Trypanosomiasis, and a bunch of other things.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:06:05.000Z\"\n  },\n  {\n    \"id\": 10579121,\n    \"depth\": 5,\n    \"author\": \"jacquesm\",\n    \"text\": \"Hm, no I really meant &#x27;lower bound&#x27;, as in &#x27;we have seen x events in y days to date, so there can&#x27;t be fewer than that&#x27;. And then you&#x27;d have to adjust that as more evidence rolls in.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:09:58.000Z\"\n  },\n  {\n    \"id\": 10579143,\n    \"depth\": 6,\n    \"author\": \"hawkice\",\n    \"text\": \"Not an unreasonable conclusion, but let&#x27;s say there is a true (hidden&#x2F;unknowable) rate of deaths X. You&#x27;d expect, not knowing the statistical distribution, maybe half the time the measurement (adding deaths from events) it&#x27;ll be less and half the time it&#x27;d be more, just like any other random variable measurement. So it isn&#x27;t a lower bound, just a fantastic guess that&#x27;s bound to be pretty close. How close will it be? Well, the sample size is pretty low, so honestly it could be quite wrong. This is what the mega-parent was saying.edit: you can get a lower bound, from a statistical perspective, the same way, where you go out a couple standard deviations to make up for small sample size, e.g. terrorism is more dangerous than being hit by two meteors at the same time, but if you wanted to make the case terrorism is more dangerous than something strange like water overdose that&#x27;s probably true but not a lower-bound level statistical certainty.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:16:41.000Z\"\n  },\n  {\n    \"id\": 10579151,\n    \"depth\": 7,\n    \"author\": \"jacquesm\",\n    \"text\": \"A I see (or at least, I think I see), it&#x27;s just another bell curve and this is the center line of that curve?\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:20:38.000Z\"\n  },\n  {\n    \"id\": 10579168,\n    \"depth\": 8,\n    \"author\": \"hawkice\",\n    \"text\": \"It&#x27;s a single data point on the curve, so probably close to average, but yeah, that&#x27;s the notion.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:25:15.000Z\"\n  },\n  {\n    \"id\": 10579262,\n    \"depth\": 9,\n    \"author\": \"jacquesm\",\n    \"text\": \"Thank you for the explanation!\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T05:04:14.000Z\"\n  },\n  {\n    \"id\": 10579102,\n    \"depth\": 3,\n    \"author\": \"NhanH\",\n    \"text\": \"Right, risk estimation would be a probability distribution by itself. It won&#x27;t be a five sigma confidence in the estimation. But if one was to do the work and actually calculate the estimation distribution, I&#x27;d find it hard to believe that the result would be much of any concern than our normal daily risk.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:03:17.000Z\"\n  },\n  {\n    \"id\": 10579157,\n    \"depth\": 1,\n    \"author\": \"marssaxman\",\n    \"text\": \"It&#x27;s pretty easy to look back over my entire lifetime and observe that terrorism is not new, not getting worse, and not a significant risk. None of that has changed as of this past Friday; this is just... a thing that happens every now and then, noisy and easy to show on the news, but not actually accomplishing much. Terrorists are weak; they depend on our {chickenshit|warmonger} governments to do their dirty work. I am not afraid of terrorists.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:22:28.000Z\"\n  },\n  {\n    \"id\": 10578986,\n    \"depth\": 0,\n    \"author\": \"vcdimension\",\n    \"text\": \"Any terrorist attack in France will almost certainly happen in the center of one of the major cities, most likely Paris. So if you live in the center of Paris your micromort should be much higher, and if you live in a small village it will be much smaller. \\nAlso the micromort calculation quoted in the article is for being killed in a single terrorist attack in which 153 people die. If you think there are likely to be several such attacks over the next few years then that increases the micromort value higher.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T03:26:11.000Z\"\n  },\n  {\n    \"id\": 10579120,\n    \"depth\": 1,\n    \"author\": \"tedks\",\n    \"text\": \"This assumes there is some incentive for terrorists to attack big cities. It could be strategically valuable for terrorists to just randomly attack tiny villages, where the response time for emergency services equipped to deal with heavily-armed moderately-trained militants is long enough for them to wipe basically the whole place out, and after which they can strike fear into any village and cause the governments to spend a ton turning all of them into fortresses.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:09:48.000Z\"\n  },\n  {\n    \"id\": 10578996,\n    \"depth\": 0,\n    \"author\": \"yakult\",\n    \"text\": \"When I see &#x27;micromorts&#x27;, my first thought is that it&#x27;s an euphemism for assassination, possibly with drones.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T03:28:51.000Z\"\n  },\n  {\n    \"id\": 10579110,\n    \"depth\": 1,\n    \"author\": \"joeclark77\",\n    \"text\": \"I was thinking some kind of mortar but ultra-portable.  Perhaps an iPhone attachment of some kind?\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:06:00.000Z\"\n  },\n  {\n    \"id\": 10579001,\n    \"depth\": 0,\n    \"author\": \"methou\",\n    \"text\": \" After all the goal of shootings and explosions is not to physically destroy citizens, it is to scare them. So when people are not afraid, terrorists do not reach their goals. And if you succumb to fear, terrorists win.Reminds me of Japanese people&#x27;s reaction to the ISIS threat, they mocked them on twitter with memes[1]. Also they denied request of religious food for exchange students[2]. Any religion is not superior than others, so there will be legal or philosophical standings for them to be treated special.[1] http:&#x2F;&#x2F;www.nbcnews.com&#x2F;storyline&#x2F;isis-terror&#x2F;japanese-twitte...[2] http:&#x2F;&#x2F;www.nzherald.co.nz&#x2F;nz&#x2F;news&#x2F;article.cfm?c_id=1objecti...\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T03:30:49.000Z\"\n  },\n  {\n    \"id\": 10579027,\n    \"depth\": 1,\n    \"author\": \"grogenaut\",\n    \"text\": \"Wait, someone still serves a website with cold fusion?\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T03:41:30.000Z\"\n  },\n  {\n    \"id\": 10579051,\n    \"depth\": 2,\n    \"author\": \"jonah\",\n    \"text\": \"Lots of sites! Big and small. There are even several excellent Open Source CFML engines.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T03:48:21.000Z\"\n  },\n  {\n    \"id\": 10579096,\n    \"depth\": 2,\n    \"author\": \"slyall\",\n    \"text\": \"Afraid so. I used to work there. The codebase is at least 15 years old in places. Team of 4-8 people looking after it and rolling out changes. Self-written CMS as well.Every now and then somebody gets the idea of rewriting it in something else. Problem is that while it may look simple ( I just need templates for front, section and articles pages) there is a lot of extras (see the 4-8 people and CMS). Note that newspaper companies don&#x27;t have a lot of money these days.I&#x27;ve heard they are having another go at it. For one thing it is hard to get CF programmers these days.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:01:10.000Z\"\n  },\n  {\n    \"id\": 10590652,\n    \"depth\": 3,\n    \"author\": \"grogenaut\",\n    \"text\": \"Awesome, I never expected an actual answer. Thanks!\",\n    \"points\": null,\n    \"created_at\": \"2015-11-18T20:52:20.000Z\"\n  },\n  {\n    \"id\": 10579257,\n    \"depth\": 2,\n    \"author\": \"lips\",\n    \"text\": \"MetaFilter too, in professional white. http:&#x2F;&#x2F;mefiwiki.com&#x2F;wiki&#x2F;MetaFilter\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T05:01:38.000Z\"\n  },\n  {\n    \"id\": 10579160,\n    \"depth\": 1,\n    \"author\": \"J_Darnley\",\n    \"text\": \" The memes at [1]Ha ha ha.  The absolute best way to deal with any threat.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:22:48.000Z\"\n  },\n  {\n    \"id\": 10579454,\n    \"depth\": 2,\n    \"author\": \"late2part\",\n    \"text\": \"Maybe.  Kenji Goto and others are sadly still dead and these Daesh fools keep killing others.  Mocking evil people with memes is like wearing a yellow ribbon for cancer.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T06:16:07.000Z\"\n  },\n  {\n    \"id\": 10579885,\n    \"depth\": 1,\n    \"author\": \"wodenokoto\",\n    \"text\": \"The kid in [2] did not request religious food but simply said he&#x27;d eat around the pork.My uni here in osaka has kosher options in all cantinas.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T08:43:25.000Z\"\n  },\n  {\n    \"id\": 10580148,\n    \"depth\": 2,\n    \"author\": \"desdiv\",\n    \"text\": \"Did you mean halal? Kosher is a Jewish requirement.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T10:07:28.000Z\"\n  },\n  {\n    \"id\": 10580292,\n    \"depth\": 3,\n    \"author\": \"wodenokoto\",\n    \"text\": \"Haha, yeah, I did. My bad.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T10:53:39.000Z\"\n  },\n  {\n    \"id\": 10579008,\n    \"depth\": 0,\n    \"author\": \"viraptor\",\n    \"text\": \"While I like the idea in general, the result is a bit arbitrary. Why is it 153 people of 67 million French citizens have died in attacks on Friday? Why not out of 508.2M people in EU? Or out of 2M people living in Paris?Unless you calculate the micromorts for comparison between countries, limiting the area in such way doesn&#x27;t make much sense. It&#x27;s a single event -vs- activities which can be practiced for long amount of time. (someone with better statistics vocabulary can probably explain it nicely)\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T03:32:55.000Z\"\n  },\n  {\n    \"id\": 10579031,\n    \"depth\": 1,\n    \"author\": \"NhanH\",\n    \"text\": \"Wouldn&#x27;t the set being chosen just resulting in different probability profile, and you get to pick one depending on your personal characteristics?Ie. 2.5 micromorts is your risk if you&#x27;re a French citizen, (153 + other death from terrorism) &#x2F; (7.3 billions) if you&#x27;re a human, 153&#x2F;2M if you&#x27;re living in Paris?Edit: change the napkin calculation for correctnesss.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T03:42:39.000Z\"\n  },\n  {\n    \"id\": 10579067,\n    \"depth\": 2,\n    \"author\": \"viraptor\",\n    \"text\": \"I don&#x27;t think the human one would be true, because there were many more people dying in terrorist attacks over the last year. But otherwise yes, you could depending on the area provide different risks - which was my point: you can use it to compare continuous activities within some area &#x2F; population group. But absolute values for single data points just don&#x27;t give you much information.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T03:52:17.000Z\"\n  },\n  {\n    \"id\": 10579492,\n    \"depth\": 2,\n    \"author\": \"privacy101\",\n    \"text\": \"Who decides whether it was terrorism, revenge, craziness, etc?\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T06:31:51.000Z\"\n  },\n  {\n    \"id\": 10579189,\n    \"depth\": 1,\n    \"author\": \"lkbm\",\n    \"text\": \"It should be based on the scope of policies. France should set their anti-terrorism policies based on the risk to France. The EU should set their anti-terrorism policies based on the risk to the EU. Paris should set their anti-terrorism policies based on the risk to Paris.Most policies being looked at right now are France-scope.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:36:57.000Z\"\n  },\n  {\n    \"id\": 10579560,\n    \"depth\": 2,\n    \"author\": \"dovdov\",\n    \"text\": \"So Paris will do a &#x27;lot&#x27; about it, the French will do &#x27;something&#x27; about it, the EU will do &#x27;little&#x27; about it, and the world will do &#x27;less than nothing&#x27; about it?\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T06:52:58.000Z\"\n  },\n  {\n    \"id\": 10639789,\n    \"depth\": 3,\n    \"author\": \"meric\",\n    \"text\": \"The venue in question will do even more than a lot  about it.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-28T02:43:35.000Z\"\n  },\n  {\n    \"id\": 10584558,\n    \"depth\": 1,\n    \"author\": \"rootlocus\",\n    \"text\": \"I think the article is abusing Bayes Rule.Keeping in line with the other examples in the article, why not: 1 out of 1 bombing attack resulted in death? Because bombing attacks are not something you choose to do (as opposed to skydiving or riding a motorcycle). Also, the threat level is not uniform across the country. Also, there haven&#x27;t been a million bombings so we&#x27;re doing statistics with one sample. Also, we&#x27;re also expecting the bombings to continue. There are a lot of misinterpretations and oversimplifications here.I find it highly irrelevant, as a person working in a large town, frequently being in highly populated areas, in a country that&#x27;s possibly a target for ISIS to compare myself with the average person living in a different country. It&#x27;s almost like assuming that smokers and non-smokers have the same chance of dying from lung cancer, and then using the entire population of the world as reference to prove that smoking is actually pretty healthy.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T22:44:36.000Z\"\n  },\n  {\n    \"id\": 10585636,\n    \"depth\": 2,\n    \"author\": \"aidenn0\",\n    \"text\": \"You can choose to live in France perhaps?  One could also add up all the deaths to terrorism in major western cities since ISIS was formed (or since 9&#x2F;11, or whatever point you choose as representative of the present for expected terrorist attacks) and calculate the risk there.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-18T03:02:11.000Z\"\n  },\n  {\n    \"id\": 10579030,\n    \"depth\": 0,\n    \"author\": \"vezzy-fnord\",\n    \"text\": \"Black swan events being unanticipated, it is futile to worry about them. It&#x27;s commonly retorted that terrorist attacks should be interpreted as unique because of their intent. Yet no one actually fears the intent, only the end result (death, destruction, injury). Intent is relevant to drafting a response, but not to the public fear. Intent without resources or sophistication is also not meaningful. It is further stated that they are special because they&#x27;re attacks on the social order. Yet this is a truism, because they only have such an effect if people permit themselves to make it so. More mundanely perceived events like business cycles or crime rates (many small events rather than one large event like a terrorist attack) have the same capacity for social ruin, but are not as feared even as they are significantly more protracted. It&#x27;s all inexcusable bias.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T03:42:39.000Z\"\n  },\n  {\n    \"id\": 10579351,\n    \"depth\": 1,\n    \"author\": \"rayiner\",\n    \"text\": \"The response to terrorism isn&#x27;t about fear. It&#x27;s about justice. These assholes are trying to drag us all back to 700 AD and reestablish the Caliphate, and they struck at a bastion of western liberalism to that end. You can&#x27;t appreciate the human reaction to that by short sightedly looking at the risk of dying in a car accident.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T05:35:11.000Z\"\n  },\n  {\n    \"id\": 10579434,\n    \"depth\": 2,\n    \"author\": \"woah\",\n    \"text\": \"Unfortunately, goading western countries into wars we can&#x27;t win is the basis of their strategy. So if your attitude causes you to short-sightedly support military action out of fear (even if you tell yourself it&#x27;s anger), you&#x27;re helping the terrorists win.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T06:06:54.000Z\"\n  },\n  {\n    \"id\": 10579457,\n    \"depth\": 3,\n    \"author\": \"joeclark77\",\n    \"text\": \"ISIS isn&#x27;t trying to goad us into war.  They&#x27;re waging war on us, and doing so effectively.  The kind of probabilistic analysis proposed by the OP takes terrorist attacks as if they occur randomly at some rate we have little control over, like car accidents.  That is not the case when you have an enemy actively killing you and you have to make a decision: fight back, or signal that you won&#x27;t fight back.  If the latter, the number of micromorts is going to increase exponentially.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T06:18:25.000Z\"\n  },\n  {\n    \"id\": 10579547,\n    \"depth\": 4,\n    \"author\": \"woah\",\n    \"text\": \"No, goading us into war really is their strategy, whether it fits with your worldview or not[1]. They currently rule over lands whose governments we destroyed, using weapons that we brought there and gave to the good guys. They are well aware of this, and it is what they want.[1] https:&#x2F;&#x2F;azelin.files.wordpress.com&#x2F;2010&#x2F;08&#x2F;abu-bakr-naji-the...\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T06:49:08.000Z\"\n  },\n  {\n    \"id\": 10579652,\n    \"depth\": 5,\n    \"author\": \"kevinskii\",\n    \"text\": \"Of course it&#x27;s their strategy. That doesn&#x27;t automatically mean that by obliging them the French would be helping them win.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T07:23:39.000Z\"\n  },\n  {\n    \"id\": 10579632,\n    \"depth\": 3,\n    \"author\": \"kevinskii\",\n    \"text\": \"Your ability to discern others&#x27; true emotions even as they apparently wallow in self-denial is remarkable. So perhaps you could enlighten us all further: is there any act of aggression that you believe would warrant a military response?\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T07:16:56.000Z\"\n  },\n  {\n    \"id\": 10582486,\n    \"depth\": 3,\n    \"author\": \"tptacek\",\n    \"text\": \"People say this all the time, and it&#x27;s true: our most likely military reaction to terrorist attacks probably is the basis of their strategy; they&#x27;re not stupid, the response is predictable, and so why strike at all if you don&#x27;t want a reprisal?But it doesn&#x27;t follow logically that military response is strategically bad for us! Just because ISIS wants us to do something doesn&#x27;t mean we shouldn&#x27;t do it. ISIS could be very wrong about wanting to provoke military escalation. In fact: it almost certainly is.That doesn&#x27;t mean that military strikes are good, or the right option at this point. It just means that saying that&#x27;s what ISIS wants us to do isn&#x27;t a dispositive argument.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T17:13:57.000Z\"\n  },\n  {\n    \"id\": 10579114,\n    \"depth\": 0,\n    \"author\": \"icanhackit\",\n    \"text\": \"Interesting. While skimming over the Wiki for micromorts it&#x27;s reported [1] that Ecstasy has a rating of 0.5 micromorts per tablet. Which I kind of already suspected, given how widely it&#x27;s consumed versus the rarely occurring yet widely reported deaths that result from its use.For perspective you get 1 micromort from traveling 17 miles (27 km) by foot. I&#x27;ve walked 8.91 miles (14.34 km) today, which comparatively would be as dangerous as taking an ecstasy pill...well probably not as it would scale differently. I wouldn&#x27;t be surprised if simply attending a dance-party&#x2F;rave would have a micromort rating of ~0.5, regardless of substances ingested.[1] https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Micromort#Additional\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:06:43.000Z\"\n  },\n  {\n    \"id\": 10579207,\n    \"depth\": 1,\n    \"author\": \"ekianjo\",\n    \"text\": \"These generalizations are not helpful actually. If you walk a deserted road every day it would not matter how many miles you walk every day, you should only get 0 micromort, which is not the same as walking just right next to a highway.Context is everything.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:41:21.000Z\"\n  },\n  {\n    \"id\": 10579233,\n    \"depth\": 2,\n    \"author\": \"ColinDabritz\",\n    \"text\": \"I think they are helpful. Sure, they are not especially detailed or accurate, but the point of the &#x27;micromort&#x27; is to give some broader context to the scale of the risk to aid in understanding. Much like the banana is a radiation unit. https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Banana_equivalent_doseThe Micromort is not a very precise or accurate unit, but it does a reasonable job of communicating the broad &#x27;order of magnitude&#x27; context. The disproportionate emotional response undermining rational thinking is directly countered by this frame of reference, which in turn addresses the disproportionate impacts of terrorism.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:50:54.000Z\"\n  },\n  {\n    \"id\": 10579238,\n    \"depth\": 2,\n    \"author\": \"icanhackit\",\n    \"text\": \"These generalizations are not helpful actually.Perhaps not for walking, but for an activity like taking an ecstasy pill it is.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:52:30.000Z\"\n  },\n  {\n    \"id\": 10579313,\n    \"depth\": 2,\n    \"author\": \"grecy\",\n    \"text\": \"If you walk a deserted road every day it would not matter how many miles you walk every day, you should only get 0 micromort, which is not the same as walking just right next to a highway.People who die from walking don&#x27;t only die from being hit by vehicles. There&#x27;s heart attacks, dehydration, snake bites, etc. etc.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T05:22:07.000Z\"\n  },\n  {\n    \"id\": 10579139,\n    \"depth\": 0,\n    \"author\": \"nsxwolf\",\n    \"text\": \"I don&#x27;t think I&#x27;m going to die in a terrorist attack, and yet, I&#x27;m outraged and offended by acts of terrorism. I want them prevented and I want terrorists thwarted and destroyed. I don&#x27;t think most people&#x27;s opposition to terrorism and will to defeat it comes from a personal fear of becoming a victim.Admonitions to shrug your shoulders at terrorism because car accidents kill more people always ring hollow with me.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:15:55.000Z\"\n  },\n  {\n    \"id\": 10579171,\n    \"depth\": 1,\n    \"author\": \"grandalf\",\n    \"text\": \"What is terrorism?  If two sides are fighting each other and one side has smart bombs and drones and the other side doesn&#x27;t, clearly the choice for the weaker side is to give up or to find tactics that work to break its enemy&#x27;s will.The word terrorism is a propaganda word intended to make the audience pass moral judgment on the act and ignore the larger issue of why the conflict exists in the first place.I too find acts of violence upsetting, but it&#x27;s dangerous to buy into the propaganda around the word terrorism, since it&#x27;s used to justify abandoning diplomacy and dehumanizing the enemy.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:28:15.000Z\"\n  },\n  {\n    \"id\": 10579184,\n    \"depth\": 2,\n    \"author\": \"nsxwolf\",\n    \"text\": \"Like pornography, you know it when you see it. I don&#x27;t care much for this bit of sophistry. Islamic fundamentalists or lone wolf nuts deliberately targeting innocent people works as a definition of terrorism to me. I don&#x27;t feel like I&#x27;m being manipulated by propaganda.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:34:23.000Z\"\n  },\n  {\n    \"id\": 10579202,\n    \"depth\": 2,\n    \"author\": \"ubersync\",\n    \"text\": \" I too find acts of violence upsetting, but it&#x27;s dangerous to buy into the propaganda around the word terrorism, since it&#x27;s used to justify abandoning diplomacy and dehumanizing the enemy.And it&#x27;s used to curb the rights of your own citizens.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:39:54.000Z\"\n  },\n  {\n    \"id\": 10579400,\n    \"depth\": 3,\n    \"author\": \"jqm\",\n    \"text\": \"Exactly. I haven&#x27;t figured out the true aim of terrorists. Unless it&#x27;s to give license and cause for government to do outrageous things. Which seems to cause more problems for society than the initial terrorism. So maybe that is the aim.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T05:51:45.000Z\"\n  },\n  {\n    \"id\": 10579446,\n    \"depth\": 4,\n    \"author\": \"woah\",\n    \"text\": \"Here&#x27;s one of their strategic guidebooks, &#x27;The Management of Savagery&#x2F;Chaos&#x27;[1]. They want to cause America (and Europe) to exhaust their military resources in the Middle East and cause the states there to fail. In failed states, they are able to establish a caliphate, as the strongest armed force on the ground. So far we are fulfilling their goals quite well with our useless war, and France is now going down the same path.[1] https:&#x2F;&#x2F;azelin.files.wordpress.com&#x2F;2010&#x2F;08&#x2F;abu-bakr-naji-the...\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T06:13:13.000Z\"\n  },\n  {\n    \"id\": 10579777,\n    \"depth\": 5,\n    \"author\": \"kgwgk\",\n    \"text\": \" So far we are fulfilling their goals quite well with our useless war, and France is now going down the same path.Is France fulfilling Daesh&#x27;s goals by destroying their administrative, economic and military infrastructure? What kind of action or inaction would go against Daesh&#x27;s goals in your opinion?\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T08:04:56.000Z\"\n  },\n  {\n    \"id\": 10579226,\n    \"depth\": 2,\n    \"author\": \"d23\",\n    \"text\": \"Oh hogwash.Bombing innocent people simply isn&#x27;t right and isn&#x27;t effective.  If you&#x27;re honestly sympathizing with these people or justifying their actions (which you seem one skip and jump from doing), you should at least want them to do things that are effective at getting the change they want.Then again, maybe their entire motive is to bring global sharia law and secure their place in heaven by killing as many innocent infidels as possible.  As far as I know, ISIS has made no claims that were less extreme than this.  I have no problem dehumanizing someone with that sort of motivation.  It&#x27;s barbaric; it&#x27;s monstrous.  They have made no attempt at diplomacy, and there is no chance.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:46:37.000Z\"\n  },\n  {\n    \"id\": 10579289,\n    \"depth\": 3,\n    \"author\": \"grandalf\",\n    \"text\": \"It isn&#x27;t effective?  So far in the past 15 years the terrorists have spent at most a few million dollars on their attacks, and the west has spent trillions.The amount of economic damage to the west has been profound, and yet our leaders would be happy to spend 20% of GDP indefinitely on ineffective projects attempting to thwart terrorism.So yes, terrorism works very well and often terrorist groups transition into respectable and moderate political parties.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T05:15:31.000Z\"\n  },\n  {\n    \"id\": 10579509,\n    \"depth\": 3,\n    \"author\": \"Karellen\",\n    \"text\": \"Yup, you&#x27;re entirely correct.Fortunately, We would never do anything like bombing innocent people, because We are the Good Guys, and all our actions are therefore entirely justified. Only They do things like that, because They are the Bad Guys, and Their actions are barbaric and monstrous.https:&#x2F;&#x2F;theintercept.com&#x2F;2015&#x2F;11&#x2F;06&#x2F;u-s-journalists-who-inst...\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T06:36:41.000Z\"\n  },\n  {\n    \"id\": 10579231,\n    \"depth\": 2,\n    \"author\": \"raquo\",\n    \"text\": \"Politics aside, if targeting and killing civilians indiscriminately is not terrorism, I don&#x27;t know what is.ETA: I&#x27;m talking about the Paris attacks specifically, not giving a formal definition of terrorism. If you don&#x27;t count those as terrorism, I don&#x27;t know what you would count. This semantic mumbo jumbo is ridiculous.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:50:01.000Z\"\n  },\n  {\n    \"id\": 10579247,\n    \"depth\": 3,\n    \"author\": \"rurounijones\",\n    \"text\": \"By the definition you gave above:* Bombing of Dresden: Terrorism* Nuking of Hiroshima: Terrorism* America&#x27;s Drone strikes: TerrorismContext and motive is everything. You cannot boil it down to an easily digestible soubd-byte to base your opinion on.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:56:15.000Z\"\n  },\n  {\n    \"id\": 10579283,\n    \"depth\": 4,\n    \"author\": \"grandalf\",\n    \"text\": \"Don&#x27;t forget shooting at redcoats from behind the cover of a tree during the revolutionary war.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T05:12:08.000Z\"\n  },\n  {\n    \"id\": 10579284,\n    \"depth\": 4,\n    \"author\": \"themartorana\",\n    \"text\": \"Yes you can.Hiroshima was in the midst of a full blown state vs. state war, in which the US was not the aggressor against Japan.While it is true that it was hoped the atomic bomb would be as useful psychologically as it was physically, there is no true comparison here, and this is argumentative for the sake of trying to make a point.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T05:12:44.000Z\"\n  },\n  {\n    \"id\": 10579337,\n    \"depth\": 5,\n    \"author\": \"aianus\",\n    \"text\": \" there is no true comparison hereYou&#x27;re right, the Hiroshima attack in itself was worse in terms of the death and suffering of innocents than all Islamic terrorism of the past 20 years put together.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T05:30:32.000Z\"\n  },\n  {\n    \"id\": 10581954,\n    \"depth\": 6,\n    \"author\": \"grandalf\",\n    \"text\": \"True. Ironically, it&#x27;s generally understood by Americans that this was done to break Japan&#x27;s will to continue fighting.  It worked.  Everything we do in war is to break the will of the enemy to continue.Thus unless we expect one side to nobly surrender, we ought to expect the most extreme atrocities to occur in war.When you think about it, it&#x27;s silly to draw an arbitrary distinction of humane combat, since if we really wanted to be humane we&#x27;d have our leaders compete in chess boxing or something that would minimize the destruction of property and loss of life.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T16:08:45.000Z\"\n  },\n  {\n    \"id\": 10579298,\n    \"depth\": 4,\n    \"author\": \"raquo\",\n    \"text\": \"I&#x27;m not claiming to give a formal definition of terrorism, I&#x27;m just saying that if such a definition exists it should definitely include the Paris attacks, otherwise it would be meaningless.Regardless of that, the events that you mentioned are massive, coordinated, state-level actions. I just can&#x27;t accept labeling those as terrorism without that word losing any meaning. Yes, those events are horrible, but not every horrible thing that involves killing civilians is terrorism even when if&#x27;s brutal mass murder. There are other words too, like genocide, war crimes, massacre, assassinations, etc.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T05:17:32.000Z\"\n  },\n  {\n    \"id\": 10579234,\n    \"depth\": 2,\n    \"author\": \"pugio\",\n    \"text\": \"Terrorism is psychological warfare aimed at a civilian population. It could be an expression of frustration; an act by one who doesn&#x27;t care, or cares exclusively and consumingly. And it is horrific, disgusting, and morally reprehensible.The word is not merely propaganda, it is a word whose extremity exactly conveys the revulsion and moral judgement of the speaker. As with any label, you run the risk of superficiality and preoccupation with simplified narratives, but terrorism is NOT just propaganda, and it deliberately conveys more than acts of violence. (A clinical term with its own problems of distancing audiences from the immediate reality.)I wrote this because your last sentence seemed to imply something that I&#x27;ve noticed crop up in these kinds of discussions: the (typically Western) assumption that there is legitimacy to both sides of any conflict, and that, recognizing this, a diplomatic solution can be achieved. I&#x27;ve yet to see concrete evidence that this is the case. Short of deprogramming, how do you reason with a group of people brainwashed to be fundamentally unreasonable?\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:51:12.000Z\"\n  },\n  {\n    \"id\": 10579245,\n    \"depth\": 3,\n    \"author\": \"awakeasleep\",\n    \"text\": \"Was it terrorism when the US dropped the nukes on Japan?Psychological warfare aimed at a civilian population, right? Even if you agree that it was, you have to admit that is not how the history books are writte, because we don&#x27;t use the propagana term terrorist to describe our own actions.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:55:04.000Z\"\n  },\n  {\n    \"id\": 10579260,\n    \"depth\": 4,\n    \"author\": \"bottled_poe\",\n    \"text\": \"Things have changed a bit since then. How many ISIS members adhere to the Geneva conventions?\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T05:03:50.000Z\"\n  },\n  {\n    \"id\": 10579299,\n    \"depth\": 5,\n    \"author\": \"acjohnson55\",\n    \"text\": \"Does the US?\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T05:18:21.000Z\"\n  },\n  {\n    \"id\": 10579263,\n    \"depth\": 4,\n    \"author\": \"grandalf\",\n    \"text\": \"Exactly. The drones flying over Pakistan and Afghanistan are intended to make the populations of the border regions worry constantly about being fired upon. It&#x27;s what terrorism looks like when you have an essentially unlimited budget and don&#x27;t have to resort to crude munitions like IEDs or suicide bombers.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T05:04:20.000Z\"\n  },\n  {\n    \"id\": 10579294,\n    \"depth\": 4,\n    \"author\": \"kiba\",\n    \"text\": \"Dropping nukes and bombing civilians could be construed as war crimes, and the penalty for such war crimes would probably be death.War criminals versus &#x27;terrorists&#x27;.How does that sound? Is it really a propaganda term if you&#x27;re a common war criminal who committed mass atrocity against civilians? Or a terrorist?Both side prosecuted bombing of population centers. They also both get away with it. Probably the reason why there wasn&#x27;t prosecutions in the first place because they fear the precedence that will set.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T05:16:48.000Z\"\n  },\n  {\n    \"id\": 10579258,\n    \"depth\": 3,\n    \"author\": \"grandalf\",\n    \"text\": \"The propaganda message we&#x27;re supposed to believe is that the groups doing terrorist acts are bizarrely religious and brainwashed, completely irrational, with pre-enlightenment values. I don&#x27;t think there is any evidence to support that.It&#x27;s a really bizarre amplification and dehumanization of the enemy... I realize this is a part of war propaganda, but it&#x27;s particularly distasteful because it amplifies the environment of fear the terrorists were trying to create in the first place.The goal of any tactic in war is to break the other side&#x27;s will to keep fighting.  Terrorism is an effective tactic because it can usually be carried out at convenient times and doesn&#x27;t require much logistics, sophistication or funding.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T05:02:28.000Z\"\n  },\n  {\n    \"id\": 10580261,\n    \"depth\": 2,\n    \"author\": \"ekanes\",\n    \"text\": \"Honest question: Do you think Daesh is open to diplomacy?  What course of action do you propose with them?\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T10:43:57.000Z\"\n  },\n  {\n    \"id\": 10579187,\n    \"depth\": 1,\n    \"author\": \"lkbm\",\n    \"text\": \"Opposition to terrorism is pretty broad. Insistence that we bomb entire countries or bar refugees because some of them might be terrorists seems fear-relate.I refuse to give up freedoms or deny those freedoms to innocent people out of fear of terrorists. That&#x27;s not shrugging my shoulders. That&#x27;s not succumbing to the terror that is so obviously the tool of terrorism.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:35:23.000Z\"\n  },\n  {\n    \"id\": 10579196,\n    \"depth\": 1,\n    \"author\": \"hackaflocka\",\n    \"text\": \"FWIW, the micromorts for an innocent Iraqi, when it was being bombed by the Allied forces was pretty high too.But at least Donald Trump is going to ensure that we get all the Iraqi oil. &#x2F;sarcasm\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:38:42.000Z\"\n  },\n  {\n    \"id\": 10579444,\n    \"depth\": 2,\n    \"author\": \"rory096\",\n    \"text\": \"Let&#x27;s put some actual numbers to this.Using IraqBodyCount.org&#x27;s estimate, Iraqis suffered 1.86 micromorts per day from March 2003 to present. Compare to 2.18 \\u03bcmorts&#x2F;day during the Iran-Iraq War or 29,090 \\u03bcmorts inflicted on Halabja residents in one day in 1988.Here&#x27;s a calculator, with my data in the Iraq tab:https:&#x2F;&#x2F;docs.google.com&#x2F;spreadsheets&#x2F;d&#x2F;1wH6BOoKXun-C3_WLHZr7...(n.b.: I use conservative estimates to yield higher \\u03bcmorts for the US-initiated Iraq War and lower for the other two, like 1988 populations for Iran-Iraq and 2003 populations for the US invasion&#x2F;aftermath. IBC measures only documented deaths; I used their figure for total deaths including combatants. Alternative figures are listed in the cells&#x2F;notes on the right. Feel free to plug in different values and see how things change.)\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T06:12:20.000Z\"\n  },\n  {\n    \"id\": 10579300,\n    \"depth\": 1,\n    \"author\": \"rayiner\",\n    \"text\": \"Absolutely. I don&#x27;t worry about being a victim of terrorism. And I don&#x27;t care if car accidents kill more people--the number of deaths isn&#x27;t the point. The point is that there are people fighting to drag the world back into the 7th century, and they must be stopped on all fronts.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T05:18:25.000Z\"\n  },\n  {\n    \"id\": 10579360,\n    \"depth\": 1,\n    \"author\": \"privacy101\",\n    \"text\": \"Of course killings are never good but why don&#x27;t you get rid of the cause?\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T05:38:01.000Z\"\n  },\n  {\n    \"id\": 10579514,\n    \"depth\": 1,\n    \"author\": \"ap22213\",\n    \"text\": \"On the other hand, with our population of 7.3 billion, it&#x27;s kind of amazing that we don&#x27;t see more terrorism.  Personally, it kind of makes me feel good about Humans, given all the negatives that I usually hear about them.To me, the problem with terrorism (aside from the terrorists) is that there are people willing to jump in immediately with political (or financial) agendas.  Within hours, I&#x27;d already seen comments on FB about how fewer people would have died if France had a 2nd amendment.  And, over the past few days, I&#x27;ve seen so much pro-police-state propaganda in the US media that it frankly scares me to death.No - we really don&#x27;t need more &#x27;surveillance&#x27; or more build-ups in &#x27;defense spending&#x27;.Call me &#x27;crazy&#x27;, but I really think we should be spending the trillions and trillions of dollars (which would otherwise go into the pockets of the propagandists) on our generation&#x27;s geniuses to enable them to create the technologies that makes disease, poverty, and inequality obsolete.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T06:39:20.000Z\"\n  },\n  {\n    \"id\": 10579146,\n    \"depth\": 0,\n    \"author\": \"afarrell\",\n    \"text\": \"As the husband of someone who is afraid of these sorts of things, I can tell you that this line of argument would be entirely ineffective. What would be effective? I don&#x27;t know and I wish I did.I suspect that I&#x27;m just unusually unfazed by things and fundamentally lack the ability to understand the perspective of people for whom bombings like this cause fear. This makes me sad.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:18:11.000Z\"\n  },\n  {\n    \"id\": 10579206,\n    \"depth\": 1,\n    \"author\": \"danieltillett\",\n    \"text\": \"People tend to be over concerned of risks that they feel that they have no control over. This is why the very real risk of driving a car is considered acceptable, but the much lower risk from something like a random pesticide in food is seen as much worse than the risk warrants.Someone like your wife (or husband) needs a way to feel like they are in control. This is hard to do with terrorism hence why it is effective is causing terror despite the absolute risks.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:40:51.000Z\"\n  },\n  {\n    \"id\": 10579384,\n    \"depth\": 1,\n    \"author\": \"jqm\",\n    \"text\": \"My SO is scared to death of sharks, alligators and snakes. Always on the lookout. Can hardly go out in the water. Talking on the phone and shuffling through papers while driving is nothing to be concerned with though.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T05:47:13.000Z\"\n  },\n  {\n    \"id\": 10579639,\n    \"depth\": 1,\n    \"author\": \"etrautmann\",\n    \"text\": \"That&#x27;s actually quite interesting.  I&#x27;ve never considered the possibility of genuinely being afraid of terrorists, since it seems like such a statistical impossibility, but I suppose that&#x27;s not a particularly emotional reaction.  I might feel differently if I lived in a commonly targeted city or somewhere outside the US.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T07:19:01.000Z\"\n  },\n  {\n    \"id\": 10579169,\n    \"depth\": 0,\n    \"author\": \"ekianjo\",\n    \"text\": \"That&#x27;s cute, but it is already widely known that there is way less chance to die from Terrorism than anything else. And it is a common misunderstanding that Terrorism&#x27;s goal is to generate Terror. It is not. It is a form of political action with political goals, and it has about nothing to do with how fearful you are in your daily life.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:25:36.000Z\"\n  },\n  {\n    \"id\": 10579229,\n    \"depth\": 1,\n    \"author\": \"icanhackit\",\n    \"text\": \"it is a common misunderstanding that Terrorism&#x27;s goal is to generate Terror.The common misunderstanding has allowed it to become a self-fulfilling prophesy in a way - the social media campaign from ISIS and orbiting groups has focused on using scare-campaigns to amplify the power of smaller offensives by vowing copy-cat attacks. They&#x27;ve observed the social and operational inefficiencies that come from being fearful and trying to preempt future attacks. If it was a misconception before, it&#x27;s reality now.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:48:37.000Z\"\n  },\n  {\n    \"id\": 10579239,\n    \"depth\": 1,\n    \"author\": \"epistasis\",\n    \"text\": \"FYI, beginning a dismissal with that&#x27;s cute kind makes it seem like you don&#x27;t have a strong point and are resorting to name calling.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:52:34.000Z\"\n  },\n  {\n    \"id\": 10580735,\n    \"depth\": 2,\n    \"author\": \"ekianjo\",\n    \"text\": \"I actually explained my point. Read my full comment.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T13:00:03.000Z\"\n  },\n  {\n    \"id\": 10579191,\n    \"depth\": 0,\n    \"author\": \"guelo\",\n    \"text\": \"The risk of being shot in a mass shooting in the US is way higher but everybody seems blas\\u00e9 about it.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:37:09.000Z\"\n  },\n  {\n    \"id\": 10579253,\n    \"depth\": 1,\n    \"author\": \"flubert\",\n    \"text\": \"Hmm.  9&#x2F;319e6 = 0.028 micromortshttps:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Umpqua_Community_College_shoot...https:&#x2F;&#x2F;www.google.com&#x2F;#q=population+of+the+united+states\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:59:43.000Z\"\n  },\n  {\n    \"id\": 10579244,\n    \"depth\": 0,\n    \"author\": \"DHJSH\",\n    \"text\": \"Ok then! Why aren&#x27;t we terrified about obesity, which is the leading cause of death in the United States, killing over 300,000 people a year. (See https:&#x2F;&#x2F;www.wvdhhr.org&#x2F;bph&#x2F;oehp&#x2F;obesity&#x2F;mortality.htm)\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:54:31.000Z\"\n  },\n  {\n    \"id\": 10579292,\n    \"depth\": 1,\n    \"author\": \"themodelplumber\",\n    \"text\": \"We _are_ terrified about obesity. The weight loss market in the U.S. is at roughly $60 billion.But I wonder how long a single person can remain terrified about anything, or is indeed terrified by e.g. terrorism.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T05:16:23.000Z\"\n  },\n  {\n    \"id\": 10579329,\n    \"depth\": 2,\n    \"author\": \"aianus\",\n    \"text\": \" We _are_ terrified about obesity. The weight loss market in the U.S. is at roughly $60 billion.That&#x27;s:a) an order of magnitude less than U.S. defense spending\\nb) not funded by taxpayers\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T05:27:27.000Z\"\n  },\n  {\n    \"id\": 10581316,\n    \"depth\": 3,\n    \"author\": \"DHJSH\",\n    \"text\": \"People really didn&#x27;t like my Obesity comment! The number one killer has a personal responsibility component and the techno-libertarians here object. Go figure... We live in an upside-down world where good is bad and right is wrong.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T14:45:24.000Z\"\n  },\n  {\n    \"id\": 10579249,\n    \"depth\": 0,\n    \"author\": \"hackaflocka\",\n    \"text\": \"For the longest time, there has been Kashmir-related terrorism all over India, sponsored by Pakistan (which received aid in the form of money and arms from the US for decades prior to 9&#x2F;11).So, yes, terrorism is indeed very, very bad.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T04:56:33.000Z\"\n  },\n  {\n    \"id\": 10579264,\n    \"depth\": 0,\n    \"author\": \"arithma\",\n    \"text\": \"Doesn&#x27;t this, if effective, encourage terrorists to up their game as well till enough micromorts register on our radars?\\nTerrorists can skew things: they have raised the chance of death in an attack when you are participating in things they don&#x27;t approve of (death to all the party goers.) This must be seen as an attack on society, rather than individuals.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T05:04:22.000Z\"\n  },\n  {\n    \"id\": 10579271,\n    \"depth\": 0,\n    \"author\": \"poof131\",\n    \"text\": \"The problem is terrorism isn\\u2019t like car accidents.  In another thread somebody commented that more people die on the roads in a single day then died in the terrorist attacks in France.  Sure.  But the volatility in car accident statistics is tiny while the possible volatility in terrorist attacks is huge.  One well executed attack could kill hundreds of thousands or possibly millions if nuclear, chemical, or biological weapons are used.  Car accidents are a bell curve, while terrorism is the long tail.  And while I\\u2019m not really afraid of a terrorist attack, underestimating or dismissing a large group of people trying to actively kill you is naive.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T05:08:08.000Z\"\n  },\n  {\n    \"id\": 10579335,\n    \"depth\": 0,\n    \"author\": \"rayiner\",\n    \"text\": \"By the reasoning of the article, we should just shrug off murders because people are far more likely to die in a car accident. That is of course ridiculous. Terrorism is an attack on the social order. That precious stability that makes progress and liberal society possible.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T05:30:11.000Z\"\n  },\n  {\n    \"id\": 10579773,\n    \"depth\": 1,\n    \"author\": \"Confusion\",\n    \"text\": \"No, by the reasoning of the article you should not respond to murder by starting to fear being murdered, as the odds of being murdered are quite small.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T08:04:24.000Z\"\n  },\n  {\n    \"id\": 10579367,\n    \"depth\": 0,\n    \"author\": \"douche\",\n    \"text\": \"To be perfectly honest, I&#x27;m a little amazed that in the past fourteen years, there have been so very few terrorist attacks on US soil.Any group of suicidal, minimally-trained jackasses with a couple thousand dollars, access to Craigslist or an Uncle Henry&#x27;s, and the ability to go to a WalMart, could obtain enough weaponry and ammunition to stage a significant attack on the scale of what happened in Paris this week.I have to conclude that the pool of such people that would be willing to commit such acts is vanishingly small.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T05:42:32.000Z\"\n  },\n  {\n    \"id\": 10579495,\n    \"depth\": 1,\n    \"author\": \"fouric\",\n    \"text\": \"It is also possible that the United States&#x27; security agencies are simply better than the vast majority of us are aware of. Or some combination of both.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T06:32:58.000Z\"\n  },\n  {\n    \"id\": 10580052,\n    \"depth\": 2,\n    \"author\": \"richmarr\",\n    \"text\": \"Possible, yes.But it&#x27;s a fact that we&#x27;re terrible at evaluating how likely&#x2F;dangerous terrorism is. We percieve far more risk than there actually is.Terrorism is designed to play to our cognitive biases, as is the news, as is politics. A triumvirate of douchegoblins taking advantage of our inability to correctly assess risk.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T09:40:01.000Z\"\n  },\n  {\n    \"id\": 10579722,\n    \"depth\": 1,\n    \"author\": \"kbart\",\n    \"text\": \"Exactly. Our infrastructure is so vulnerable, that I can think of multiple ways to disrupt daily routine and kill multiple people even without a gun, let alone suicide bombing -- dismantle&#x2F;block the rails, drop an obstacle on a busy highway, poison the drinking water, cut electric wires open, sabotage industrial&#x2F;power plants, set buildings on fire etc. heck, even shouting out loud he&#x27;s got a gun, run!! in a crowded space could result in multiple injuries&#x2F;deaths. \\nIf there were so many determined terrorists on our soil as various governments and agencies want us to believe, they would cause a significant damage, not just stage occasional attacks that are statistically insignificant. The smallest dog barks the loudest.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T07:51:20.000Z\"\n  },\n  {\n    \"id\": 10581870,\n    \"depth\": 1,\n    \"author\": \"Eric_WVGG\",\n    \"text\": \"I have heard that one of al Qaeda\\u2019s biggest problems was attrition of \\u201cinfiltrators\\u201d to the American way of life. The example I heard was truck-drivers, once they got real jobs and were welcomed into western mosques they assimilated fast. Thus the 9&#x2F;11 hijackers were ordered to quarantine themselves in their hotel rooms until the actual event\\u2026(I have no idea of the veracity of this story; it sounds a little trite, but compelling like so many trite things)\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T15:57:46.000Z\"\n  },\n  {\n    \"id\": 10584278,\n    \"depth\": 1,\n    \"author\": \"rootlocus\",\n    \"text\": \"According to a few articles, the pool of people willing to take on suicide missions is too damn high: http:&#x2F;&#x2F;www.dailymail.co.uk&#x2F;news&#x2F;article-3092635&#x2F;ISIS-fighter... (although it doesn&#x27;t talk specifically about US)\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T21:57:54.000Z\"\n  },\n  {\n    \"id\": 10579425,\n    \"depth\": 0,\n    \"author\": \"ooOOoo\",\n    \"text\": \"Schneier called micromort a great concept (https:&#x2F;&#x2F;www.schneier.com&#x2F;blog&#x2F;archives&#x2F;2012&#x2F;11&#x2F;micromorts_1....).There&#x27;s a related term, microlife, for things that reduce your lifespan. A microlife is 30 minutes off your life expectancy. So smoking two cigarettes has a cost of one microlife.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T06:04:35.000Z\"\n  },\n  {\n    \"id\": 10579464,\n    \"depth\": 0,\n    \"author\": \"ap22213\",\n    \"text\": \"These are great!  Can&#x27;t believe that I didn&#x27;t know about them before - I&#x27;ve been looking for simple metrics that compare the impact of things on mortality.It&#x27;s interesting that running one marathon per year is almost equivalent to being murdered in England.\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T06:21:17.000Z\"\n  },\n  {\n    \"id\": 10579638,\n    \"depth\": 0,\n    \"author\": \"idibidiart\",\n    \"text\": \"The other day I read that someone has been purchasing bomb grade uranium from a source (or a chain of people) who have been traced back to a Russian General in charge of a nuclear weapons facility. I think I might have heard about it first via HN, but not entirely sure now. Anyway, it terrifies me to remember that there are people in the world who have known nothing of life&#x27;s bright side and who were most likely psychologically damaged as kids living in the constant war zone of the middle east. Those who rise above it are usually brilliant people regardless of occupation and those who succumb to the darkness are the ones I worry about... They could feel a darkness so vast and so abysmal that the idea of stabbing the beast where it hurts (killing the civilians of nations that are partly responsible for what happened to them) is the only relief they have in a life where they&#x27;ve gotten no relief; only absolute terror and infinite trauma.What could we do to identify such people and help change the course of human history?\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T07:18:09.000Z\"\n  },\n  {\n    \"id\": 10580238,\n    \"depth\": 0,\n    \"author\": \"hokkos\",\n    \"text\": \"This is stupid, Black Swan event can&#x27;t be dealt with classic probabilities. Terrorism doesn&#x27;t follow a normal distribution, more like a Dirac distribution.The simple averaging you used, I can use it to, but I am not only French, I am also living in Paris. Last year there have been 39 deaths from car accidents, 101 from homicides, and more than 147 from terrorist relative death an counting every few months in Paris.I can also look at my age, and that I go to concert often then my micromort explode to the roof now.You seems like the old ladys in the Terry Gilliam film Brazil.https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=U4KFNhxibec\",\n    \"points\": null,\n    \"created_at\": \"2015-11-17T10:36:37.000Z\"\n  }\n]"
}