{
  "meta.json": "{\n  \"rank\": 9,\n  \"title\": \"The Cannons on the B-29 Bomber\",\n  \"url\": \"http://www.popularmechanics.com/military/weapons/a18343/the-cannons-on-the-b-29-bomber-were-a-mid-century-engineering-masterpiece/\",\n  \"hn_url\": \"https://news.ycombinator.com/item?id=10654216\",\n  \"points\": 234,\n  \"author\": \"seer\",\n  \"comment_count\": 90\n}",
  "article.txt": "How the B-29 Modernized the U.S. Air Force | B-29 History Search Newsletter Pop Mech Pro Subscribe Home and DIY Power Tools Cars Technology Military Science Adventure Sci-Fi Airplanes Space Gifts Deals Visual Stories Promotions Shop Follow My Bookmarks Your Privacy Choices Privacy Notice Terms Of Use Skip to Content sign in Subscribe Search sign in Subscribe Science Home &amp; DIY Technology Gear Reviews Military Transportation Culture &amp; Curiosities About My Bookmarks Newsletter Your Privacy Choices Privacy Notice Terms Of Use sign in Subscribe Science Home &amp; DIY Technology Gear Reviews Military Transportation Culture &amp; Curiosities About More Military Military Aviation How the B-29 Modernized the U.S. Air Force How the B-29 Modernized the U.S. Air Force The bomber that ended WWII also paved the way for a more modern U.S. Air Force. By Alex Hollings Updated: Oct 21, 2022 3:46 PM EDT Listen (19 min) 19 min On February 18, 1943, with World War II raging in Europe and Asia, a hulking structure rolled onto the tarmac of Boeing Field, about five miles south of Seattle’s city center. Veteran Boeing test pilot Edmond T. “Eddie” Allen, joined by 10 technicians and engineers, was chosen for the test flight. They stood aboard the XB-29, one of only two experimental prototypes of an all-new bomber designed to punish the Axis powers. It was the most technologically advanced aircraft in the world, and its existence was strictly classified. But joining so many different envelope-pushing technologies to a single airframe came with some serious risk, and it was a risk that would unfold in horror after only 20 minutes into the flight. Our First Ride...In 1944 Meet the B-29! Allen radioed the tower, indicating an engine fire had started and he’d have to return immediately to land. The first blaze was quickly extinguished, but then a second started, and soon, the hulking giant was losing altitude too quickly to manage. Two crew members leapt from the burning plane as it only barely managed to avoid colliding with Seattle’s downtown skyscrapers. Their chutes didn’t open in time to save either of their lives. The bomber eventually collided with Seattle’s Frye and Company meatpacking plant, killing all on board as well as 19 more inside the building. The aircraft, and the nature of the crash, were made classified . While newspapers did report on the crash, none ran any photos or discussed the type of aircraft involved. U.S. Air Force The XB-29, the first Superfortress ever built. “The B-29 was a groundbreaking program, and like any such program, you want to try to hide the design and development stage as much as possible from your adversaries,” Shawn M. Bohannon, command historian for the U.S. Air Force Global Strike Command tells Popular Mechanics . “Even once the aircraft was rolled out, there was still a level of secrecy involved with its different components.” The crash was a massive setback for a program that could not afford to fail. But despite the tragic test flight and ongoing production struggles—blame resource shortages and an unskilled workforce— President Franklin D. Roosevelt still pledged to base at least 175 B-29s in China, within striking distance of Japan, in a year’s time. The U.S. government had already placed an order for 1,500 of the new bombers, but when Roosevelt made that promise, fewer than 15 were airworthy. The race for the bomber of the future was on, and its legacy would be lasting. “Quite simply, the B-29 was the gateway aircraft to the modern United States Air Force,” Bohannon says. “It laid the groundwork for all future strategic aircraft in the U.S. Air Force inventory.” The Battle of Kansas FPG // Getty Images The front lines of World War II were in Europe and the Pacific, but Kansas was its own kind of battleground as engineers and assembly workers fought against terrible weather and repeated delays in production of the B-29. With development and production happening more or less simultaneously, technical problems plagued the effort. By some estimates, each of the major features introduced on the B-29 would normally have seen up to five years of testing under normal circumstances. Instead, factory workers without any aviation experience were tasked with assembling the massive bomber and modifying parts they didn’t understand in order to piece together the disparate new technologies. The B-29 would be the first pressurized and soundproofed bomber cabin, allowing the crew to fly comfortably and communicate without the need for large headsets . “They were incredibly innovative in how they decided to pressurize the aircraft, which led to incredible crew comfort,” says Bohannon. While comfort may not sound like something you really need in a bomber, it can have a direct effect on crew capability and overall wartime strategy, he says. “Quite simply, the B-29 was the gateway aircraft to the modern United States Air Force.” “Look at how incredible crew fatigue could be on a B-17 bomber, say, in Europe,” Bohannon says. “You’re exposed to the elements at above 20,000 feet and you’re having to be on oxygen bottles and wearing heavy winter flight gear. It’s not only about how nerve-wracking it can be in combat, but just the fatigue these crews experienced. You didn’t have that in the B-29, and that, in itself, lent to the range of the bomber.” The bomber was designed to be an answer to the Army Air Corps’ request for a “hemisphere defense weapon,” meaning it needed exceptional range. The B-29 had been initially intended for the European front, but it soon became clear that it would be fighting mostly in the Pacific , making range an increasingly essential part of its design. It also had to be able to manage the massive weight of burgeoning new weapons systems, all while offering precision strike capability from high altitudes. At the time, only one engine could handle the job: the 2,200-horsepower Wright R-3350. But prior to the purchase of the engine for the B-29, Curtiss-Wright had slowed development of it in favor of other, better-selling power plants. That meant the engines were installed in B-29 airframes without sufficient testing. Bettmann // Getty Images A cutaway of the B-29, approved by the War Department in 1945. In order to meet the seemingly impossible demand for new bombers, a massive hiring and training enterprise—coupled with efforts aimed at simplifying production—revolutionized aircraft manufacturing. Using a workforce that had largely never even touched an airplane at the time, Boeing managed to shrink the per-bomber build time from 150,000 hours to just 20,000. By the end of the war, Boeing’s plant in Wichita would produce 4.2 B-29 Superfortresses per day . Nonetheless, most bombers that rolled off the assembly line weren’t ready for combat, and had to fly directly to over-taxed modification centers where space was so limited that many of the planes were modified and repaired outdoors in the punishing Kansas winter. “I was appalled,” Gen. Henry H. “Hap” Arnold, the aviation pioneer and general officer tasked with meeting the country’s bomber needs, recalled . “There were shortages in all kinds and classes of equipment. The engines were not fitted with the latest gadgets; the planes were not ready to go.” Ultimately, despite the gargantuan effort, setbacks made Roosevelt’s 175-plane promise impossible. But by May 1944, 130 B-29s had made the 11,500-mile voyage to their new air strips in India and China. Ready or not, the B-29 was headed to war. Even though he didn’t quite meet his production goal, Arnold’s successes were significant, and before the end of the year, President Roosevelt would promote Arnold to five-star general, making him the only such general in all of Air Force history. Right Tech, Wrong Strategy Bettmann The B-29 was undoubtedly the most advanced bomber ever built at the time, with innovations like a longer, more narrow wing equipped with large flaps that allowed the Superfortress to cruise at high altitude without compromising its ability to manage lower speeds during takeoff and landing. The pressurized and temperature-controlled fuselage left many aircrews feeling like they were flying the “Cadillac” of aircraft, aviators would say over the years, and Boeing’s five remote-controlled weapons systems meant gunners could engage enemy fighters while tucked away inside the aircraft, rather than in exposed gun positions. The turrets included a pair of .50-caliber machine guns above and behind the cockpit, an aft turret near the vertical tail, and two more beneath the fuselage. In an astonishing technological feat for the 1940s, the gunners could aim using computerized sights, and each of them could control any of the aircraft’s turrets from their seated positions inside the fuselage. The B-29 also came equipped with two radar systems. The first was either an AN/APQ-13 or AN/APQ-7 Eagle radar system (depending on mission set) that was used to aid in precision targeting. Each of these systems were accurate enough to allow crews to put bombs on target through cloud cover too thick to see through, which was a significant improvement over line-of-sight bombing operations in older aircraft. A second AN/APG-15B airborne radar gun sighting system was added to help the gunners accurately target enemy fighters as well. PhotoQuest In June 1944, less than two years after the first XB-29 ever took to the skies, the U.S. Army Air Force took the bomber into combat for the first time. But the showing was poor, partly because no one had taken the strong winds that can be found at various altitudes (now known as jet streams) into account. The mission called for 100 B-29s to depart airstrips in India and fly toward targets in Bangkok, Thailand, but only 80 of them successfully made the journey. Once they were over their targets, the 80 bombers produced only meager results. “The B-29 was designed from the outset with an almost 32,000-foot service ceiling, so it was designed to be a high-altitude bomber,” Bohannon says. “Then they found out that it was not particularly effective at those high altitudes over Japan, due to generally poor weather and, of course, the jet streams that nobody knew about yet at that time. Winds of over 150 to 200 miles per hour would make high-altitude precision bombing accuracy impossible.” Soon, Marines fighting a brutal island-hopping campaign in the Pacific had captured air strips in places like Guam and the Mariana Islands chain, placing B-29s within striking distance of the southern tip of mainland Japan. But once again, the high-altitude precision bombing strikes weren’t nearly as effective as intended. Even worse, the bombers were struggling with continued technical issues, brought about by keeping such a massive bomber aloft at such high altitudes. “Sometimes we had enemy fighters over, around, and under us, shooting at us,” Wallace Van Eaton, a pilot that flew 23 combat missions as a B-29 co-pilot, recounted from the cockpit of his restored bomber in 2017. “I saw a lot of planes shot down. We just kept going and had to put our trust in the Lord ... and I’m still here.” It soon became clear that the advanced bombing computers weren’t quite advanced enough for high-altitude runs. Because of cloud cover, bomber crews could rarely see their targets visually, forcing them to rely on their radar and computer systems that weren’t capable of compensating for the powerful high-altitude winds. The Superfortress had more technology packed into its fuselage than any aircraft before it, but the strategy failed to capitalize on the bomber’s strengths, and it was beginning to make the $3 billion effort seem like a failure. Coming Down From the Clouds Major General Curtis E. LeMay had made a name for himself as the commander of the 3rd Bombardment Division, fighting in the European theater with the B-29’s predecessor, the B-17. By July 1945, with victory over Nazi Germany all but assured, the general would try to turn things around for the B-29 bombing efforts in the Pacific. Upon taking over the 20th Bomber Command, LeMay took a look at the high-altitude precision strike playbook, and promptly discarded it as a poor way to leverage the new B-29. LeMay went on to develop new bomber tactics that would take the B-29s out of the clouds and send them screaming in over Japanese cities at low levels, relying on incendiary bombs to destroy Japan’s industrial complex. U.S. Air Force Example of leaflets dropped on Japan warning of B-29 bombings. U.S. Air Force “He effectively took the B-29, which was designed to be a high-altitude bomber, and scrapped that entire idea in favor of low-level bombing at 5,000 to 7000 feet. And it proved to be an incredibly effective low-level aircraft even though it was never designed with that in mind,” Bohannon says. After setbacks and disappointments riddling the design, production, and even bombing operations of the B-29, the plane finally found its footing using LeMay’s new low-level tactics. Concerns that the massively expensive bomber was a failure all but vanished as the aircraft proceeded to deliver firebombing raids to Japan. In a raid on March 9, 1945, 334 B-29 bombers took off from new airstrips in the Mariana Islands bound for Tokyo and, in the span of just a few hours, dropped 1,667 tons of napalm-filled incendiary bombs on the Japanese capital. That raid remains the single deadliest bombing operation ever. Universal History Archive // Getty Images The Enola Gay, the B-29 that dropped the atomic bomb on Hiroshima. But the B-29’s most infamous moment would arrive on August 6, 1945. From the cockpit of the “Enola Gay,” a B-29 named after the pilot’s mother, Paul Tibbets dropped the first ever atomic bomb used in combat operations over Hiroshima. “The nose lurched up—I mean it lurched dramatically—because if you immediately let 10,000 pounds out of the front, the nose has got to fly up,” Tibbets told Bob Greene on NPR’s Morning Edition during an August 2000 interview. “We made our turn, we leveled out, and at the time that that happened I saw the sky in front of me light up brilliantly with all kinds of colors.” “At the same time,” Tibbets continued, “I felt the taste of lead in my mouth. And where we had seen the city on the way in, I (now) saw nothing but a bunch of boiling debris with fire and smoke and all of that kind of stuff. It was devastating to take a look at it.” The 10,000-pound weapon was unlike anything the world had seen before, killing an estimated 70,000 to 100,000 people in a single blast. A few days later, on August 9, another atom bomb would be dropped from the bay of another B-29. Soon thereafter, the Japanese surrendered, bringing World War II to a close. Gateway to Modernity Thomas Vogt // Wikimedia Commons A Soviet Tu-4, reverse engineered from three captured B-29 bombers during WWII.",
  "comments.json": "[\n  {\n    \"id\": 10662692,\n    \"author\": \"rangibaby\",\n    \"text\": \"Linkbait title. They built something complex, but who knows if it was good or not?\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T13:08:53.000Z\",\n    \"children\": [\n      {\n        \"id\": 10662752,\n        \"author\": \"Kurtz79\",\n        \"text\": \"&quot;\\u200bIt was a plane so advanced, we wrote in June 1945 about how one crew fought off  79 fighter planes, downing 7 of them, during a bombing run on Kyushu, Japan. Its weapons platform was so dominant that fighter escorts were no longer strictly necessary\\u2014as Major General Curtis LeMay put it simply: &quot;These big boys can take care of themselves.&quot;\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T13:20:18.000Z\",\n        \"children\": [\n          {\n            \"id\": 10662893,\n            \"author\": \"rangibaby\",\n            \"text\": \"Remember that the war was basically over at that point, and they were fighting against an enemy starved of resources and experienced manpower, particularly pilots (cf. kamikaze tactics).The &quot;79 fighter planes&quot; claim doesn&#x27;t pass the sniff test to me either. Remember that two months after this, the Japanese didn&#x27;t even bother sending fighters to even try to intercept the planes that bombed Hiroshima (for example).I&#x27;m not saying that the claim is definitely false, but I wouldn&#x27;t take anything written in the press during the actual war at face value.\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T13:53:48.000Z\",\n            \"children\": [\n              {\n                \"id\": 10663061,\n                \"author\": \"hydrogen18\",\n                \"text\": \"I always figured the Japanese assumed the plane in the case of Hiroshima was a reconnaissance plane gathered ground photographs and checking on the weather. As you correctly noted, they didn&#x27;t have many resources. I&#x27;d figure a lone reconnaissance plane would rank pretty low on the list of targets they were trying to intercept.\",\n                \"points\": null,\n                \"created_at\": \"2015-12-02T14:25:25.000Z\",\n                \"children\": [\n                  {\n                    \"id\": 10663157,\n                    \"author\": \"Raphmedia\",\n                    \"text\": \"Even a lone bomber plane would not have been that much of a threat at this point. Bomb the weapon factories, the war is over. If they had known what was coming they would have deployed a lot more and evacuated the civilians.We all know what happened instead.\",\n                    \"points\": null,\n                    \"created_at\": \"2015-12-02T14:41:07.000Z\",\n                    \"children\": []\n                  },\n                  {\n                    \"id\": 10663661,\n                    \"author\": \"LordKano\",\n                    \"text\": \"That&#x27;s a common interpretation of the Japanese reaction. I admit to a limited amount of knowledge on this subject but I have never seen anything that contradicts that view.\",\n                    \"points\": null,\n                    \"created_at\": \"2015-12-02T15:55:24.000Z\",\n                    \"children\": []\n                  }\n                ]\n              },\n              {\n                \"id\": 10663454,\n                \"author\": \"jessaustin\",\n                \"text\": \"The &quot;79 fighter planes&quot; claim doesn&#x27;t pass the sniff test to me either. Remember that two months after this, the Japanese didn&#x27;t even bother sending fighters to even try to intercept the planes that bombed Hiroshima (for example).The first proposition is a reasonable explanation for the second. If you&#x27;re not willing to lose 79 fighters, then don&#x27;t engage a B-29.\",\n                \"points\": null,\n                \"created_at\": \"2015-12-02T15:24:42.000Z\",\n                \"children\": []\n              }\n            ]\n          },\n          {\n            \"id\": 10663030,\n            \"author\": \"Blackthorn\",\n            \"text\": \"Honestly that sounds like bullshit to me. See the Clash of Wings documentary, episode 11, for more about the bombing of Japan with the B-29.\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T14:20:10.000Z\",\n            \"children\": [\n              {\n                \"id\": 10663074,\n                \"author\": \"dandare\",\n                \"text\": \"Summary please?\",\n                \"points\": null,\n                \"created_at\": \"2015-12-02T14:27:30.000Z\",\n                \"children\": [\n                  {\n                    \"id\": 10663228,\n                    \"author\": \"Blackthorn\",\n                    \"text\": \"Few different points made in that episode, some relevant to this discussion some not and some I&#x27;m not remembering.1) The B-29s had god-awful bombing accuracy in their original mission (high altitude level bombing) because of the as-of-yet-undiscovered jet stream over Japan. So when they flew too high and fast to be intercepted, they were basically useless when it came to doing damage.2) This was already in the Kamikaze era of the war, and many B-29s were lost to that.Anyway, I&#x27;m not going to rewatch the whole 45-minute long episode again. I found some stats that listed a total of 74 lost from fighters, but I&#x27;m hesitant to post because I can&#x27;t dig up the original source (it 404s now). Will if you so desire. The number lost due to weather, mechanical failure, etc., dwarf the number lost to fighters by a huge factor but it does make the original quote here sound like some amount of propaganda bullshit.\",\n                    \"points\": null,\n                    \"created_at\": \"2015-12-02T14:51:40.000Z\",\n                    \"children\": [\n                      {\n                        \"id\": 10663752,\n                        \"author\": \"RockyMcNuts\",\n                        \"text\": \"The engines initially had a habit of catching fire and burning the wings off. http:&#x2F;&#x2F;www.fighter-planes.com&#x2F;info&#x2F;b29.htm (search for magnesium)\",\n                        \"points\": null,\n                        \"created_at\": \"2015-12-02T16:07:31.000Z\",\n                        \"children\": [\n                          {\n                            \"id\": 10666059,\n                            \"author\": \"dceddia\",\n                            \"text\": \"Nearly as bad as if the front fell off! (https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=3m5qxZm_JqM)\",\n                            \"points\": null,\n                            \"created_at\": \"2015-12-02T21:43:43.000Z\",\n                            \"children\": []\n                          }\n                        ]\n                      }\n                    ]\n                  }\n                ]\n              }\n            ]\n          },\n          {\n            \"id\": 10663768,\n            \"author\": \"Tloewald\",\n            \"text\": \"http:&#x2F;&#x2F;www.historylink.org&#x2F;index.cfm?DisplayPage=output.cfm&amp;...There&#x27;s a recorded instance of a B29 shooting down 14 fighters over Tokyo (it was also rammed by two fighters and still made it home). There are also instances of B29s downing MiGs over Korea.The late model B17s were pretty effective too. An old Strategy &amp; Tactics magazine quoted stats for two different air forces (recall it was the &quot;US Army Air Corps&quot; and &quot;Air Forces&quot; were simply an organizational unit) operating out of Britain over a two year period in WWII, one was bombers and the other fighters. Both shot down roughtly the same number of planes -- but the bombers used 100x as much ammunition. (Sorry, this is a 1970s print publication, no link, just my memory.)Also recall that the Japanese lost almost all their trained pilots early in the war, so the B29 was using a far superior weapon system against very inexperienced pilots.\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T16:09:55.000Z\",\n            \"children\": [\n              {\n                \"id\": 10665339,\n                \"author\": \"Pinckney\",\n                \"text\": \"Kill claims are notoriously overestimated during this period, frequently by ratios of 5:1 or more. The only reliable way to estimate kills is to look at enemy records and see how many aircraft were recorded as lost during a given period.Take a look at some of the entries here; April 17th stands out.https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Confirmation_and_overclaiming_...&quot;the 91st and 306th Bomb Groups claimed 63 German fighters destroyed, plus 15 probable and 17 damaged. Only two were confirmed destroyed, with nine damaged.&quot;\",\n                \"points\": null,\n                \"created_at\": \"2015-12-02T19:49:24.000Z\",\n                \"children\": []\n              }\n            ]\n          }\n        ]\n      }\n    ]\n  },\n  {\n    \"id\": 10662733,\n    \"author\": \"alricb\",\n    \"text\": \"They&#x27;re talking about M2 .50 heavy machine guns; the B-29 didn&#x27;t have what are considered &quot;cannons&quot; (usually 20 mm or more).For the most part, defensive guns on bombers weren&#x27;t all that useful; even with a fire-control computer aiding you, it&#x27;s very hard to hit a (possibly maneuvering) moving plane from another moving plane. It would probably have been better to omit those heavy guns and turrets and to leave those gunners on the ground to save weight, lives, and resources.\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T13:17:25.000Z\",\n    \"children\": [\n      {\n        \"id\": 10662751,\n        \"author\": \"cstross\",\n        \"text\": \"Later on, they did exactly that: from about February onwards, Curtis LeMay had the guns and turrets stripped out of the force bombing Japan -- except for the tail position -- to save weight&#x2F;increase range, speed, and bomb load. Operational consequences:https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Bombing_of_Tokyo\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T13:20:01.000Z\",\n        \"children\": []\n      },\n      {\n        \"id\": 10662764,\n        \"author\": \"ckozlowski\",\n        \"text\": \"Repeated on the B-36 as well.\\nhttp:&#x2F;&#x2F;www.airvectors.net&#x2F;avb36.html\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T13:22:36.000Z\",\n        \"children\": []\n      },\n      {\n        \"id\": 10662812,\n        \"author\": \"gaius\",\n        \"text\": \"It would probably have been better to omit those heavy guns and turrets and to leave those gunners on the ground to save weight, lives, and resourcesThat is exactly what Freeman Dyson said of the Lancaster bomber.Tho&#x27; no sooner had the belly turret been removed than the Luftwaffe invented upward-firing guns, they would slip into position directly under, matching speed and heading, then just let rip.\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T13:35:19.000Z\",\n        \"children\": [\n          {\n            \"id\": 10662884,\n            \"author\": \"arethuza\",\n            \"text\": \"Upward firing weapons were actually used in a number of fighters - originally in WW1 for attacking zeppelins:https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Schr%C3%A4ge_Musik\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T13:52:40.000Z\",\n            \"children\": [\n              {\n                \"id\": 10663366,\n                \"author\": \"mrec\",\n                \"text\": \"Don&#x27;t forget the Defiant, a WW2 fighter whose only armament consisted of a rearward-facing turret.https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Boulton_Paul_Defiant\",\n                \"points\": null,\n                \"created_at\": \"2015-12-02T15:11:26.000Z\",\n                \"children\": []\n              },\n              {\n                \"id\": 10664090,\n                \"author\": \"Theodores\",\n                \"text\": \"The Schr\\u00e4ge Musik approach is also &#x27;Keep It Simple&#x27; in contrast to the American over-complicate-it approach.That term is also interesting as they considered jazz music to be &#x27;queer&#x27;.Ultimately though it was fuel that mattered. When the USA joined the war half way through it meant that Allied planes were on 100 octane petrol, meanwhile the Germans were using some glorified coal slurry and the Japanese were using some tree bark extract made by school kids.\",\n                \"points\": null,\n                \"created_at\": \"2015-12-02T16:56:31.000Z\",\n                \"children\": []\n              }\n            ]\n          }\n        ]\n      },\n      {\n        \"id\": 10663011,\n        \"author\": \"hydrogen18\",\n        \"text\": \"The guns on a bomber were never really meant for engaging aircraft. They&#x27;re meant to deter fighters from ever getting near the bomber. Not many pilots are willing to sit directly in the path of machine gun fire, even if it is not very accurate. German anti-aircraft figured this out as well. They switched to shooting mostly tracer rounds. You aren&#x27;t going to hit anything in the first place, so you might as well just scare the crap out of them.There were some WWII &#x27;gunship&#x27; style modifications of planes, but that was not that common.For a more modern comparison, consider that the Bradley fighting vehicle carries anti tank missiles. Sending a group of Bradleys directly against tanks would be suicidal. The Bradley has aluminum for armor. A well trained set of tank crews operating even WWII vintage vehicles would decimate them. Instead, the misiles are there to deter tanks from engaging them. It also provides the crew with an enormous psychological benefit. That benefit is they at least have the benefit of being able to respond to an enemy tank with a potentially lethal weapons system. Ironically of course the TOW missiles on the Bradley destroyed more Iraqi tanks the M1 tank ever did in the Gulf war. But that is because Iraqi tank crews either had no experience or had armored vehicles in horrible condition.\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T14:16:56.000Z\",\n        \"children\": [\n          {\n            \"id\": 10663570,\n            \"author\": \"LordKano\",\n            \"text\": \"It&#x27;s kind of an interesting story how the military didn&#x27;t really want the Bradley in the first place but it was forced upon them by congress and they had to find a use for it.I have a relative who was in the mechanized infantry back in the early 1990s. From what he was able to share with me, the Bradley was an interesting vehicle with a lot of cool stuff but if my life was on the line, I&#x27;d prefer to be in an M1 Abrams.\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T15:41:38.000Z\",\n            \"children\": [\n              {\n                \"id\": 10663692,\n                \"author\": \"greggyb\",\n                \"text\": \"There is a pretty good movie &quot;Pentagon Wars&quot; about the development of the Bradley.[0] It&#x27;s not entirely accurate, but even as complete fiction would be an enjoyable satire.[0] https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;The_Pentagon_Wars\",\n                \"points\": null,\n                \"created_at\": \"2015-12-02T15:58:41.000Z\",\n                \"children\": [\n                  {\n                    \"id\": 10664809,\n                    \"author\": \"hydrogen18\",\n                    \"text\": \"The movie is good, but the book is excellent.\",\n                    \"points\": null,\n                    \"created_at\": \"2015-12-02T18:30:31.000Z\",\n                    \"children\": []\n                  }\n                ]\n              },\n              {\n                \"id\": 10663705,\n                \"author\": \"Tloewald\",\n                \"text\": \"If my life were on the line I&#x27;d prefer not to be in combat, but if you&#x27;re infantry, riding around in an Abrams isn&#x27;t an option. It&#x27;s like saying you&#x27;d prefer to be in a frigate.\",\n                \"points\": null,\n                \"created_at\": \"2015-12-02T16:00:21.000Z\",\n                \"children\": [\n                  {\n                    \"id\": 10663815,\n                    \"author\": \"RogtamBar\",\n                    \"text\": \"Some militaries use infantry transport vehicles developed from tanks. For example:https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Namer\",\n                    \"points\": null,\n                    \"created_at\": \"2015-12-02T16:16:17.000Z\",\n                    \"children\": [\n                      {\n                        \"id\": 10664595,\n                        \"author\": \"gherkin0\",\n                        \"text\": \"Though, IIRC, the tank that&#x27;s based off of was already designed to carry some passengers.https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Merkava#Specifications_of_mode...\",\n                        \"points\": null,\n                        \"created_at\": \"2015-12-02T18:00:52.000Z\",\n                        \"children\": []\n                      },\n                      {\n                        \"id\": 10664646,\n                        \"author\": \"xixi77\",\n                        \"text\": \"It&#x27;s a pretty cool vehicle, but with the $3MM price tag I&#x27;m not sure how suitable it is for an infantry carrier... But I agree, this type of vehicles are surely going to get more common.\",\n                        \"points\": null,\n                        \"created_at\": \"2015-12-02T18:08:26.000Z\",\n                        \"children\": [\n                          {\n                            \"id\": 10665518,\n                            \"author\": \"douche\",\n                            \"text\": \"According to Wikipedia[1], the Bradley is more expensive, at $3.16 million[1] https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;M2_Bradley\",\n                            \"points\": null,\n                            \"created_at\": \"2015-12-02T20:19:23.000Z\",\n                            \"children\": []\n                          },\n                          {\n                            \"id\": 10665656,\n                            \"author\": \"jasonwatkinspdx\",\n                            \"text\": \"The Isrealis have had mixed results from the Namer and Merkava (though the Merkava is an icon of pride, so this comment might draw some cheerleading). I think the basic idea of having extra passenger room in a MBT for flexibility in evolving situations is pretty sound, but these particular vehicles have proven pretty vulnerable in close in urban combat vs smart patient infantry.\",\n                            \"points\": null,\n                            \"created_at\": \"2015-12-02T20:43:33.000Z\",\n                            \"children\": []\n                          }\n                        ]\n                      }\n                    ]\n                  }\n                ]\n              }\n            ]\n          },\n          {\n            \"id\": 10663728,\n            \"author\": \"Tloewald\",\n            \"text\": \"Given that the Bradley was designed to fight Eastern Bloc forces on the plains of Germany (which comprises rolling terrain, closely spaced villages, streams, etc.) a vehicle that can be tucked behind cover and fire lethal anti-tank missiles isn&#x27;t just decoration.One of the most interesting cold war AFVs was an M113 chassis with a cherry picker and 15 TOW missiles on it. Armor is nice, but a hill is even nicer.The problem is that the US army is still equipping itself superbly to fight the Eastern Bloc in 1985.\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T16:03:24.000Z\",\n            \"children\": [\n              {\n                \"id\": 10664561,\n                \"author\": \"gherkin0\",\n                \"text\": \"&gt; One of the most interesting cold war AFVs was an M113 chassis with a cherry picker and 15 TOW missiles on it. Armor is nice, but a hill is even nicer.Is this what you&#x27;re talking about?\\nhttp:&#x2F;&#x2F;russian-tanks.com&#x2F;the-m901-armored-missile-vehicle.ph...\",\n                \"points\": null,\n                \"created_at\": \"2015-12-02T17:55:28.000Z\",\n                \"children\": []\n              },\n              {\n                \"id\": 10664623,\n                \"author\": \"xixi77\",\n                \"text\": \"= One of the most interesting cold war AFVs was an M113 chassis with a cherry picker and 15 TOW missiles on it. Armor is nice, but a hill is even nicer. =Interesting, never heard of that one! Any links by any chance? I would be curious to look at pictures :) \\n(Edit: looks like another reply has a link!)And IMO it makes perfect sense for the first priority to be always prepared for the toughest opponent: a TOW missile will destroy a pickup truck just fine, but it also forces the opponent to be much more careful with their tanks.\",\n                \"points\": null,\n                \"created_at\": \"2015-12-02T18:03:33.000Z\",\n                \"children\": []\n              }\n            ]\n          },\n          {\n            \"id\": 10663796,\n            \"author\": \"RogtamBar\",\n            \"text\": \"&gt;The guns on a bomber were never really meant for engaging aircraft. They&#x27;re meant to deter fighters from ever getting near the bomber. Not many pilots are willing to sit directly in the path of machine gun fire, even if it is not very accurate. German anti-aircraft figured this out as well. They switched to shooting mostly tracer rounds. You aren&#x27;t going to hit anything in the first place, so you might as well just scare the crap out of them.Never really meant? Some citations there would be nice.US day bombers that were not protected by fighters often suffered heavy losses against the Luftwaffe. Which is why unescorted daylight bombing was suspended following the 25% casualty raid on Schweinfurt.&gt;They switched to shooting mostly tracer rounds. \\n..right. What I&#x27;ve read is that many units stopped using tracers altogether on pure fighters because their different ballistics at long range meant that they were not useful. The gas created when the base of the tracer burned diminished drag. (this has later been adopted for howitzer ammo, base bleed increases range by up to 30%)\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T16:13:22.000Z\",\n            \"children\": [\n              {\n                \"id\": 10664492,\n                \"author\": \"xixi77\",\n                \"text\": \"= What I&#x27;ve read is that many units stopped using tracers altogether on pure fighters because their different ballistics at long range meant that they were not useful. =You mean stopped using tracers against fighter aircraft, or stopped carrying them on fighters? The parent seems to be talking about ground AA gun crews using tracers -- presumably a lot of these would be firing at bombers?\",\n                \"points\": null,\n                \"created_at\": \"2015-12-02T17:45:45.000Z\",\n                \"children\": [\n                  {\n                    \"id\": 10664997,\n                    \"author\": \"RogtamBar\",\n                    \"text\": \"&gt; The parent seems to be talking about ground AA gun crews using tracersStopped putting tracers into fighter craft ammunition belts or magazines.&gt; The parent seems to be talking about ground AA gun crews using tracers -- presumably a lot of these would be firing at bombers?I&#x27;m not aware of tracer ammo even existing for the big flak guns. This material implies there wasn&#x27;t any.http:&#x2F;&#x2F;www.lonesentry.com&#x2F;manuals&#x2F;88mm-antiaircraft-gun&#x2F;ammu...\",\n                    \"points\": null,\n                    \"created_at\": \"2015-12-02T18:58:36.000Z\",\n                    \"children\": []\n                  }\n                ]\n              }\n            ]\n          },\n          {\n            \"id\": 10664286,\n            \"author\": \"WalterBright\",\n            \"text\": \"My father was the navigator in a B17. He said the Luftwaffe would try to sneak up behind the B17, to see if the tail gunner was watching. The tail gunner would let off a few rounds, even out of range, so the tracers would let the Luftwaffe pilot know he was watching. If not, well, another B17 down.If that didn&#x27;t work for the 109s, they&#x27;d do a head on attack. A head on attack made it very hard for the B17s to hit them, and the closing speed was so fast it would carry the 109s out of range quickly after the attack.My father said that unlike the buffoonish German pilots portrayed in WW2 movies, the real ones were careful, professional, and deadly. You never wanted to let your guard down around them.\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T17:22:19.000Z\",\n            \"children\": [\n              {\n                \"id\": 10665067,\n                \"author\": \"nullsocket\",\n                \"text\": \"Correct. Hence the development of the B-17G model with the chin turret to provide more forward protection.\",\n                \"points\": null,\n                \"created_at\": \"2015-12-02T19:07:25.000Z\",\n                \"children\": []\n              }\n            ]\n          }\n        ]\n      },\n      {\n        \"id\": 10663714,\n        \"author\": \"RockyMcNuts\",\n        \"text\": \"I think in aircraft &#x27;cannon&#x27; = &#x27;explosive shells&#x27;\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T16:01:34.000Z\",\n        \"children\": []\n      },\n      {\n        \"id\": 10665941,\n        \"author\": \"rodgerd\",\n        \"text\": \"&gt; It would probably have been better to omit those heavy guns and turrets and to leave those gunners on the ground to save weight, lives, and resources.Yep.  The Mosquito was the safest (for the crew) bomber of the war, hugely more accurate and effective than the heavies.  But heavies were the dogma of the politically influential in the air forces of Britain and the US, so much as battleships kept being considered the key asset long after they were actually irrelevant, thousands of young men were strapped into pointless flying coffins.\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T21:24:47.000Z\",\n        \"children\": []\n      },\n      {\n        \"id\": 10667033,\n        \"author\": \"walshemj\",\n        \"text\": \"the rear turret had 20mm&#x27;s from what I recall\",\n        \"points\": null,\n        \"created_at\": \"2015-12-03T00:59:42.000Z\",\n        \"children\": []\n      }\n    ]\n  },\n  {\n    \"id\": 10662734,\n    \"author\": \"_Codemonkeyism\",\n    \"text\": \"And Germany - and the world at large - was at the edge of   ground-air missles [1], making cannons on bombers obsolete.[1]https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Rheintochterhttps:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;List_of_German_guided_weapons_...\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T13:17:26.000Z\",\n    \"children\": [\n      {\n        \"id\": 10662905,\n        \"author\": \"ZanyProgrammer\",\n        \"text\": \"The &quot;edge&quot; as in &quot;napkin weapons that would&#x27;ve never have been able to have been deployed and worked, effectively&quot;\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T13:55:36.000Z\",\n        \"children\": [\n          {\n            \"id\": 10663004,\n            \"author\": \"VLM\",\n            \"text\": \"It was called flak and was quite effective.  The Germans also deployed air to air missiles that were basically rockets with flak warheads on them.  See the bomber guns had an effective range of 1000 yards or whatever so if you stood off 1200 yards in your ME-109 and launched rockets that blew up in 1200 yards that worked pretty well.I&#x27;ve read a couple memoirs of WWII pilots, interesting stuff.  I&#x27;m pretty sure they&#x27;re all dead now, whats documented out there is all we&#x27;ll ever have.As for effectiveness, well, bomber aircraft losses were tremendous until the end of the war, yet they lost the war anyway.  So its hard to say.  If you can down 10% of the B-17 per bombing run against ball bearing factories, but still lose the war, was it effective or not?  Or looking at the staggering economic and logistics costs of the air war, skipping the air war and focusing on shipping over tanks that don&#x27;t suck might have ended the war in &#x27;44 or earlier, so maybe it was ineffective.  Imagine if the winter battle of the bulge never happened because the war was already over by winter rather than lasting till spring.  Or maybe no bombing would have meant more hardware would have meant the D-day invasion getting pushed back into the sea Dunkirk II style.  Its an evenly balanced enough argument that academics will never lack for discussion topics.\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T14:15:50.000Z\",\n            \"children\": [\n              {\n                \"id\": 10664957,\n                \"author\": \"scurvy\",\n                \"text\": \"I doubt that they&#x27;ve all passed away. My great uncle was a WWII B17 navigator, and he&#x27;s still alive (and quite active).\",\n                \"points\": null,\n                \"created_at\": \"2015-12-02T18:53:09.000Z\",\n                \"children\": [\n                  {\n                    \"id\": 10667614,\n                    \"author\": \"sitkack\",\n                    \"text\": \"I met a 94 year old P38 pilot a couple months ago. Still driving his Buick.\",\n                    \"points\": null,\n                    \"created_at\": \"2015-12-03T03:41:47.000Z\",\n                    \"children\": []\n                  }\n                ]\n              },\n              {\n                \"id\": 10665381,\n                \"author\": \"mtdewcmu\",\n                \"text\": \"I have a theory that even though the bombers didn&#x27;t necessarily always hit what they were aiming at, the bombing campaign was important in tying up the Luftwaffe and degrading its capabilities through attrition, thereby hastening achieving air superiority, which provided a major advantage in the later ground war. I&#x27;m not sure that better tanks would have made as much difference; and, furthermore, I suspect that the US was able to absorb the costs of the air war without much difficulty, so it wasn&#x27;t really siphoning resources away from things like tanks.I&#x27;m not sure what to make of the Sherman tank. On the one hand, it was famously under-armored and under-gunned; on the other hand, it was fast, maneuverable, reliable, fuel efficient, cheap to produce, and perhaps easier to ship across the ocean than heavier German-style tanks would have been. So, in the final accounting, I&#x27;m not sure if it was really a bad tank or if its shortcomings were justified in the big picture.I&#x27;m not any kind of WWII expert, so please fill me in on what I don&#x27;t know.\",\n                \"points\": null,\n                \"created_at\": \"2015-12-02T19:54:28.000Z\",\n                \"children\": [\n                  {\n                    \"id\": 10665611,\n                    \"author\": \"douche\",\n                    \"text\": \"The really crazy thing is just how much more massive the scale of the war on the eastern front was.  Some of the Luftwaffe fighter aces racked up 100 or 200+ confirmed kills, primarily against the Soviets.  Other pilots who flew close air support on the Eastern Front flew thousands of combat missions, destroying hundreds or thousands of tanks, artillery pieces, and other vehicles.\",\n                    \"points\": null,\n                    \"created_at\": \"2015-12-02T20:35:15.000Z\",\n                    \"children\": []\n                  }\n                ]\n              }\n            ]\n          }\n        ]\n      }\n    ]\n  },\n  {\n    \"id\": 10662774,\n    \"author\": \"madaxe_again\",\n    \"text\": \"This article makes it out like gunning computers as a whole were some kind of new and revolutionary technology - while it&#x27;s a feat of miniaturisation and lovely engineering, some of the earliest computers (either mechanical or electromechanical) were specifically for gunnery. Firing an artillery or naval shell 20 miles requires some pretty complex (well, if you&#x27;re in a firefight - it&#x27;s not that hard but it&#x27;s not &quot;oh let me think about that a moment&quot;) maths to compensate for aerodynamic effects, spin, and the Coriolis effect.https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Rangekeeper has a decent summary of the development of this tech.\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T13:25:31.000Z\",\n    \"children\": [\n      {\n        \"id\": 10663342,\n        \"author\": \"Bjartr\",\n        \"text\": \"Speaking of targeting computers, one of my favorite videos on YouTube is a training film describing the theory of operation behind a purely mechanical fire control computer by the US Navy circa 1953 \\nhttps:&#x2F;&#x2F;youtu.be&#x2F;s1i-dnAH9Y4\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T15:09:14.000Z\",\n        \"children\": [\n          {\n            \"id\": 10663526,\n            \"author\": \"nsxwolf\",\n            \"text\": \"Thank you for that. I just watched a few minutes, but already, watching a cam compute a reciprocal is by far the most interesting thing I&#x27;ve seen all week.Analog computers were basically voodoo to me before this. Looking forward to watching the rest!\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T15:34:59.000Z\",\n            \"children\": []\n          },\n          {\n            \"id\": 10664035,\n            \"author\": \"bcoates\",\n            \"text\": \"I love that film, but it&#x27;s kind of weird that it doesn&#x27;t mention what&#x27;s probably the most important invention that makes this type of computer possible: The torque amplifier.All the devices shown suffer power losses between input and output, some of them severe. A torque amplifier has two shafts that are 1:1 geared for speed but the output shaft has extra power taken from a third supply shaft, like the supply to a logic gate that lets it drive more output power than it draws from its inputs.https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Torque_amplifier\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T16:50:33.000Z\",\n            \"children\": []\n          },\n          {\n            \"id\": 10664895,\n            \"author\": \"aswanson\",\n            \"text\": \"Thanks...just goes to show how brilliant some of our pre-digital forbears were. I still give more props to old school television engineers to present day ones. The laws of physics are far more unforgiving than the laws of a compiler.\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T18:44:05.000Z\",\n            \"children\": []\n          }\n        ]\n      },\n      {\n        \"id\": 10663480,\n        \"author\": \"Spooky23\",\n        \"text\": \"If you ever find yourself near Fall River, Massachusetts, you can tour or just walk around the battleship USS Massachusetts.One of the (many) really cool things on the ship was that you can climb into the 14&quot; gun turret and play with an actual mechanical computer for computing range &amp; elevation.\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T15:28:19.000Z\",\n        \"children\": []\n      },\n      {\n        \"id\": 10665221,\n        \"author\": \"xenihn\",\n        \"text\": \"Check out this great post on Reddit about how American artillery doctrine in WW2 spurred computational research&#x2F;developmenthttps:&#x2F;&#x2F;np.reddit.com&#x2F;r&#x2F;AskHistorians&#x2F;comments&#x2F;3ixrvq&#x2F;did_th...\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T19:30:43.000Z\",\n        \"children\": []\n      }\n    ]\n  },\n  {\n    \"id\": 10662790,\n    \"author\": \"Mvandenbergh\",\n    \"text\": \"Some more links on the electromechanical fire computers of the B-29:http:&#x2F;&#x2F;www.twinbeech.com&#x2F;CFCsystem.htm (scroll down for technical information from the user manual)http:&#x2F;&#x2F;www.glennsmuseum.com&#x2F;bombsights&#x2F;everything.html#B-29_... (great pictures)http:&#x2F;&#x2F;web.mit.edu&#x2F;STS.035&#x2F;www&#x2F;PDFs&#x2F;Newell.pdf A bonus link, review paper on WWII electromechanical fire control computers.\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T13:29:27.000Z\",\n    \"children\": []\n  },\n  {\n    \"id\": 10663040,\n    \"author\": \"Blackthorn\",\n    \"text\": \"I was quite surprised to learn recently how the B-29 was (A) about as expensive a project as the atomic bomb and (B) almost a complete failure (until the firebombing of Japan) due to no one knowing about the jet stream.\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T14:21:30.000Z\",\n    \"children\": [\n      {\n        \"id\": 10663198,\n        \"author\": \"arethuza\",\n        \"text\": \"I believe there was also the prospect that if the B-29 hadn&#x27;t been available the atomic bombs would have to been dropped from the British Lancaster - which was the only other bomber capable of carrying them at the time.\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T14:47:41.000Z\",\n        \"children\": []\n      },\n      {\n        \"id\": 10663919,\n        \"author\": \"mikeash\",\n        \"text\": \"Doesn&#x27;t (A) count the cost of producing all 3,970 airplanes, not just the R&amp;D cost? Seems a bit misleading to compare that to an R&amp;D program that produced one test device and two bombs.\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T16:35:00.000Z\",\n        \"children\": []\n      },\n      {\n        \"id\": 10667064,\n        \"author\": \"walshemj\",\n        \"text\": \"B29 was built to bomb Germany from the USA in case the UK had fallen.\",\n        \"points\": null,\n        \"created_at\": \"2015-12-03T01:09:40.000Z\",\n        \"children\": []\n      }\n    ]\n  },\n  {\n    \"id\": 10663063,\n    \"author\": \"dandare\",\n    \"text\": \"Can someone please explain how the gunner&#x2F;computer established the range and speed of enemy aircraft? The article says &quot;a gunner would focus a series of dots&quot; but unless at least two gunners are focusing the same plane I have no idea how they calculated range and speed. Thanks.\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T14:25:42.000Z\",\n    \"children\": [\n      {\n        \"id\": 10663132,\n        \"author\": \"marktangotango\",\n        \"text\": \"I used to be a gunner on an M1A1, and although we had laser range finders, we also practiced with the old style optical sights that were installed alongside the main gun.  How range finding works with optical sites is you usually have a series of marks in the viewfinder that you use to physically measure what you&#x27;re aiming at, so if the tank&#x2F;plane&#x2F;whatever is between particular two pips (or whatever; edit iirc the M1 had two curved lines you would placer over the target) you know that it&#x27;s about x meters away. The pips are calculated knowing the average length of the object, so this is, in practice, close enough.The procedure is; measure the target, then use cross marks on the cross hairs to raise the gun tube to the appropriate level, manually guess lead and defilade, fire, on the way. It obviously takes practice to get good at.  I found it curious that the US Army continued to teach&#x2F;train&#x2F;use this method, as well as land navigation with compass&#x2F;mapp instead of gps. The idea is to not rely on technology entirely.Edit: turns out I am describing stadiametric rangefinding:https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Stadiametric_rangefinding\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T14:36:48.000Z\",\n        \"children\": [\n          {\n            \"id\": 10663291,\n            \"author\": \"kiiski\",\n            \"text\": \"What military doesn&#x27;t teach navigation with a compass? I would also imagine that most, if not all, teach rangefinding  to those who might need it; snipers&#x2F;sharpshooters, gunners, etc.My only military experience is from my compulsory service in the Finnish Defence Forces, where everyone does have to learn how to read maps and use a compass (we never used gps&#x2F;other equivalent). I was in signals myself, so I didn&#x27;t have any training for rangefinding.\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T15:00:32.000Z\",\n            \"children\": []\n          },\n          {\n            \"id\": 10663413,\n            \"author\": \"digi_owl\",\n            \"text\": \"I seem to recall that the gunner on one of the more successful German tank crews during WW2 basically had the sights set for a specific distance and then eyeballed it from there.\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T15:18:34.000Z\",\n            \"children\": []\n          },\n          {\n            \"id\": 10663494,\n            \"author\": \"sa46\",\n            \"text\": \"Regarding teaching land navigation by compass:I teach light infantry tactics to new lieutenants for the US Army.  There&#x27;s a couple reasons to use old-school methods over relying on your GPS:* Using a compass and a map gives you a much better feel for terrain.  One of the common problems with lieutenants is a disregard for advantages and disadvantages of specific terrain.  I feel that this is by far the most important point.  Understanding and visualizing terrain from a map is a hugely valuable skill that impacts most points of an operation, specifically route planning, where to place your machine guns, and where to attack the objective from.* GPS can be jammed.  This point was driven home hard by the novel Ghost Fleet.  Ghost Fleet is a white paper turned into a novel (because no one would read a whitepaper) on what a future war with China would look like.  I&#x27;m pretty sure Ghost Fleet is also the impetus for the Naval Academy re-adding celestial navigation to their classwork.* GPS doesn&#x27;t always work, or takes a while to get enough satellites to get a fix.  You know what really sucks: taking fire and not knowing where you are.* Batteries are heavy.  Yes, tech is improving and you typically only need AA batteries.  But soldier weight for light infantry is and continues to be a challenge.\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T15:30:22.000Z\",\n            \"children\": [\n              {\n                \"id\": 10663786,\n                \"author\": \"Tloewald\",\n                \"text\": \"In the early aughts I wrote a simulation for training infantry to call in artillery strikes. It relied on compasses and maps for exactly these reasons. Another point is that understanding what the automatic tools are doing for you makes you better at understanding the automatic tools (and why they&#x27;re failing when they fail).\",\n                \"points\": null,\n                \"created_at\": \"2015-12-02T16:12:27.000Z\",\n                \"children\": []\n              }\n            ]\n          }\n        ]\n      },\n      {\n        \"id\": 10663146,\n        \"author\": \"evgen\",\n        \"text\": \"In WWII we saw the introduction of practical optical coincidence rangefinding, starting with naval guns and quickly moving to direct-fire artillery, tank guns, and AA applications.  One gunner, but binocular vision with the aiming mechanism using angle of incidence from each eye input to calculate current range.\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T14:39:14.000Z\",\n        \"children\": [\n          {\n            \"id\": 10663402,\n            \"author\": \"mcguire\",\n            \"text\": \"https:&#x2F;&#x2F;commons.wikimedia.org&#x2F;wiki&#x2F;File:Polish_destroyer&#x27;s_r...\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T15:16:40.000Z\",\n            \"children\": []\n          },\n          {\n            \"id\": 10665169,\n            \"author\": \"jholman\",\n            \"text\": \"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Coincidence_rangefinder\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T19:21:00.000Z\",\n            \"children\": []\n          }\n        ]\n      },\n      {\n        \"id\": 10667330,\n        \"author\": \"Merad\",\n        \"text\": \"I don&#x27;t know about the B-29 system in particular, but gyroscopic gunsights used on most WW2 fighters were fairly straightforward.  First, you set a selector on the sight to the wingspan of your target (usually there would be presets for common enemy aircraft).  Then you twist a knob (typically on the throttle) that adjusts a ring in the sight until it matches the size of the target - this establishes the range.  Finally a gyroscope provides input on how your aircraft is moving, and since you&#x27;re typically maneuvering to follow your target this is an approximation of the target&#x27;s movement.There&#x27;s a lot of approximation involved, but generally it&#x27;s good enough to hit an airplane sized target, especially on US fighters where you typically have 4-8 machine guns spitting out 50+ bullets per second in a shotgun like pattern.Some relevant links:http:&#x2F;&#x2F;i651.photobucket.com&#x2F;albums&#x2F;uu236&#x2F;ken1926&#x2F;P-51DK_03.j...http:&#x2F;&#x2F;www.lonesentry.com&#x2F;blog&#x2F;wp-content&#x2F;uploads&#x2F;2010&#x2F;09&#x2F;ta...https:&#x2F;&#x2F;upload.wikimedia.org&#x2F;wikipedia&#x2F;commons&#x2F;d&#x2F;d7&#x2F;P-47_gun...\",\n        \"points\": null,\n        \"created_at\": \"2015-12-03T02:23:35.000Z\",\n        \"children\": []\n      }\n    ]\n  },\n  {\n    \"id\": 10663117,\n    \"author\": \"rplnt\",\n    \"text\": \"That &quot;share on pinterest&quot; feature sure is annoying when it blocks text.\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T14:34:37.000Z\",\n    \"children\": []\n  },\n  {\n    \"id\": 10663515,\n    \"author\": \"jessaustin\",\n    \"text\": \"This confirms for me a complaint I&#x27;ve always had about the Millennium Falcon. A ship equipped with hyperdrive would certainly have had targeting systems as good as a B-29. There would have been no need for the midships ladders to the gun stations.\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T15:33:07.000Z\",\n    \"children\": [\n      {\n        \"id\": 10663632,\n        \"author\": \"JoeAltmaier\",\n        \"text\": \"But the best part of old WWII movies were the dogfighting scenes. And the movie you reference was cribbed from there. So, poetic license.\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T15:51:53.000Z\",\n        \"children\": []\n      },\n      {\n        \"id\": 10663731,\n        \"author\": \"fit2rule\",\n        \"text\": \"Unless the ship was assembled from parts of different things from around the empire...\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T16:05:00.000Z\",\n        \"children\": [\n          {\n            \"id\": 10663957,\n            \"author\": \"enraged_camel\",\n            \"text\": \"Yeah, I think it was implied that the MF is heavily modified to significantly expand the capabilities of the base ship. So maybe the stock automated cannons were replaced by manual but more powerful versions.Or something. \\u00af\\\\_(\\u30c4)_&#x2F;\\u00af\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T16:39:47.000Z\",\n            \"children\": [\n              {\n                \"id\": 10664308,\n                \"author\": \"david-given\",\n                \"text\": \"Having blown up a tonne of them in Tie Fighter, the stock YT-1300 basically had all the fighting ability of a cabbage. The only real thing to be worried about was ramming them by accident, or possibly laughing too much to rebalance your shields.So yes, I&#x27;m pretty sure the Millenium Falcon was heavily upgraded.\",\n                \"points\": null,\n                \"created_at\": \"2015-12-02T17:25:09.000Z\",\n                \"children\": []\n              }\n            ]\n          }\n        ]\n      },\n      {\n        \"id\": 10664497,\n        \"author\": \"gherkin0\",\n        \"text\": \"If I remember that scene correctly, the gun stations on the Millennium Falcon seem more like the B-29 sighting stations than directly operated &quot;local control&quot; guns (but located directly behind the remote controlled gun rather than next to it).  The biggest problem that I see is that this causes the MF&#x27;s sighting station&#x27;s FOV to be smaller than the one pictured in the B29.But yeah, that scene is mostly artistic license.\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T17:46:27.000Z\",\n        \"children\": [\n          {\n            \"id\": 10664931,\n            \"author\": \"wmeredith\",\n            \"text\": \"That scene? The whole thing is fantasy, not hard sci-fi.\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T18:49:15.000Z\",\n            \"children\": []\n          }\n        ]\n      },\n      {\n        \"id\": 10665257,\n        \"author\": \"Shivetya\",\n        \"text\": \"and the same misconception populated many video games as well, yet are we not willing to trade some realism for fun and fantasy? What fun would it be if we didn&#x27;t struggle? Much of science fiction in movies and games as portrayed seems to derive from WW1 fighting.\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T19:35:41.000Z\",\n        \"children\": []\n      },\n      {\n        \"id\": 10665328,\n        \"author\": \"openasocket\",\n        \"text\": \"Just a random guess, but maybe it&#x27;s a regulation thing. Like the empire made such military-grade weapons illegal on civilian ships. And having an illegal military-grade autocannon mounted on the side of the ship would attract attention from authorities.Of course this is all my own rationalization: it&#x27;s not like Lucas thought all the intricacies of the Star Wars universe through for their technical accuracy. This is more like literary interpretation, only instead of showing &quot;The Old Man and the Sea&quot; is a metaphor for the tragedy of human existence, we figure out how space ships work!\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T19:47:26.000Z\",\n        \"children\": []\n      },\n      {\n        \"id\": 10666073,\n        \"author\": \"Crito\",\n        \"text\": \"When you analyse Star Wars like that, you&#x27;ll find that the things which make sense are greatly outnumbered by the things that don&#x27;t.\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T21:46:44.000Z\",\n        \"children\": []\n      },\n      {\n        \"id\": 10666729,\n        \"author\": \"vacri\",\n        \"text\": \"There&#x27;s plenty like that in Star Wars. What about &#x27;blasters&#x27;, the weapon whose projectiles move so slowly that an alert person can physically dodge them?\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T23:44:16.000Z\",\n        \"children\": [\n          {\n            \"id\": 10667936,\n            \"author\": \"kbenson\",\n            \"text\": \"Apparently it&#x27;s harder than it seems[1], depending on distance.1: http:&#x2F;&#x2F;www.discovery.com&#x2F;tv-shows&#x2F;mythbusters&#x2F;videos&#x2F;star-wa...\",\n            \"points\": null,\n            \"created_at\": \"2015-12-03T05:28:25.000Z\",\n            \"children\": []\n          }\n        ]\n      },\n      {\n        \"id\": 10666755,\n        \"author\": \"Rayearth\",\n        \"text\": \"I think in one of the EU novels (Courtship of Princess Leia) Luke flies the Falcon while using both quadlasers, and if I recall correctly Han mentions that the controls in the cockpit allowed for such a thing but with a major accuracy penalty compared to having actual gunners at the gun stations. I don&#x27;t recall if Luke was using the Force to make the cockpit quadlaser controls super accurate or if he was just reaching out with the Force to directly operate the controls at both gun stations.\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T23:51:06.000Z\",\n        \"children\": []\n      }\n    ]\n  },\n  {\n    \"id\": 10665125,\n    \"author\": \"Pyxl101\",\n    \"text\": \"I had no idea that fire control computers in airplanes were so sophisticated in the 1940s. Truly amazing! I don&#x27;t know what I thought, but I guess I assumed that air battles back then relied primarily on line-of-sight and tracers to compensate.It&#x27;s amazing how effective automation can completely transform an activity and elevate it to a new plane of effectiveness. I&#x27;ll channel Andreessen and say: technology is eating the world.\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T19:14:55.000Z\",\n    \"children\": []\n  },\n  {\n    \"id\": 10666507,\n    \"author\": \"etangent\",\n    \"text\": \"Out of curiosity (and possibly a dumb question), what is the main constraint preventing modern (subsonic) bombers from carrying CIWS-type defense system against missiles? Is it size, weight, recoil, aerodynamics, or special radar requirements? The initial push behind removing gun systems appears to have been development of AA missiles and increased reliance on fighter escorts. Yet modern CIWS on sea vessels have become so effective against missiles that they significantly upped the cost and requirements of anti-ship warfare, to the point that a single missile fired at a ship is not expected to be successful. Given advanced enough CIWS (using directed energy in near future?) one basically doesn&#x27;t need stealth or other fancy&#x2F;expensive&#x2F;less reliable features.\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T22:54:16.000Z\",\n    \"children\": [\n      {\n        \"id\": 10666548,\n        \"author\": \"ckozlowski\",\n        \"text\": \"I&#x27;m just guessing here, but I&#x27;m going to bet that defensive ECM is probably deemed better effective per pound that CWIS.It&#x27;s worth noting here that CWIS&#x27; effectiveness hasn&#x27;t really been proven. But what is certain is that it&#x27;s theoretical effectiveness is being questioned as missiles get faster. The original 20mm CWIS had a pretty limited range. The Europeans went to 30mm with Goalkeeper, and now both are set to be replaced with either directed energy weapons (faster tracking, better accuracy) or systems like SeaRAM, which can engage further by switching to point defense missiles instead of guns.I can see how directed energy weapons could be attractive to aircraft once the power density issues are solved, but right now they&#x27;re simply too heavy.\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T23:03:40.000Z\",\n        \"children\": []\n      }\n    ]\n  },\n  {\n    \"id\": 10666727,\n    \"author\": \"pippy\",\n    \"text\": \"How did they do this without transistors? The only thing I can find is this diagram here which looks like a small box: http:&#x2F;&#x2F;www.twinbeech.com&#x2F;images&#x2F;TURRETS&#x2F;cfc&#x2F;CFC%20computer19... which is smaller than a vacuum tube. I&#x27;d assume you&#x27;d need vector calculus to calculate the path of a bullet?\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T23:43:25.000Z\",\n    \"children\": [\n      {\n        \"id\": 10666852,\n        \"author\": \"monknomo\",\n        \"text\": \"The first thing to keep in mind is that these are not general purpose machines.  They only do one thing, which is estimate the trajectory of a particular type of bullet, given several inputs.This lets the designer do a lot of precalculation, so they might use a series of cams that approximate known curves or differentials some known ratio.Useful google terms are things like &quot;mechanical fire control computer&quot; or &quot;mechanical tide predictor&quot;.Check out &quot;Old Brass Brains&quot; it might give you an idea of how to approach this kind of problem mechanically; or at least how sophisticated a mechanical approach can be.\",\n        \"points\": null,\n        \"created_at\": \"2015-12-03T00:10:16.000Z\",\n        \"children\": []\n      }\n    ]\n  }\n]"
}