{
  "meta.json": "{\n  \"rank\": 7,\n  \"title\": \"Three Stories\",\n  \"url\": \"http://justinkan.com/three-stories\",\n  \"hn_url\": \"https://news.ycombinator.com/item?id=10658611\",\n  \"points\": 392,\n  \"author\": \"tzier\",\n  \"comment_count\": 47\n}",
  "article.txt": "",
  "comments.json": "[\n  {\n    \"id\": 10659396,\n    \"author\": \"dcx\",\n    \"text\": \"\\\"Gen George C. Marshall received a report from a general on his staff that some of Marshall\\u2019s officers had morale problems. General Marshall said, 'Officers don\\u2019t have morale problems. Officers cure morale problems in others. No one is looking after my morale.'\\\"(http://www.dtic.mil/dtic/tr/fulltext/u2/a454364.pdf)\",\n    \"points\": null,\n    \"created_at\": \"2015-12-01T22:33:12.000Z\",\n    \"replies\": [\n      {\n        \"id\": 10659640,\n        \"author\": \"sanderjd\",\n        \"text\": \"This is a clever way of putting things, but what it is really saying is that leaders shouldn't let the people who are counting on them see their morale problems. But that doesn't mean that they can't have morale problems, or that they can't find support up or sideways on the chain of command.\",\n        \"points\": null,\n        \"created_at\": \"2015-12-01T23:15:39.000Z\",\n        \"replies\": [\n          {\n            \"id\": 10659858,\n            \"author\": \"hkmurakami\",\n            \"text\": \"IIRC there is a section in Horowitz's book that covers this during the doom days of Loudcloud.\",\n            \"points\": null,\n            \"created_at\": \"2015-12-01T23:56:57.000Z\"\n          }\n        ]\n      },\n      {\n        \"id\": 10659819,\n        \"author\": \"arram\",\n        \"text\": \"The worst interpretation here is as a justification for lazy leadership. What it really means is that for leaders there is a higher expectation of emotional intelligence, or as Ben Horowitz puts it, your ability to manage your own psychology.http://www.bhorowitz.com/what_s_the_most_difficult_ceo_skill...\",\n        \"points\": null,\n        \"created_at\": \"2015-12-01T23:49:49.000Z\"\n      }\n    ]\n  },\n  {\n    \"id\": 10659452,\n    \"author\": \"cassieramen\",\n    \"text\": \"It's always interesting to think about the key moments in a start-up's life. Those ride or die moments that lead to great success or losing the Jonas Brother. I wonder how many a startup gets? How many are created by action or by luck? Do all startups have a couple of key moments they can look at as lynch pins to their success?\",\n    \"points\": null,\n    \"created_at\": \"2015-12-01T22:42:50.000Z\",\n    \"replies\": [\n      {\n        \"id\": 10659810,\n        \"author\": \"AznHisoka\",\n        \"text\": \"I think the ones that do are an anamoly. Most successful businesses become successful in a boring way going through a slow ramp of growth.\",\n        \"points\": null,\n        \"created_at\": \"2015-12-01T23:48:11.000Z\"\n      },\n      {\n        \"id\": 10659912,\n        \"author\": \"krschultz\",\n        \"text\": \"The rare make or break moments exist, but most startups thrive on getting their employees to work as if they're in make or break moments 10x more often than they actually are.\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T00:09:24.000Z\"\n      },\n      {\n        \"id\": 10659927,\n        \"author\": \"timr\",\n        \"text\": \"It would be incorrect to take away from these stories that they were \\\"key moments\\\" in the life of JTV. These are fun stories, but there were lots of other moments that Justin could describe that were equally dramatic (if not worse).If anything, these are examples of why most of the stuff that you worry about in a startup turn out to be totally irrelevant in the final analysis. While we were stressing about the Jonas brothers, the \\\"gaming\\\" category was off languishing in its own little corner of the site....\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T00:13:48.000Z\"\n      },\n      {\n        \"id\": 10660710,\n        \"author\": \"lkrubner\",\n        \"text\": \"This is extremely long (12,000 words) but it gets surprisingly dramatic at the end:\\\"What happens when the Board Of Directors begins to panic?\\\"http://www.smashcompany.com/business/what-happens-when-the-b...\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T03:25:37.000Z\"\n      }\n    ]\n  },\n  {\n    \"id\": 10659551,\n    \"author\": \"AznHisoka\",\n    \"text\": \"Would there still be any objection to making money from a porn site if it gave them 40% of their revenue?\",\n    \"points\": null,\n    \"created_at\": \"2015-12-01T22:57:58.000Z\",\n    \"replies\": [\n      {\n        \"id\": 10659667,\n        \"author\": \"hyperion2010\",\n        \"text\": \"Not only that but everyone wins. The user looking for porn is directed to an appropriate venue and everyone in the community that doesn't want to deal with a horny male at the other end of internet never even notices he is gone!Score -1 for continued prudishness.\",\n        \"points\": null,\n        \"created_at\": \"2015-12-01T23:20:46.000Z\",\n        \"replies\": [\n          {\n            \"id\": 10659832,\n            \"author\": \"AznHisoka\",\n            \"text\": \"Yep and I lost some respect for these guys because they were bullied into stopping by someone in techcrunch... Techcrunch. Makes me want to barf.\",\n            \"points\": null,\n            \"created_at\": \"2015-12-01T23:52:18.000Z\",\n            \"replies\": [\n              {\n                \"id\": 10661364,\n                \"author\": \"girvo\",\n                \"text\": \"TechCrunch had (still does? I don't know) considerable influence over early startups, so I'm not particularly surprised. The article itself is complete bollocks, which is also not particularly surprising.\",\n                \"points\": null,\n                \"created_at\": \"2015-12-02T06:35:08.000Z\"\n              }\n            ]\n          },\n          {\n            \"id\": 10659947,\n            \"author\": \"makomk\",\n            \"text\": \"One problem with that is that there's no reliable way to tell if someone is looking for porn. I remember this got MSN search in hot water donkeys years ago because they were making money by sending people to porn sites based on keyword matching that triggered on non-porn searches.\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T00:18:35.000Z\"\n          },\n          {\n            \"id\": 10660899,\n            \"author\": \"throwaway3487ds\",\n            \"text\": \"Not everyone wins. Philosophers and specifically feminists have to spend valuable cycles deciding and debating whether sex work is morally wrong or whether there should be a sex-positive part of the free market. This time could be much better spent on questions such as war, income inequality, discrimination other than as regards sex work, or a thousand other things. But it needs to be done, it's not like there is general agreement or you can ask some authority. Likewise the time I spent writing this comment, and the time you spent reading it, could be put to better usage by each of us.See: https://storify.com/carolleigh/gloria-steinem-a-swerf\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T04:14:28.000Z\",\n            \"replies\": [\n              {\n                \"id\": 10661369,\n                \"author\": \"girvo\",\n                \"text\": \"I don't think I understand your argument?\",\n                \"points\": null,\n                \"created_at\": \"2015-12-02T06:36:02.000Z\",\n                \"replies\": [\n                  {\n                    \"id\": 10664752,\n                    \"author\": \"throwaway3487ds\",\n                    \"text\": \"I was just stating that not everyone wins, regardless of the correct moral conclusion regarding sex work (including the existence of pornography and the sex industry.)I was being quite neutral, saying, that at a minimum the philosophers and feminists who have to debate and decide this stuff don't win, since they have better things to be doing.I don't know how else to put it other than the link I included - this isn't a settled question, some feminists are sex-positive and support the sex industry, others explicitly exclude sex work from the idea of feminism. (Because it's degrading, or hurts women, etc, by their viewpoint, which I don't mean to summarize here. Some say the very existence of pornography anywhere hurts women everywhere.)So no matter how you slice it, not everyone wins via a redirect to pornography. I don't mean to make a deeper or more profound statement than I did, which is why it is quite narrow. At a minimum it causes feminists and philosophers to spend time on the issue that could be put to better use.Here is a link to a book I haven't gotten around to reading: http://gaildines.com/pornland/pornland-about-the-book/(I also am a user of pornography, though don't pay for it, and don't yet have a moral position on the matter. In fact I consider it possible that I might be \\\"in the wrong\\\" for being a user of pornography, given some of the above links. I haven't decided! The only position I have is that it is obviously not trivial or beyond the need for ethical analysis, i.e. it's not something you can pass summary judgment on in good conscience, like some trivial ethical question with an obvious answer - is it wrong to pretend to your dog you're going to the park but then go to the vet instead, no, it's obviously not wrong, even though you're being misleading, next question. Unlike this example you - or someone - has to look at the issue. Which is a chore.)\",\n                    \"points\": null,\n                    \"created_at\": \"2015-12-02T18:22:15.000Z\",\n                    \"replies\": [\n                      {\n                        \"id\": 10666686,\n                        \"author\": \"girvo\",\n                        \"text\": \"Ah, fair enough! Thanks for explaining, I appreciate it :)\",\n                        \"points\": null,\n                        \"created_at\": \"2015-12-02T23:35:58.000Z\"\n                      }\n                    ]\n                  }\n                ]\n              }\n            ]\n          }\n        ]\n      },\n      {\n        \"id\": 10660314,\n        \"author\": \"tptacek\",\n        \"text\": \"I wouldn't do it. Without getting into an icky and tedious discussion of pornography in general, my general default setting is that major porn sites are exploitative, and that the ones that pay the most affiliate dollars are likely to be the worst of the bunch.Which is just to say, there are reasons you might not want to have a policy of redirecting users to porn sites for money even if Techcrunch isn't shaming you.\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T01:41:43.000Z\",\n        \"replies\": [\n          {\n            \"id\": 10660438,\n            \"author\": \"AznHisoka\",\n            \"text\": \"What makes you say the major ones are exploitative? And to who? the actors/actresses or the people watching their movies?\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T02:14:22.000Z\",\n            \"replies\": [\n              {\n                \"id\": 10660842,\n                \"author\": \"stickfigure\",\n                \"text\": \"I also find this word odd. Usually I think the person being exploited in a financial relationship is the one whose pockets are being emptied.\",\n                \"points\": null,\n                \"created_at\": \"2015-12-02T03:58:22.000Z\"\n              },\n              {\n                \"id\": 10661798,\n                \"author\": \"55555\",\n                \"text\": \"I'm not sure what he means, but negative-option free-trial scams, credit card banging, fake messages on dating and cam sites to get you to buy credit packs, etc., are pretty run-of-the-mill issues.There are plenty of legit porn sites out there though.\",\n                \"points\": null,\n                \"created_at\": \"2015-12-02T08:58:47.000Z\"\n              }\n            ]\n          }\n        ]\n      },\n      {\n        \"id\": 10660486,\n        \"author\": \"jacquesm\",\n        \"text\": \"If you want to deal with corporate America in any way shape or form then any income from porn is right off the table.And if you're getting 40% of your revenue from porn then you are an extension of the porn industry.\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T02:27:50.000Z\",\n        \"replies\": [\n          {\n            \"id\": 10660821,\n            \"author\": \"gaadd33\",\n            \"text\": \"Hotels seem to have no problem doing business in corporate America and they are probably one of the largest independent distributors of porn.\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T03:52:52.000Z\"\n          }\n        ]\n      }\n    ]\n  },\n  {\n    \"id\": 10659752,\n    \"author\": \"pkfrank\",\n    \"text\": \"The pizza delivery messenger service is clever and hilarious.\",\n    \"points\": null,\n    \"created_at\": \"2015-12-01T23:35:15.000Z\",\n    \"replies\": [\n      {\n        \"id\": 10659797,\n        \"author\": \"livejamie\",\n        \"text\": \"A startup waiting to happen! ;)\",\n        \"points\": null,\n        \"created_at\": \"2015-12-01T23:45:58.000Z\",\n        \"replies\": [\n          {\n            \"id\": 10659920,\n            \"author\": \"Splines\",\n            \"text\": \"Ubergram\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T00:12:04.000Z\"\n          },\n          {\n            \"id\": 10659940,\n            \"author\": \"cba9\",\n            \"text\": \"The problem is you don't need fast physical deliveries of short messages that often. For example, a few days ago I was pondering how to reach a particular person on very short notice; I had an address, but nothing else, so I couldn't call them, and while I could spend like $50-100 on international mail, it wouldn't get there faster than 3 days from sending. Ultimately, the best solution I could find was... telegrams. Specifically, their modern email+courier incarnation. It would cost like $70 and probably get to the person in a day or two.I thought this sounded outrageous, but then it occurred to me: when was the last time anyone ever used telegrams? There can't be many uses of them - I've never used one in my entire life - and all the regular costs of a business still need to be paid and the couriers have to be paid and so on.\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T00:17:24.000Z\",\n            \"replies\": [\n              {\n                \"id\": 10661140,\n                \"author\": \"patio11\",\n                \"text\": \"Japan spends far in excess of $500 million on telegrams a year, the overwhelming majority of it because it is traditional to send one if you're invited to a wedding and cannot attend.There exist a variety of circumstances where a business has to put a piece of paper in someone's hand within about 24 hours. It's doable between virtually any two endpoints in the first world. It also costs whatever FedEx/DHL/etc think they can get out of a business which needs to have a document hand delivered on the other side of the world immediately, which is \\\"a lot.\\\" (e.g. It's presently midnight on Wednesday in NYC. I can walk next door to a store in Tokyo and hand FedEx a letter. It will arrive at the New York Stock Exchange before the opening bell on Thursday. That will cost ~$125 but it will almost certainly actually work.)\",\n                \"points\": null,\n                \"created_at\": \"2015-12-02T05:18:20.000Z\",\n                \"replies\": [\n                  {\n                    \"id\": 10662271,\n                    \"author\": \"ovi256\",\n                    \"text\": \"The amazing observation in your example, for me, is that it's one of the few things you can get cheaply, fast, and reliably. The holy trifecta of impossible requirements.Some 60-70 years ago, you could not get it done for any sum of money. Maybe the military could do it, on a good day. A few years later, it's not just possible, but cheap.\",\n                    \"points\": null,\n                    \"created_at\": \"2015-12-02T11:12:34.000Z\"\n                  },\n                  {\n                    \"id\": 10673443,\n                    \"author\": \"cba9\",\n                    \"text\": \"I did not know that about Japan, but apparently here, as with the fax machine, Japan is an exception. Japan may spend $500m on telegrams (which incidentally, doesn't seem like very many telegrams per person per year - if each is cheaper than I was quoted by quite a bit, say $50 total, and there's 127m people, then that's one a month on average. I'm also not sure they spend that much since I can't find any quick hits in Google discussing it recently; perhaps you could blog about it sometime.), but nevertheless what delivery services in Japan do or people do in Japan is not that useful, in terms of amortizing fixed costs and realizing economies of scale, to American or Australian delivery costs, nor is it informative about how often Americans or Australians send telegrams.I also didn't bother to check Fedex/DHL because I figured while they probably did have faster deliveries than USPS, they always charge way more and we were unsure we really needed within a day delivery (which is the only place on the Pareto frontier the private companies would be for general document delivery).As it happened, we were unsatisfied with our options so we kept digging and eventually came up with what we think are the phone number & email address of the person we need to reach, so hopefully it all turned out to be moot.\",\n                    \"points\": null,\n                    \"created_at\": \"2015-12-03T23:13:36.000Z\"\n                  }\n                ]\n              }\n            ]\n          }\n        ]\n      },\n      {\n        \"id\": 10659845,\n        \"author\": \"sjg007\",\n        \"text\": \"Or send flowers, or even old school telegram... ?\",\n        \"points\": null,\n        \"created_at\": \"2015-12-01T23:54:06.000Z\"\n      },\n      {\n        \"id\": 10660654,\n        \"author\": \"sparky_z\",\n        \"text\": \"Back in the day, some friends of mine were stuck walking home from the movie theater after the buses stopped running. As they were walking past a Domino's, one of them had the idea to order a pizza delivered to their house and then hitch a ride with the driver. It worked.\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T03:11:51.000Z\"\n      }\n    ]\n  },\n  {\n    \"id\": 10659951,\n    \"author\": \"noahlt\",\n    \"text\": \"I've always wondered this about the pizza-delivery story: how did they know the address where Kyle was staying?\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T00:19:04.000Z\",\n    \"replies\": [\n      {\n        \"id\": 10660020,\n        \"author\": \"cperciva\",\n        \"text\": \"From http://www.foundersatwork.com/1/post/2012/10/what-goes-wrong... :Let me give you one last example of improvising. The Justin.tv founders were having a lot of scaling issues in the beginning. One weekend their whole video system went down. Kyle was in charge of it, but no one knew where Kyle was. And Kyle wasn't picking up his cell phone. This was live video so it was pretty critical that this get fixed immediately.Michael Siebel called Kyle's friends and found out he was in Lake Tahoe and got the address of the house. So here's a problem for you, you know the address where someone is and he's not answering his phone. How do you get a message to him right away? Michael went on Yelp and looked for a pizza place near the house and called them up and said, \\\"I want to have a pizza delivered. But never mind the pizza. Just send a delivery guy over and say these four words: The site is down.\\\" The pizza place was very confused by this, but they send the pizza guy without a pizza, Kyle answers the door, and the pizza guy says, \\\"The site is down.\\\" Kyle was able to fix it, and the site was down for less than an hour total from beginning to end.So it sounds like they knew someone who knew where he was staying.\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T00:37:12.000Z\"\n      }\n    ]\n  },\n  {\n    \"id\": 10660477,\n    \"author\": \"jacquesm\",\n    \"text\": \"I can relate to all of these because I've lived through all of these, fortunately not as much in the public eye as Justin and his team (the web was much smaller back then) but this brought back a whole bunch of memories.Thanks Justin (assuming you read HN) for writing these up.\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T02:26:00.000Z\",\n    \"replies\": [\n      {\n        \"id\": 10660640,\n        \"author\": \"justin\",\n        \"text\": \"Thanks for reading!\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T03:07:49.000Z\",\n        \"replies\": [\n          {\n            \"id\": 10660656,\n            \"author\": \"jacquesm\",\n            \"text\": \"Hah :) Cool. I'm sure there are lots of people that can relate to your stories in one way or another but what with us being active in the exact same market (but you did way better on the execution and on the business part) it really hit the spot here.\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T03:12:33.000Z\"\n          }\n        ]\n      },\n      {\n        \"id\": 10660724,\n        \"author\": \"stevesearer\",\n        \"text\": \"Somewhere around 5 years ago I was doing some maintenance on my site's database without really knowing what I was doing.My wedding website was hosted on the same server, so I thought I might as well delete it since the wedding was months before. Dropped that database. Visited my business website a few minutes later and it wasn't working. Apparently both sites were in the same database...Called MediaTemple support and asked if they had a backup. They did! Support guy asked if I wanted him to restore it. Of course I do. He goes on hold.He comes back on and says, \\\"Sir, I'm sorry to say that the last back up actually backed up the blank version of the site so we don't have anything to restore. Is there anything else I can help you with?\\\"...After hanging up, I explained the situation to my wife and she just says, call back and ask someone else. The next support guy tells me that there actually is a way to restore an old archived backup, but there will likely be a loss of data and there will be a fee. Turns out the fee was only $15 and the backup was from the previous day, so no loss of data.I'm still running the same site and I might soon be able to hire my first employee :)My takeaways were to create backups, not monkey around on the database, and to call support back and ask for someone else to verify what the other person told me.\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T03:29:09.000Z\"\n      }\n    ]\n  },\n  {\n    \"id\": 10660568,\n    \"author\": \"navitronic\",\n    \"text\": \"A modern alternative to the pizza delivery message would be to use uber to book a car near the location and upon the allocation of the driver, contact them and ask them to deliver the message.and then drive around the block a few times for their trouble.\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T02:45:55.000Z\",\n    \"replies\": [\n      {\n        \"id\": 10660984,\n        \"author\": \"bo1024\",\n        \"text\": \"Taskrabbit or a similar service --- practically designed for such scenarios.\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T04:34:52.000Z\",\n        \"replies\": [\n          {\n            \"id\": 10661299,\n            \"author\": \"Axsuul\",\n            \"text\": \"Uber is orders of magnitude better in this scenario.- TaskRabbit: Post job, wait for bids, accept a bid, wait for driver to leave his/her house to deliver message, 2-3 hours later... profit?- Uber: Place pin near address, request ride, driver less than 5 min away accepts, call driver with weird request. 10 min later... profit!\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T06:09:09.000Z\"\n          }\n        ]\n      }\n    ]\n  },\n  {\n    \"id\": 10661413,\n    \"author\": \"sagargv\",\n    \"text\": \"Where was twitch.tv hosted before the acquisition? Bandwidth on AWS would've costed a bomb.\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T06:51:11.000Z\"\n  },\n  {\n    \"id\": 10661939,\n    \"author\": \"bambax\",\n    \"text\": \"Great stories and great writing; thanks for sharing.\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T09:46:20.000Z\"\n  },\n  {\n    \"id\": 10661990,\n    \"author\": \"hamburglar\",\n    \"text\": \"Such a great summary of \\\"unlimited vacation\\\":> Because we were young and terrible managers, we had an \\u201cunlimited vacation\\u201d policy, which translated into passively discouraging people from taking vacation.\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T09:59:03.000Z\"\n  },\n  {\n    \"id\": 10666811,\n    \"author\": \"pbreit\",\n    \"text\": \"\\\"we had an \\u201cunlimited vacation\\u201d policy, which translated into passively discouraging people from taking vacation\\\"I've never heard this described so succinctly and perfectly!\",\n    \"points\": null,\n    \"created_at\": \"2015-12-03T00:01:46.000Z\"\n  }\n]"
}