{
  "meta.json": "{\n  \"rank\": 19,\n  \"title\": \"Bacteria on the Brain\",\n  \"url\": \"https://web.archive.org/web/20151201011444/http://www.newyorker.com/magazine/2015/12/07/bacteria-on-the-brain\",\n  \"hn_url\": \"https://news.ycombinator.com/item?id=10648639\",\n  \"points\": 135,\n  \"author\": \"pella\",\n  \"comment_count\": 23\n}",
  "article.txt": "Bacteria on the Brain - The New Yorker Subscribe Subscribe Sign In Link your subscription The New Yorker Sign in Link your subscription Shop F T G+ Home News Culture Books & Fiction Science & Tech Business Humor Cartoons Magazine Video Archive Subscribe Search Annals of Medicine December 7, 2015 Issue Bacteria on the Brain A brilliant surgeon offered an untested treatment to dying patients. Was it innovation or overreach? By Emily Eakin Share Tweet Table of Contents Surgical legend holds that infection can lengthen the lives of brain-tumor patients, but the idea has never been proved. Credit Illustration by Patrik Svensson As the chairman of the neurosurgery department at the University of California at Davis, Paul Muizelaar saw patients on Wednesdays, at a clinic housed in a former cannery in East Sacramento. Among the people waiting to see him on the afternoon of November 10, 2010, was Terri Bradley, a fifty-six-year-old woman on whom he had operated the previous May, to remove a malignant brain tumor the size of a lime. Sitting in his office, Muizelaar reviewed Bradley’s file. He read a letter from her oncologist, asserting that Bradley was doing well: a brain scan had found no evidence of the tumor. “I think, This sounds great,” Muizelaar, a sixty-eight-year-old Dutchman, recalled. “So I go to her exam room with a big smile on my face, and there she is with her daughter, crying, not able to speak.” Muizelaar hadn’t seen Bradley’s latest test results. Her condition had suddenly deteriorated, and new scans revealed that her tumor—a deadly type known as glioblastoma multiforme, or GBM—had returned. It had spread from the right side of her brain to the left frontal lobe, acquiring an ominous winged shape that doctors refer to as a butterfly glioma. A second tumor had sprouted in the region of her brain associated with speech. Bradley, partially paralyzed and dependent on a wheelchair, had already undergone chemotherapy and radiation; her doctors believed that more drugs were pointless. “The radiologist said, ‘I’ve never seen anything grow so fast,’ ” Bradley’s daughter Janet recalled. “He said, ‘Call hospice.’ That scared the hell out of me.” Bradley, a fiercely self-reliant woman who had raised four daughters on her own, refused hospice care. Finally, Janet took her to Muizelaar, who said that he was unable to help. “It’s a blessing to most patients not to linger,” Muizelaar, who practiced medicine in California under a license reserved for eminent foreign-trained physicians, told me. “Within four weeks, this woman had regrown a massive tumor, plus a second tumor. There was clearly nothing I could do about it.” Yet the conversation did not end there. An hour before Bradley’s appointment, Muizelaar had received tantalizing news about a patient on whom he had performed an exceedingly unusual procedure. The previous month, he had operated on Patrick Egan, a fifty-six-year-old real-estate broker, who also suffered from glioblastoma. Egan was a friend of Muizelaar’s, and, like Terri Bradley, he had exhausted the standard therapies for the disease. The tumor had spread to his brain stem and was shortly expected to kill him. Muizelaar cut out as much of the tumor as possible. But before he replaced the “bone flap”—the section of skull that is removed to allow access to the brain—he soaked it for an hour in a solution teeming with Enterobacter aerogenes, a common fecal bacterium. Then he reattached it to Egan’s skull, using tiny metal plates and screws. Muizelaar hoped that inside Egan’s brain an infection was brewing. Muizelaar had devised the procedure in collaboration with a young neurosurgeon in his department, Rudolph Schrot. But as the consent form crafted by the surgeons, and signed by Egan and his wife, made clear, the procedure had never been tried before, even on a laboratory animal. Nor had it been approved by the Food and Drug Administration. The surgeons had no data to suggest what might constitute a therapeutic dose of Enterobacter, or a safe delivery method. The procedure was heretical in principle: deliberately exposing a patient to bacteria in the operating room violated a basic tenet of modern surgery, the concept known as “maintaining a sterile field,” which, along with prophylactic antibiotics, is credited with sharply reducing complications and mortality rates. “The ensuing infection,” the form cautioned, “may be totally ineffective in treatment of the tumor” and could cause “vegetative state, coma or death.” For four weeks, Egan lay in intensive care, most of the time in a coma. Then, on the afternoon of November 10th, Muizelaar learned that a scan of Egan’s brain had failed to pick up the distinctive signature of glioblastoma. The pattern on the scan suggested that the tumor had been replaced by an abscess—an infection—precisely as the surgeons had intended. “A brain abscess can be treated, a glioblastoma cannot,” Muizelaar told me. “I was excited, although I knew that clinically the patient was not better.” In Terri Bradley’s examination room, Muizelaar impulsively shared what he had just learned. “It escaped my mouth: ‘I just got this news about this treatment we tried on this one patient. Even though he is clinically not better, it appears that his tumor is disappearing. I think this might be your only chance.’ ” Muizelaar is six feet three and solid, with a ruddy, earnest face and a disarmingly forthright manner. His hands are conspicuously large, his fingers like sausages. It’s a myth that neurosurgery requires delicate digits, he said recently, over dinner in Huntington, West Virginia, where he now practices neurosurgery, at Marshall University. “A lot of it is very hard work; to get through the spine, you need lots of strength.” Buy the print » In addition to his medical degree, Muizelaar has a Ph.D. in neurophysiology, and, according to a recent analysis in the journal Neurosurgery, three of his papers are among the top hundred most cited in the field. Yet he has devoted far more time to repairing bodies than to testing theories. “This is the crux of my whole thinking: What would you do for your mother, yourself, your daughter, or your granddaughter?” he told me. “I know several neurosurgeons who would say, ‘If I ever have a glioblastoma, I would have it infected.’ ” The prognosis for glioblastoma is grim. Even with the standard treatment—surgery, radiation, and chemotherapy—the median survival time from diagnosis is little more than fourteen months. But for decades talk has circulated in the field about glioblastoma patients who, despite hospitals’ efforts to keep the O.R. free of germs, acquired a “wound infection” during surgery to remove their tumors. These patients, it was said, often lived far longer than expected. A 1999 article in Neurosurgery described four such cases: brain-tumor patients who developed postoperative infections and survived for years, cancer-free. Three of the patients were infected with Enterobacter, the fecal bacterium, and although the cases were anecdotal, and the alleged connection between the bacterium and survival was unproven, the notion became operating-room lore. One neurosurgeon, currently in private practice, told me that his former boss would joke during operations, “If I ever get a GBM, put your finger in your keister and put it in the wound.” Muizelaar had heard a similar, if less graphic, plea from Harold Young, until recently the chair of neurosurgery at the Virginia Commonwealth University School of Medicine, in Richmond, where, in 1981, he obtained a fellowship, his first job in the United States. “It’s true,” Young said, when I called him to confirm Muizelaar’s account. “There is no other treatment for it.” (In 2009, in an attempt to put the wound-infection rumor to rest, neurosurgeons at Columbia University analyzed the records of nearly four hundred GBM patients, and found “no significant survival difference” between the vast majority who did not have an infection and the eighteen who did. However, a 2011 study of nearly two hundred GBM patients by researchers at the Catholic University School of Medicine, in Rome, found that the ten who had wound infections lived, on average, twice as long as those who did not.) Young’s department had firsthand experience with a GBM survivor: a woman with a wound infection who lived for more than a decade. Muizelaar, who eventually took over her care, was fascinated. Cancer is notoriously deft at evading the immune system; he assumed that the bacteria in the woman’s brain had triggered an immune response that was eventually directed at her tumor, but he wasn’t especially interested in how that process might work. “I’m very practical,” he told me. “I only want to know whether something helps.” As Janet Bradley recalls the meeting on that November afternoon, Muizelaar described the Enterobacter procedure at length. “He told me they were going to put bacteria in my mom’s brain, and that, in the previous person they did it on, it killed the tumor cells,” she said. She asked Muizelaar what he would do if he were in her mother’s place. “I would demand that it be done on me!” he replied. Janet wheeled her mother to the parking lot to discuss the surgeon’s proposal. “We were smoking like banshees, because we were so nervous,” Janet said. She suggested that they consult the radiologist, a doctor her mother trusted. “So I called him, and explained the procedure to him. He said, ‘Your mom’s got three months to live. Do it.’ ” Researchers who want to test a new therapy on patients typically must submit animal and laboratory data to the F.D.A., showing how the treatment works and that it is safe. But, before the advent of modern science, medical progress often proceeded on the basis of inference rather than evidence. In 1796, Edward Jenner created the first vaccine when, using an unwitting child as a subject, he tested his hunch that exposure to cowpox conferred immunity to smallpox. A century later, the New York surgeon William Coley, also acting on a hunch, injected cancer patients with a Streptococcus bacterium and obtained some positive responses. The treatment amounted to a crude form of immunotherapy, but Coley, with virtually no knowledge of microbiology, could only speculate about how it worked—and why, frequently, it didn’t. Coley’s general approach is now being vindicated: some of the most promising new cancer drugs enlist the immune system to attack the disease. However, these drugs are engineered with exquisite precision, the products of decades of research. Translating guesswork into science takes time, and time is a luxury that the terminally ill don’t have. The lure of the shortcut—of a medicine that would proceed directly from a doctor’s intuition to a dying patient’s body—has persisted, despite regulations designed to stamp it out. As the pathologist Sidney Farber, whose experiments on children with leukemia yielded one of the first chemotherapy drugs, pleaded before a Senate committee in 1971, “The three hundred and twenty-five thousand patients with cancer who are going to die this year cannot wait. . . . The history of Medicine is replete with examples of cures obtained years, decades, and even centuries before the mechanism of action was understood for these cures.” Muizelaar’s success as a neurosurgeon was based on practical interventions and on close observation of patients’ responses, not on a detailed understanding of underlying mechanisms. As a neurosurgery resident in Amsterdam, in the nineteen-seventies, he was captivated by surgeries to repair ruptured brain aneurysms—blood-vessel segments that have swollen and burst, causing life-threatening bleeds. “Treating brain aneurysms was the holy grail of neurosurgery,” Muizelaar said. “Only the best did that.” “Don’t tell Coach about this—he doesn’t want us to be friends.”Buy the print » While awaiting surgery, aneurysm patients were sometimes given Amicar, a drug that keeps blood clots from breaking down and was thought to prevent dangerous “rebleeds.” Muizelaar and a collaborator decided to test Amicar’s benefits for such patients in a clinical trial. Before they began, a colleague showed them a landmark article by the French statisticians Daniel Schwartz and Joseph Lellouch. The authors demonstrated that clinical trials, by imposing tight constraints on variables, were often good at indicating whether a therapy worked the way researchers expected it to, but, because such constraints usually didn’t correspond well to real-world conditions, trials were less good at showing whether a therapy actually helped patients. The Amicar trial was completed in 1981, just as Muizelaar was moving to Richmond to begin his fellowship at V.C.U. Amicar, it turned out, worked very well: there were few rebleeds among the trial patients who got the drug. But the death rate was the same for the patients on Amicar as for those who received a placebo. The difference was that most of the placebo patients died from rebleeds, whereas most of the Amicar patients died from stroke: the drug promoted so much clotting that it interrupted blood flow in the brain. “So the drug worked,” Muizelaar said. “It did what it was supposed to do, prevent rebleeding. But it didn’t help.” At V.C.U., Muizelaar made a similar discovery involving the treatment for traumatic brain injury. It was widely assumed that a severely injured brain couldn’t regulate blood flow, and that this explained why intracranial pressure in such patients often got dangerously high. Muizelaar found not only that blood-flow response was normal in many of his brain-injured patients but also that, when he increased the amount of blood flowing to their brains, some immediately improved. He realized that the standard treatment—hyperventilation, in which the patient’s respiration rate is increased—worked: it eased intracranial pressure. But, because it substantially reduced blood flow, it often didn’t help. Muizelaar went on to conduct a randomized controlled trial, comparing hyperventilated patients with normally ventilated ones. After his study was published, in the Journal of Neurosurgery, in 1991, hyperventilation was abandoned as routine care, and the mortality rate for severe brain injury fell from close to forty-five per cent to less than thirty. “That’s by far my largest contribution to medicine,” Muizelaar said. “It was totally haphazard.” His work on Amicar and blood flow convinced him that the drive to understand mechanism was misguided. Schwartz and Lellouch’s article, distilled to its dualistic essence, became a governing mantra. “You must have some justification to try something, but often it turns out to be the wrong supposition,” Muizelaar said. “I’m only interested in the result: Does it help? Not whether it works. I don’t care.” Compared with research, neurosurgery is a more straightforward enterprise, in which the helpfulness of an intervention is often immediately apparent.",
  "comments.json": "{\n  \"comment_count\": 0,\n  \"api_response\": {\n    \"author\": \"pella\",\n    \"children\": [\n      {\n        \"author\": \"ajmurmann\",\n        \"children\": [\n          {\n            \"author\": \"athenot\",\n            \"children\": [],\n            \"created_at\": \"2015-11-30T21:21:04.000Z\",\n            \"created_at_i\": 1448918464,\n            \"id\": 10651892,\n            \"options\": [],\n            \"parent_id\": 10651770,\n            \"points\": null,\n            \"story_id\": 10648639,\n            \"text\": \"Many risky and unproven treatments are first trialed in these cases. The artificial heart is one example.<p><a href=\\\"http:&#x2F;&#x2F;www.reuters.com&#x2F;article&#x2F;2015&#x2F;10&#x2F;14&#x2F;us-carmat-patient-idUSKCN0S82GP20151014\\\" rel=\\\"nofollow\\\">http:&#x2F;&#x2F;www.reuters.com&#x2F;article&#x2F;2015&#x2F;10&#x2F;14&#x2F;us-carmat-patient-...</a>\",\n            \"title\": null,\n            \"type\": \"comment\",\n            \"url\": null\n          },\n          {\n            \"author\": \"atrandom\",\n            \"children\": [\n              {\n                \"author\": \"ajmurmann\",\n                \"children\": [\n                  {\n                    \"author\": \"niels_olson\",\n                    \"children\": [],\n                    \"created_at\": \"2015-12-01T03:22:34.000Z\",\n                    \"created_at_i\": 1448940154,\n                    \"id\": 10653475,\n                    \"options\": [],\n                    \"parent_id\": 10652245,\n                    \"points\": null,\n                    \"story_id\": 10648639,\n                    \"text\": \"&gt; the treatment worked, but not well enough<p>Well, the prognosis is 14 months, so if she lived a year, maybe it didn&#x27;t work?\",\n                    \"title\": null,\n                    \"type\": \"comment\",\n                    \"url\": null\n                  }\n                ],\n                \"created_at\": \"2015-11-30T22:08:39.000Z\",\n                \"created_at_i\": 1448921319,\n                \"id\": 10652245,\n                \"options\": [],\n                \"parent_id\": 10651950,\n                \"points\": null,\n                \"story_id\": 10648639,\n                \"text\": \"I agree that a quicker death would have been better. However that&#x27;s often times the case add yet most states don&#x27;t even site patients to choose between suffering and death. The patient suffered so much because the treatment worked, but not well enough to safe her. That however can happen with many well proven treatments as well. I have a relative who just got a port to feed her liquids, dive she cannot swallow anymore. That treatment will extend her life longer, but she well probably will just suffer longer and die soon anyways. This seems to be a constant trade off in health care these days and usually we decide blindly in favor of extending life regardless of the quality. How we judge experimental treatments seems completely different though.\",\n                \"title\": null,\n                \"type\": \"comment\",\n                \"url\": null\n              }\n            ],\n            \"created_at\": \"2015-11-30T21:26:47.000Z\",\n            \"created_at_i\": 1448918807,\n            \"id\": 10651950,\n            \"options\": [],\n            \"parent_id\": 10651770,\n            \"points\": null,\n            \"story_id\": 10648639,\n            \"text\": \"The problem is that the treatment can make the situation worse, like in the case of the woman who survived for a year with the infection. It can be argued that a quicker death would have been better in her case.\",\n            \"title\": null,\n            \"type\": \"comment\",\n            \"url\": null\n          },\n          {\n            \"author\": \"DanBC\",\n            \"children\": [\n              {\n                \"author\": \"DanBC\",\n                \"children\": [],\n                \"created_at\": \"2015-12-01T00:08:42.000Z\",\n                \"created_at_i\": 1448928522,\n                \"id\": 10652830,\n                \"options\": [],\n                \"parent_id\": 10651965,\n                \"points\": null,\n                \"story_id\": 10648639,\n                \"text\": \"This is being downvoted, but you only have to look at the quacks selling (just one example, there are many more) mega-vitamin &quot;cures&quot; for cancer to see that some doctors are indeed fucking arseholes who have no problem exploiting dying people so they can make a quick buck.\",\n                \"title\": null,\n                \"type\": \"comment\",\n                \"url\": null\n              }\n            ],\n            \"created_at\": \"2015-11-30T21:28:47.000Z\",\n            \"created_at_i\": 1448918927,\n            \"id\": 10651965,\n            \"options\": [],\n            \"parent_id\": 10651770,\n            \"points\": null,\n            \"story_id\": 10648639,\n            \"text\": \"Because some doctors are fucking arseholes who have no problem exploiting dying people so they can make a quick buck.\",\n            \"title\": null,\n            \"type\": \"comment\",\n            \"url\": null\n          },\n          {\n            \"author\": \"georgeglue1\",\n            \"children\": [\n              {\n                \"author\": \"Vomzor\",\n                \"children\": [\n                  {\n                    \"author\": \"univalent\",\n                    \"children\": [],\n                    \"created_at\": \"2015-11-30T22:07:38.000Z\",\n                    \"created_at_i\": 1448921258,\n                    \"id\": 10652242,\n                    \"options\": [],\n                    \"parent_id\": 10652179,\n                    \"points\": null,\n                    \"story_id\": 10648639,\n                    \"text\": \"Prolonging someone&#x27;s suffering? Giving their family false hope? Illegally test a technique&#x2F;method or drug just to see if it works for someone else benefit?<p>If the patient&#x27;s best interests are no longer the primary concern all kinds of shady things become possible.\",\n                    \"title\": null,\n                    \"type\": \"comment\",\n                    \"url\": null\n                  },\n                  {\n                    \"author\": \"refurb\",\n                    \"children\": [],\n                    \"created_at\": \"2015-11-30T22:25:16.000Z\",\n                    \"created_at_i\": 1448922316,\n                    \"id\": 10652335,\n                    \"options\": [],\n                    \"parent_id\": 10652179,\n                    \"points\": null,\n                    \"story_id\": 10648639,\n                    \"text\": \"Dying sooner, living the same amount of time with horrible pain or disabilities due to the treatment, increased suffering.\",\n                    \"title\": null,\n                    \"type\": \"comment\",\n                    \"url\": null\n                  },\n                  {\n                    \"author\": \"shimon\",\n                    \"children\": [],\n                    \"created_at\": \"2015-11-30T22:25:35.000Z\",\n                    \"created_at_i\": 1448922335,\n                    \"id\": 10652341,\n                    \"options\": [],\n                    \"parent_id\": 10652179,\n                    \"points\": null,\n                    \"story_id\": 10648639,\n                    \"text\": \"Dying sooner, degraded quality of life, and costs associated with treatment&#x2F;management.<p>It&#x27;s complicated because the costs are borne by a number of different parties: the patient herself, her family, the insurer (private or government).<p>For example, a patient could live longer but develop disabilities that require extreme measures in terms of treatment and family care, and cost a lot of money. The risks of all these are going to be unknown in very novel approaches, and people with different values are going to vary in their preference.<p>Understanding those risks and developing guidelines on when to pay for what are one activity of the FDA and major payors like Medicare. A patient and family facing a decision about the value to them in a time of crisis is going to be a lot less informed than those agencies, and it will be a lot easier for a doctor to mislead them (intentionally or not, but doctors aren&#x27;t immune from over-optimism that their clever ideas might work).<p>At the same time, it does seem like there should be some protocol where a terminally-ill person can be considered sufficiently informed to take the risk. This is hard, because the risks accrue to individual parties (e.g. the university getting sued in this article) whereas the benefits are diffuse (medicine learns whether induced brain infections improve survival in glioblastoma patients). But without this protocol, we are always going to have stories of patients whose treatments and deaths could be teaching us life-saving lessons if only we could legally do what they want to do.\",\n                    \"title\": null,\n                    \"type\": \"comment\",\n                    \"url\": null\n                  },\n                  {\n                    \"author\": \"georgeglue1\",\n                    \"children\": [],\n                    \"created_at\": \"2015-11-30T22:49:24.000Z\",\n                    \"created_at_i\": 1448923764,\n                    \"id\": 10652472,\n                    \"options\": [],\n                    \"parent_id\": 10652179,\n                    \"points\": null,\n                    \"story_id\": 10648639,\n                    \"text\": \"Yeah, mostly dying sooner or under worse conditions. A lot of terminal patients have many months prognoses.<p>People can seek pain relief, mental health services, etc. that they might not be able to pursue if they take a risky procedure.\",\n                    \"title\": null,\n                    \"type\": \"comment\",\n                    \"url\": null\n                  }\n                ],\n                \"created_at\": \"2015-11-30T21:55:45.000Z\",\n                \"created_at_i\": 1448920545,\n                \"id\": 10652179,\n                \"options\": [],\n                \"parent_id\": 10652141,\n                \"points\": null,\n                \"story_id\": 10648639,\n                \"text\": \"What&#x27;s the risk for terminal cases? Dying sooner? I&#x27;m honestly asking, not trying to be snark.\",\n                \"title\": null,\n                \"type\": \"comment\",\n                \"url\": null\n              }\n            ],\n            \"created_at\": \"2015-11-30T21:48:57.000Z\",\n            \"created_at_i\": 1448920137,\n            \"id\": 10652141,\n            \"options\": [],\n            \"parent_id\": 10651770,\n            \"points\": null,\n            \"story_id\": 10648639,\n            \"text\": \"Doctors have egos and incentives that could lead to terrible patient outcomes.<p>For many terminal cases, there are still well optimized&#x2F;studied systems and procedures to prolong and improve quality of life. Unless a patient doesn&#x27;t qualify for any of those, the doctor is taking a risk on bad odds, a risk most patients can&#x27;t fully understand.\",\n            \"title\": null,\n            \"type\": \"comment\",\n            \"url\": null\n          },\n          {\n            \"author\": \"robotresearcher\",\n            \"children\": [\n              {\n                \"author\": \"will_pseudonym\",\n                \"children\": [\n                  {\n                    \"author\": \"robotresearcher\",\n                    \"children\": [\n                      {\n                        \"author\": \"will_pseudonym\",\n                        \"children\": [\n                          {\n                            \"author\": \"jeremyjh\",\n                            \"children\": [],\n                            \"created_at\": \"2015-12-01T01:42:04.000Z\",\n                            \"created_at_i\": 1448934124,\n                            \"id\": 10653168,\n                            \"options\": [],\n                            \"parent_id\": 10653140,\n                            \"points\": null,\n                            \"story_id\": 10648639,\n                            \"text\": \"There is a selection bias here, you hear about the successes but not so much about all the crackpots that increased suffering needlessly. This article is about one such case, in case you didn&#x27;t notice.\",\n                            \"title\": null,\n                            \"type\": \"comment\",\n                            \"url\": null\n                          }\n                        ],\n                        \"created_at\": \"2015-12-01T01:33:58.000Z\",\n                        \"created_at_i\": 1448933638,\n                        \"id\": 10653140,\n                        \"options\": [],\n                        \"parent_id\": 10653099,\n                        \"points\": null,\n                        \"story_id\": 10648639,\n                        \"text\": \"I won&#x27;t debate you on whether I am correct. I will only state that science is (by definition) advanced ONLY by people over time who knew better, held up by everyone else hadn&#x27;t thought it through.<p><a href=\\\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Timeline_of_peptic_ulcer_disease_and_Helicobacter_pylori\\\" rel=\\\"nofollow\\\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Timeline_of_peptic_ulcer_disea...</a><p>June 12: Marshall intentionally consumes H. pylori and becomes ill. He takes antibiotics and is relieved of his symptoms.<p>That&#x27;s personal hubris! :)\",\n                        \"title\": null,\n                        \"type\": \"comment\",\n                        \"url\": null\n                      },\n                      {\n                        \"author\": \"Alex3917\",\n                        \"children\": [],\n                        \"created_at\": \"2015-12-01T02:11:40.000Z\",\n                        \"created_at_i\": 1448935900,\n                        \"id\": 10653272,\n                        \"options\": [],\n                        \"parent_id\": 10653099,\n                        \"points\": null,\n                        \"story_id\": 10648639,\n                        \"text\": \"&gt; The current system does allow for experimentation, but provides a conservative framework for it.<p>Which most people seem to think is wrong. The vast majority of treatments that get prescribed by doctors are unproven in terms of safety and efficacy. The main differences between the status quo and a proper experiment is that we&#x27;re not recording any data or allowing for informed consent.\",\n                        \"title\": null,\n                        \"type\": \"comment\",\n                        \"url\": null\n                      }\n                    ],\n                    \"created_at\": \"2015-12-01T01:24:05.000Z\",\n                    \"created_at_i\": 1448933045,\n                    \"id\": 10653099,\n                    \"options\": [],\n                    \"parent_id\": 10652874,\n                    \"points\": null,\n                    \"story_id\": 10648639,\n                    \"text\": \"They are absolutely not ignoring opportunity cost. This issue has been discussed very carefully by sophisticated people for thousands of years.<p>The current system does allow for experimentation, but provides a conservative framework for it.<p>It&#x27;s huge personal hubris to announce that you know better and they haven&#x27;t thought it through. Which is one of the things the approach is aimed to protect us from.\",\n                    \"title\": null,\n                    \"type\": \"comment\",\n                    \"url\": null\n                  }\n                ],\n                \"created_at\": \"2015-12-01T00:21:59.000Z\",\n                \"created_at_i\": 1448929319,\n                \"id\": 10652874,\n                \"options\": [],\n                \"parent_id\": 10652424,\n                \"points\": null,\n                \"story_id\": 10648639,\n                \"text\": \"Except &quot;do no harm&quot; is woefully inadequate because it fails to take into account opportunity cost. They are doing TONS of harm by failing to allow willing people to try new medicine and advance science and the human race, all because they have some warped sense of morality that&#x27;s got horse blinders on.\",\n                \"title\": null,\n                \"type\": \"comment\",\n                \"url\": null\n              },\n              {\n                \"author\": \"robotresearcher\",\n                \"children\": [],\n                \"created_at\": \"2015-12-01T02:58:29.000Z\",\n                \"created_at_i\": 1448938709,\n                \"id\": 10653417,\n                \"options\": [],\n                \"parent_id\": 10652424,\n                \"points\": null,\n                \"story_id\": 10648639,\n                \"text\": \"(too late to edit, I notice that spell-check has &#x27;fixed&#x27; my latin. The link is the correct latin phrase.)\",\n                \"title\": null,\n                \"type\": \"comment\",\n                \"url\": null\n              }\n            ],\n            \"created_at\": \"2015-11-30T22:38:59.000Z\",\n            \"created_at_i\": 1448923139,\n            \"id\": 10652424,\n            \"options\": [],\n            \"parent_id\": 10651770,\n            \"points\": null,\n            \"story_id\": 10648639,\n            \"text\": \"It&#x27;s a very long tradition, with well-trodden philosophical background: &quot;Primum non nicer&quot; (first, do no harm).<p><a href=\\\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Primum_non_nocere\\\" rel=\\\"nofollow\\\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Primum_non_nocere</a><p>Given the consequences of mistakes, a conservative approach  has been considered the best. &quot;It was nature killed her, not me&quot; being easier to stomach than &quot;oops&quot;.\",\n            \"title\": null,\n            \"type\": \"comment\",\n            \"url\": null\n          },\n          {\n            \"author\": \"senekerim\",\n            \"children\": [],\n            \"created_at\": \"2015-12-01T02:56:47.000Z\",\n            \"created_at_i\": 1448938607,\n            \"id\": 10653412,\n            \"options\": [],\n            \"parent_id\": 10651770,\n            \"points\": null,\n            \"story_id\": 10648639,\n            \"text\": \"One reason is that people&#x27;s innate probability engine is broken, so they can&#x27;t correctly figure out what&#x27;s best for them (in expectation). This applies both to individuals and to civilization as a whole.\",\n            \"title\": null,\n            \"type\": \"comment\",\n            \"url\": null\n          },\n          {\n            \"author\": \"bonestamp2\",\n            \"children\": [],\n            \"created_at\": \"2015-12-01T04:27:17.000Z\",\n            \"created_at_i\": 1448944037,\n            \"id\": 10653629,\n            \"options\": [],\n            \"parent_id\": 10651770,\n            \"points\": null,\n            \"story_id\": 10648639,\n            \"text\": \"They shouldn&#x27;t prevent it, but there should be some rules in place to ensure the procedures, practices, treatments and results are well documented so others can benefit from the trials.<p>Also, there should probably be some rules around peer review prior to starting a procedure that would include reviewing past procedures.\",\n            \"title\": null,\n            \"type\": \"comment\",\n            \"url\": null\n          }\n        ],\n        \"created_at\": \"2015-11-30T21:06:49.000Z\",\n        \"created_at_i\": 1448917609,\n        \"id\": 10651770,\n        \"options\": [],\n        \"parent_id\": 10648639,\n        \"points\": null,\n        \"story_id\": 10648639,\n        \"text\": \"I honestly don&#x27;t understand the reason why it&#x27;s so hard to try to help terminally ill patients with unproven methods as long as everyone agrees that there is no other, better way to help and as long as the patient wants it. Prohibiting this seems like a lose&#x2F;lose decision to me.\",\n        \"title\": null,\n        \"type\": \"comment\",\n        \"url\": null\n      },\n      {\n        \"author\": \"amedstudent\",\n        \"children\": [\n          {\n            \"author\": \"ajmurmann\",\n            \"children\": [\n              {\n                \"author\": \"niels_olson\",\n                \"children\": [],\n                \"created_at\": \"2015-12-01T03:17:42.000Z\",\n                \"created_at_i\": 1448939862,\n                \"id\": 10653465,\n                \"options\": [],\n                \"parent_id\": 10652216,\n                \"points\": null,\n                \"story_id\": 10648639,\n                \"text\": \"There are some good training modules on citiprogram.org. Just plug in your institution and select the Key Research Personnel module. You will be beaten over the head with the numerous historical events that have driven us to this point. Tuskegee is but one of the many, many examples.\",\n                \"title\": null,\n                \"type\": \"comment\",\n                \"url\": null\n              }\n            ],\n            \"created_at\": \"2015-11-30T22:02:56.000Z\",\n            \"created_at_i\": 1448920976,\n            \"id\": 10652216,\n            \"options\": [],\n            \"parent_id\": 10651879,\n            \"points\": null,\n            \"story_id\": 10648639,\n            \"text\": \"I understand that that&#x27;s a reason why it&#x27;s not done. However, my question was about why their legal system is like it is.\",\n            \"title\": null,\n            \"type\": \"comment\",\n            \"url\": null\n          }\n        ],\n        \"created_at\": \"2015-11-30T21:19:36.000Z\",\n        \"created_at_i\": 1448918376,\n        \"id\": 10651879,\n        \"options\": [],\n        \"parent_id\": 10648639,\n        \"points\": null,\n        \"story_id\": 10648639,\n        \"text\": \"Well this was a good read. Pretty long and dense for the tech focused audience here I would guess.<p>And to address the top comment, reason people don&#x27;t like doing this is you get sued when it goes wrong just like in this case. It&#x27;s safer for yourself to just stick to the protocol ...\",\n        \"title\": null,\n        \"type\": \"comment\",\n        \"url\": null\n      },\n      {\n        \"author\": \"niels_olson\",\n        \"children\": [],\n        \"created_at\": \"2015-11-30T21:44:10.000Z\",\n        \"created_at_i\": 1448919850,\n        \"id\": 10652109,\n        \"options\": [],\n        \"parent_id\": 10648639,\n        \"points\": null,\n        \"story_id\": 10648639,\n        \"text\": \"Thanks for this, I&#x27;m drafting an amendment to my IRB protocol right now. Made me re-read the whole thing. Cricky...\",\n        \"title\": null,\n        \"type\": \"comment\",\n        \"url\": null\n      },\n      {\n        \"author\": \"andy_ppp\",\n        \"children\": [\n          {\n            \"author\": \"DanBC\",\n            \"children\": [],\n            \"created_at\": \"2015-11-30T22:16:05.000Z\",\n            \"created_at_i\": 1448921765,\n            \"id\": 10652288,\n            \"options\": [],\n            \"parent_id\": 10652227,\n            \"points\": null,\n            \"story_id\": 10648639,\n            \"text\": \"A doctor who made some important discoveries had an idea about using infection to treat cancer.  He didn&#x27;t bother with the proper process, he just went and did it on three patients.  2 of them died about as quickly as they would have anyway.  We don&#x27;t know if they were in more pain or not.  1 of them lived for about a year, and that person&#x27;s relative described that year as very low quality of life. It&#x27;s possible that the treatment kept this person alive, in this awful condition, much longer than she would have lived without the treatment.<p>He did this because he thought he was doing the right thing.  It&#x27;s clear to most people that he wasn&#x27;t doing the right thing, and after he was discovered all the investigators were very clear that he&#x27;d done the wrong thing.<p>That story is contrasted with a team who did the right thing: they noticed a plausible mechanism of action; they gathered evidence; they got permissions; they did animal studies.<p>I don&#x27;t mind the length of the article, but I agree that it wandered around a bit.\",\n            \"title\": null,\n            \"type\": \"comment\",\n            \"url\": null\n          },\n          {\n            \"author\": \"porejide\",\n            \"children\": [\n              {\n                \"author\": \"jacobush\",\n                \"children\": [\n                  {\n                    \"author\": \"andy_ppp\",\n                    \"children\": [\n                      {\n                        \"author\": \"DanBC\",\n                        \"children\": [],\n                        \"created_at\": \"2015-12-01T00:44:22.000Z\",\n                        \"created_at_i\": 1448930662,\n                        \"id\": 10652965,\n                        \"options\": [],\n                        \"parent_id\": 10652914,\n                        \"points\": null,\n                        \"story_id\": 10648639,\n                        \"text\": \"If you like audio there&#x27;s a BBC Radio Four programme called &quot;Inside the Ethics Committee&quot;.  They have a bunch of people with real world experience of medical ethics, and they take real events and walk through them, explaining what happens at each step.<p><a href=\\\"http:&#x2F;&#x2F;www.bbc.co.uk&#x2F;programmes&#x2F;b007xbtd\\\" rel=\\\"nofollow\\\">http:&#x2F;&#x2F;www.bbc.co.uk&#x2F;programmes&#x2F;b007xbtd</a><p>It&#x27;s a surprisingly tough listen.  Here&#x27;s one example of a child with a treatable brain tumour. He didn&#x27;t like the treatment, and when he got another tumour he decided he didn&#x27;t want treatment.<p><a href=\\\"http:&#x2F;&#x2F;www.bbc.co.uk&#x2F;programmes&#x2F;b0643x61\\\" rel=\\\"nofollow\\\">http:&#x2F;&#x2F;www.bbc.co.uk&#x2F;programmes&#x2F;b0643x61</a><p>I think it&#x27;s available to people outside the UK.\",\n                        \"title\": null,\n                        \"type\": \"comment\",\n                        \"url\": null\n                      },\n                      {\n                        \"author\": \"ScottBurson\",\n                        \"children\": [\n                          {\n                            \"author\": \"andy_ppp\",\n                            \"children\": [\n                              {\n                                \"author\": \"ScottBurson\",\n                                \"children\": [],\n                                \"created_at\": \"2015-12-01T18:31:18.000Z\",\n                                \"created_at_i\": 1448994678,\n                                \"id\": 10657631,\n                                \"options\": [],\n                                \"parent_id\": 10654292,\n                                \"points\": null,\n                                \"story_id\": 10648639,\n                                \"text\": \"I don&#x27;t think it&#x27;s nearly that black-and-white.  The doctor performed a procedure <i>he would have wanted performed on himself in the same</i> (exceedingly desperate) <i>circumstances</i>.  He was careful to fully inform the patients of the risks.  Above all, he had his patients&#x27; welfare at heart; he wasn&#x27;t doing it for money or fame or even knowledge.  What he did may have been illegal, but I don&#x27;t agree that it was clearly immoral.\",\n                                \"title\": null,\n                                \"type\": \"comment\",\n                                \"url\": null\n                              }\n                            ],\n                            \"created_at\": \"2015-12-01T09:10:56.000Z\",\n                            \"created_at_i\": 1448961056,\n                            \"id\": 10654292,\n                            \"options\": [],\n                            \"parent_id\": 10653745,\n                            \"points\": null,\n                            \"story_id\": 10648639,\n                            \"text\": \"It&#x27;s not complex at all!  The doctor did loads of immoral things and the article sympathised with him.<p>He even says that he wouldn&#x27;t attend training because he knows best.  After his treatment caused several patients to suffer more or die earlier.<p>Sometimes we are better off calling bad medical practice illegal and immoral rather than trying to say &quot;whaaaaa it&#x27;s complicated&quot;.\",\n                            \"title\": null,\n                            \"type\": \"comment\",\n                            \"url\": null\n                          }\n                        ],\n                        \"created_at\": \"2015-12-01T05:10:26.000Z\",\n                        \"created_at_i\": 1448946626,\n                        \"id\": 10653745,\n                        \"options\": [],\n                        \"parent_id\": 10652914,\n                        \"points\": null,\n                        \"story_id\": 10648639,\n                        \"text\": \"&gt; I&#x27;m more frustrated that there wasn&#x27;t a clear editorial take in the article.<p>I&#x27;m glad there wasn&#x27;t.  I think the issues raised are difficult ones, with no simple, obvious resolution.  Sometimes we&#x27;re better off living with complexity and ambiguity.\",\n                        \"title\": null,\n                        \"type\": \"comment\",\n                        \"url\": null\n                      }\n                    ],\n                    \"created_at\": \"2015-12-01T00:32:24.000Z\",\n                    \"created_at_i\": 1448929944,\n                    \"id\": 10652914,\n                    \"options\": [],\n                    \"parent_id\": 10652703,\n                    \"points\": null,\n                    \"story_id\": 10648639,\n                    \"text\": \"I&#x27;m more frustrated that there wasn&#x27;t a clear editorial take in the article. I&#x27;d like to have seen some research done by the journalist into what the correct ethics are in a situation like this.  My feeling is that without the option to have euthanasia (should things get worse) you are promising a tiny tiny chance of a possible cure but a large chance of increased suffering too.<p>The tiny chance of 40 more years of life <i>might</i> be worth it but its crazy to try experimental treatments as a first roll of the dice!\",\n                    \"title\": null,\n                    \"type\": \"comment\",\n                    \"url\": null\n                  }\n                ],\n                \"created_at\": \"2015-11-30T23:42:02.000Z\",\n                \"created_at_i\": 1448926922,\n                \"id\": 10652703,\n                \"options\": [],\n                \"parent_id\": 10652676,\n                \"points\": null,\n                \"story_id\": 10648639,\n                \"text\": \"I liked it. Much better than the simple &quot;LET ME TELL Y&#x27;ALL ABOUT AN UNETHICAL DOCTOR&quot; opening to an article.\",\n                \"title\": null,\n                \"type\": \"comment\",\n                \"url\": null\n              }\n            ],\n            \"created_at\": \"2015-11-30T23:34:53.000Z\",\n            \"created_at_i\": 1448926493,\n            \"id\": 10652676,\n            \"options\": [],\n            \"parent_id\": 10652227,\n            \"points\": null,\n            \"story_id\": 10648639,\n            \"text\": \"In my reading there were three parts of the article:<p>Part I: Optimism. Is this a new curative treatment for a cancer with an extremely poor prognosis? We get to see Muizelaar&#x27;s perspective on why he (presumably) thought he was doing the right thing.<p>Part II: The Fall. Deaths, lawsuits, the expose, resignations.<p>Part III: Resolution. Maybe there is some value in an alternative approach that focuses on mechanism and iterates towards human trials via animal studies. But also, maybe there is something to be said about Muizelaar&#x27;s approach that our current medicolegal system isn&#x27;t equipped to handle.<p>To me, the structure of the article helped to underscore that Muizelaar might have been right, which is key for using this article as a way to learn about science and rationality as opposed to solely for its object-level information. Just listing the facts almost certainly would not have been as useful for getting that point across.\",\n            \"title\": null,\n            \"type\": \"comment\",\n            \"url\": null\n          },\n          {\n            \"author\": \"bonestamp2\",\n            \"children\": [],\n            \"created_at\": \"2015-12-01T04:30:15.000Z\",\n            \"created_at_i\": 1448944215,\n            \"id\": 10653640,\n            \"options\": [],\n            \"parent_id\": 10652227,\n            \"points\": null,\n            \"story_id\": 10648639,\n            \"text\": \"I think the build up is intended to put you in the heads of the doctors who thought they were onto something... to help us understand how such a thing can happen.<p>It also makes for a great narrative since you are cheering the doctors on because it seems like they are onto something big.<p>But, if you hate reading long articles then steer clear of the new yorker. It&#x27;s kind of the opposite of Reader&#x27;s Digest.\",\n            \"title\": null,\n            \"type\": \"comment\",\n            \"url\": null\n          }\n        ],\n        \"created_at\": \"2015-11-30T22:04:27.000Z\",\n        \"created_at_i\": 1448921067,\n        \"id\": 10652227,\n        \"options\": [],\n        \"parent_id\": 10648639,\n        \"points\": null,\n        \"story_id\": 10648639,\n        \"text\": \"I think this article could have gotten to the point more quickly.<p>Was it that bacteria on the brain can cure cancer and also ruin you life?  It then went on to talk about a reverse engineered virus that was also tried in some completely unrelated study.<p>The article seemed to have no structure and make no point.  The doctor seems to have done some very unethical things here but it is treated as if it was the right thing to do? Maybe it&#x27;s just the woolly language...\",\n        \"title\": null,\n        \"type\": \"comment\",\n        \"url\": null\n      }\n    ],\n    \"created_at\": \"2015-11-30T10:02:24.000Z\",\n    \"created_at_i\": 1448877744,\n    \"id\": 10648639,\n    \"options\": [],\n    \"parent_id\": null,\n    \"points\": 156,\n    \"story_id\": 10648639,\n    \"text\": null,\n    \"title\": \"Bacteria on the Brain\",\n    \"type\": \"story\",\n    \"url\": \"http://www.newyorker.com/magazine/2015/12/07/bacteria-on-the-brain\"\n  }\n}"
}