{
  "meta.json": "{\n  \"rank\": 22,\n  \"title\": \"Guide to Personal Productivity Methods\",\n  \"url\": \"https://blog.todoist.com/2015/11/30/ultimate-guide-personal-productivity-methods/\",\n  \"hn_url\": \"https://news.ycombinator.com/item?id=10653918\",\n  \"points\": 152,\n  \"author\": \"Tomte\",\n  \"comment_count\": 11\n}",
  "article.txt": "The Ultimate Guide to Personal Productivity Methods\ninspiration\nSubscribe\nCollaboration\nGoals\nProductivity\nRemote Work\nTime Management\nTodoist\nThe Ultimate Guide to Personal Productivity Methods\nYou don't need a to-do list, you need a system you can trust.\nProductivity\nTodoist makes the world’s #1 task manager to organize your work and life.\nTell me more\nNote\nThis guide has been so popular since we first published it in 2015 that we decided to create a whole hub dedicated to documenting the world's best productivity methods.\nBrowse the Productivity Methods Hub\non your own or take the\nProductivity Methods Quiz\nto get a personalized recommendation based on your workstyle and goals.\nThe right productivity method can make a\nhuge\ndifference in your work. A friction-less workflow can take you from feeling overwhelmed, unfocused, and unproductive to feeling calm, in control, and prepared to take on even the biggest projects.\nThe good news is, there are new methods being developed, tweaked, and shared all the time. There’s bound to be a system out there that fits your unique personality and projects. But wading through the thousands of articles about different productivity systems can be a massive time commitment — time you could be using to actually get things done.\nThat’s why we decided to do the legwork for you. We’ve gathered the most powerful productivity methods and frameworks all in one convenient place. This post will give you a brief overview of the most popular and useful productivity methods, how each works, and what kind of person will find each useful. It’s designed to help you get set up with your ideal workflow as quickly as possible so you can start reaping the productivity benefits right away.\nHow to get the most out of this guide\nFirst, we broke down the time commitment needed to get started with each method, rated with a simple\nLow\n,\nMedium\n, or\nHigh\n.\nEager to begin a huge project but feel completely lost whenever you try to start? Start with a method rated\nMedium\nor\nHigh\n.\nUp against a hard deadline with a to-do list the length of California and a tendency to procrastinate under stress? Jump to the systems with a\nLow\nrating.\nWe’ve also indicated which methods are more\nVisual\n,\nTactile\n, or\nAbstract\n— many are a combination. If you know which learning/work style you lean toward, you can skim through and jump to the methods that align best with your natural approach:\nVisual\nIf you’re the kind of person who prefers maps over written or verbal directions, you’ll probably find the visual methods more satisfying.\nTactile\nIf you love the feeling of physically crossing items off a to-do list or you often find yourself strategizing by moving note cards around on the floor, you’ll probably feel most comfortable with tactile methods.\nAbstract\nIf neither of those approaches sound like you — if you organize projects simply by writing it down or you strategize easily in your head with no physical or visual representation — you might find the abstract methods most useful. The upside of abstract methods is that they also tend to allow for more complexity in prioritizing and categorizing.\nAs you learn about the way that you work best, here are a few things to keep in mind:\nThe goal is to actually get stuff done.\nWhile it’s common for new workflow to take extra time upfront, they should become increasingly effortless over time. If you find that sticking to a certain productivity method is taking up a significant amount of time, energy, and mental bandwidth, it’s probably not for you. That’s ok. There are plenty of other options out there.\nYou’re not married to one productivity method forever.\nYou may find that a given method is better suited to some of your projects, and not others. A method that used to work for you might become a burden to maintain later on, or you may need a more robust system to tackle a growing workload. Be flexible and don’t be afraid to make a change.\nTo borrow a phrase from Pirates of the Caribbean,\nproductivity methods are more what you’d call “guidelines” than actual rules.\nThe methods outlined below are great starting points, but they’re infinitely more powerful when you mold them to fit your specific work style. Experiment with different methods and mix and match to find your ideal workflow.\nReady to find the right productivity method for you? Use the overview below to jump to the methods that seem the most promising to you.\nProductivity Methods Overview\nPersonal Kanban\nTime commitment to get started:\nLow\nType:\nVisual, Tactile\nPerfect for people who:\nHave a tendency to start a lot of projects but finish very few of them.\nEating Live Frogs: Do the Worst Thing First\nTime commitment to get started:\nLow\nType:\nAbstract\nPerfect for people who:\nStruggle with procrastination.\nMust, Should, Want\nTime commitment to get started:\nMedium\nType:\nAbstract, visual\nPerfect for people who:\nNeed to prioritize a large number of tasks, but tend to go for lists over graphs.\nThe SMART Method\nTime commitment to get started:\nMedium\nType:\nAbstract\nPerfect for people who:\nAre in the early phases of a big project and need to strategize before jumping in.\nThe Action Method\nTime commitment to get started:\nMedium\nType:\nAbstract\nPerfect for people who:\nNeed to turn creative brainstorming into an actionable to-do list.\nTime Blocking\nTime commitment to get started:\nLow\nType:\nVisual, abstract\nPerfect for people who:\nFind small tasks and interruptions are taking over the whole day or those who have more than one major area of work that they’re responsible for, especially managers.\nBiological Prime Time\nTime commitment to get started:\nHigh\nType:\nAbstract, visual\nPerfect for people who:\nLove data and self-experimentation and want to optimize their days for maximum productivity.\nGetting Things Done\nTime commitment to get started:\nMedium\nType:\nAbstract, visual, tactile\nPerfect for people who:\nAre feeling overwhelmed with the number of things they are responsible for and need a way organize it all.\nSystemist\nTime commitment to get started:\nMedium\nType:\nAbstract, visual, tactile\nPerfect for people who:\nFeel overwhelmed with the number of things they need to do, but find maintaining a Getting Things Done system too time-consuming and complicated.\nThe Medium Method\nTime commitment to get started:\nMedium\nType:\nAbstract, visual, tactile\nPerfect for people who:\nLove the concreteness of pen and paper to-do lists, but have too much to keep track of to rely only on pen and paper. If you like to slow down to review and really process everything you’ve learned and thought throughout the day, this method is for you.\nPomodoro/Sprints\nTime commitment to get started:\nLow\nType:\nAbstract\nPerfect for people who:\nFeel like there’s never enough time in the day, but have a tendency to get distracted.\nDon’t Break the Chain\nTime commitment to get started:\nLow\nType:\nVisual\nPerfect for people who:\nWant to adopt new daily habits.\nThe Eisenhower Matrix\nTime commitment to get started:\nMedium\nType:\nVisual\nPerfect for people who:\nLike graphs, have trouble seeing things in black-and-white, and would rather prioritize on a continuum than stuff tasks into a few categories.\nAgile Results\nTime commitment to get started:\nMedium\nType:\nAbstract\nPerfect for people who:\nAre goal-oriented and are tackling complex projects and need to keep to a timeline.\nThe To-Done List and the To-Don’t List\nTime commitment to get started:\nMedium\nType:\nAbstract\nPerfect for people who:\nSpend too much time worrying about how much didn’t get done yesterday or have a lot of bad habits that prevent productivity.\nPersonal Kanban\nImage credit to\nlifehacker.com\nTime commitment to get started:\nLow\nType:\nVisual, Tactile\nPerfect for people who:\nHave a tendency to start a lot of projects but finish very few of them.\nWhat it does:\nHelps you visualize progress on all of your projects.\nPersonal Kanban is an incredibly simple system. And that can be a good thing. Sometimes all you need to make progress is a way to see the status of your projects laid out simply in front of you.\nHere’s how Kanban works: Using whatever medium you prefer (sticky notes or a whiteboard work well), split your projects into three categories: To Do, Doing, and Done. That’s it.\nBut this simple system is more powerful than it seems.\nBy using a finite space for “To Do” and “Doing,” you’ll see how quickly those categories fill up. You get a constant, physical reminder when you need to concentrate on finishing your current projects before starting new ones. In addition, having all your work laid out in front of you helps you feel calm and in control of the big picture.\nWant to learn more?\nProductivity 101: How to Use Personal Kanban to Visualize Your Work\n(lifehacker.com)\npersonalkanban.com\nPersonal Kanban: Mapping Work | Navigating Life\n(book)\nEating Live Frogs: Do the Worst Thing First\nImage credit to\nhellostripes.blogspot.com\nTime commitment to get started:\nLow\nType:\nAbstract\nPerfect for people who:\nTend to put off important items, resulting in missed deadlines or rushed work.\nWhat it does:\nHelps to avoid procrastination while ensuring that you make progress on the\nright\nthings.\nA lot of productivity systems and tools are all about getting started. They assume that as long as you’re crossing\nsomething\noff your to-do list, you’re being productive. But in reality, it can make a big difference which task you pick first.\nIf you put off your most important tasks until the very last second, you’re not really improving your productivity on the things that matter. And, worse, you may find yourself missing deadlines or hurting your reputation by rushing through your most challenging work.\nThe term, “eating the frog first,” comes from that old well of ( delightfully snarky) wisdom, Mark Twain. He supposedly once said, “Eat a live frog first thing in the morning and nothing worse will happen to you the rest of the day.”\nTo get started, schedule your daily tasks from hardest to easiest. You’ll get your most important, intimidating, anxiety-inducing tasks(aka your frog) done while your energy is high and your day will get progressively better. You’re likely to find the overall quality of your work improves too.\nA huge part of learning to be truly productive is accepting that the impulse to procrastinate is inevitable. Learning to work around your own self-destructive impulses is key. As Brian Tracy puts it in his book\nEat that Frog: 21 Great Ways to Stop Procrastinating and Get More Done in Less Time\n:\nEveryone procrastinates. The difference between high performers and low performers is largely determined by what they choose to procrastinate on.\nWant to know more?\n[Workflow Guide] Why You Should Eat Your Frog First and How To Do It\nBig Rocks First: Double your Productivity this Week\nMust, Should, Want\nImage credit fabiocruz.com.br\nTime commitment to get started:\nMedium\nType:\nAbstract, visual\nPerfect for people who:\nNeed to prioritize tasks, but tend to go for lists over graphs.\nWhat it does:\nPrioritizes your tasks by urgency, ensures that you’re accomplishing the right things.\nMust, Should, Want is all about figuring out what’s critical today and what can wait. Write down everything you have to do and then identify each as a Must, a Should, or a Want\n.\nYour Must tasks are non-negotiable.\n“\nPay rent” — that’s a Must if it’s the first of the month.\nA Should is something you need to do, but it’s not dire that it be done today. Answering certain emails may be a Should. It’s important, but delaying it a day or two may not be a big deal, especially if you have a list of Musts due tomorrow.\nA Want is something you’d like to do, but might not be practical or necessary at the moment. It can be put off for the future, if need be. Learning a new language is a great goal, but if it’s a choice between getting eight hours of sleep every night and becoming conversational in Portuguese, you might not want to risk\nthe long-term effects of sleep deprivation\njust to learn a new (albeit, beautiful) language.\nA popular variation on this method, called MoSCoW, calls the “Want” category, “Could,” and adds another, “Won’t” for those pesky items that always seem to wind up on your to-do lists, but might not be worth your time and energy in the end.\nWant to know more?\nPrioritize Your Day with MUST, SHOULD, COULD (Day 9 of 30 Days of Getting Results)\nThree Tasks You Should Do Every Day to Stay Happy and Productive\nMoscow Method\nThe SMART Method\nImage credit to gcflearnfree.org\nTime commitment to get started:\nMedium\nType:\nAbstract\nPerfect for people who:\nAre in the early phases of a big project and need to strategize before jumping in.\nWhat it does:\nTurns big, abstract ideas and goals into concrete, actionable plans.\nThere have been many adaptations and adjustments to the SMART productivity method since it was introduced three decades ago. At its core, SMART is a way to take a big, pie-in-the-sky idea and figure out how to make it work in the real world by asking yourself a series of questions. SMART is an acronym that stands for: Specific, Measurable, Assignable, Realistic, Timely.\nLet’s break it down.\nSpecific:\nMeaning the What — what is this project and what,\nspecifically,\ndo you want to accomplish?\nMeasurable:\nThese are the individual tasks and steps that add up to a complete project.\nAssignable:\nWho is going to do which step? Yes, this is another method that can work for teams, but don’t toss out this step if you’re working on a solo project. Chances are, if you’re using SMART you have a big project, and nothing that big can be accomplished 100% on your own.\nIf you have small children, you might use this step to think through childcare options. If you’re starting a business, you might reach out to a lawyer or financial planner. Every large undertaking requires some help along the way.\nClarifying how you’ll get that help will make it easier to get your project started.\nRealistic:\nThis is the Debbie Downer of SMART. It encompasses all obstacles in your way, everything that could threaten your project. You can’t overcome a problem until you understand it completely. By carefully considering the challenges ahead, you can start mulling over solutions before they even get a chance to trip you up.\nTimely:\nDeadlines. Deadlines are an important part of nearly every successful productivity strategy, and with good reason. Time constraints force us to be efficient. Come up with reasonable deadlines for each measureable task — ideally giving you more time than you think you’ll need so you don’t fall victim to the\nPlanning Fallacy\n.\nOverall, SMART is perfectly suited for thinking through any big problem or project. However, when it comes to the day-to-day work of a complex undertaking SMART doesn’t have much to offer. This is a great system for anyone who is overwhelmed with the sheer size of their current project and needs a plan to move forward.\nIt’s simple, it’s easy to remember, and it doesn’t require a lot of reading to get started.\nWant to learn more?\nUse S.M.A.R.T.",
  "comments.json": "[\n  {\n    \"id\": 10661528,\n    \"author\": \"SyneRyder\",\n    \"text\": \"This is a good summary / refresher and worth a read, even if you're familiar with most of the productivity methodologies out there.  I didn't know the Eisenhower Matrix had a specific name.Not linked in the article (but worth a plug IMO) is the Mac app Vitamin-R [1].  I've started using it again lately and I'm finding it useful.  It combines several of the methodologies in the article: Pomodoro, Time Boxing and Biological Prime Time.  With the latter, after each pomodoro Vitamin-R asks whether you were in flow or felt distracted - over time it generates a graph of your peak productivity times & days of the week.[1] http://www.publicspace.net/Vitamin-R/\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T07:37:41.000Z\",\n    \"children\": []\n  },\n  {\n    \"id\": 10661541,\n    \"author\": \"Danilka\",\n    \"text\": \"Way to go todois ;-)\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T07:41:51.000Z\",\n    \"children\": []\n  },\n  {\n    \"id\": 10661619,\n    \"author\": \"stringtheorist\",\n    \"text\": \"I have read this and several other articles about productivity, focus etc. to find ways out of my own  procrastination. I have tried several things to some success and most often failures. I don't know if I will ever win battle against procrastination. I would like to know stories of people who never had this problem. Who can get work done whenever they like. How great would their life be?PS. Never commented on HN before, so ignore my comment if it breaks rules/guidelines of the site.\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T08:04:34.000Z\",\n    \"children\": [\n      {\n        \"id\": 10661684,\n        \"author\": \"qvikr\",\n        \"text\": \"I've had to struggle with procrastination since highschool (now 10+ yrs in the workforce). A couple of things I've noticed about myself and the teams I've worked with:- We always find time to do things we love doing. So the trick is to simply fill your bucket with things you genuinely enjoy.- Always have a backlog. It might be a note or a sheet on Excel - but always have a list of things that need to get done. Keep adding the new stuff into this as they come, and spend a couple of hours once  a week running through this.- Get in the flow. Plan your backlog so you have a mix of high, medium and low complexity stuff on your plate.- Figure out your \\\"in-the-zone\\\" time. For me, I've noticed that I'm most charged up for creative work later in the evening. Make sure you don't have any meetings or distractions lined up during and at least an hour before your zone time.- Get your temple. Everybody needs a place where they can go, zone in and get work done.- Have a daily standup where you discuss what you planned to do yesterday, what you did, and what you plan to do today. Do this EVERY SINGLE DAY.I've noticed most organized/ disciplined folks just do this automatically. For us procrastinators, it's like starting a workout routine after your BMI has hit the ceiling - you need a system, and you need a system that you'd actually enjoy if you want to stick to it!\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T08:26:28.000Z\",\n        \"children\": []\n      },\n      {\n        \"id\": 10661705,\n        \"author\": \"hliyan\",\n        \"text\": \"Someone with a strong predisposition to procrastinate who managed to eventually beat it here.As a teenager, I heard someone say \\\"never let a piece of paper cross your desk twice\\\" and took it to heart. Took a while to make it a habit, but now I can apply it to most meetings and emails -- I read, action then archive right there. So I hardly maintain a todo list of any sort. I make a list in the morning and finish/scratch off its items by the evening. Doing that daily, my mind is always refreshed about recurring or long term tasks. It seems to work for me.The other thing I found useful is that procrastination, or the getting-started-barrier is proportional to size/complexity of task. I keep breaking the task down to smaller units until I get to something that doesn't fill me with loathing when I think of it. And then I do it. That effectively starts the task.\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T08:32:32.000Z\",\n        \"children\": [\n          {\n            \"id\": 10663087,\n            \"author\": \"amelius\",\n            \"text\": \"> I read, action then archive right there.The problem with responding to an e-mail immediately, is that often you will get an e-mail back immediately, making this habit ineffective.(I just wish there was an option in my e-mail reader to send an email with a delay.)\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T14:29:16.000Z\",\n            \"children\": [\n              {\n                \"id\": 10663234,\n                \"author\": \"nsrivast\",\n                \"text\": \"http://www.boomeranggmail.com/\",\n                \"points\": null,\n                \"created_at\": \"2015-12-02T14:52:29.000Z\",\n                \"children\": [\n                  {\n                    \"id\": 10663437,\n                    \"author\": \"amelius\",\n                    \"text\": \"Thanks for the link, but $5 a month for adding a simple delay to my e-mail? I find that a bit too expensive.Instead, I just answer my e-mails in the morning and ignore any new incoming e-mails the rest of the day.\",\n                    \"points\": null,\n                    \"created_at\": \"2015-12-02T15:22:14.000Z\",\n                    \"children\": []\n                  }\n                ]\n              }\n            ]\n          }\n        ]\n      },\n      {\n        \"id\": 10661713,\n        \"author\": \"grp\",\n        \"text\": \"I'm trying a reverse strategy. The basic idea is to learn to do nothing at all. Really nothing, except breathing, eating, drinking water and sleeping.The purpose is to filter out any activity that challenge breath, eat, drink and sleep. If one comes in any way, I just quickly put in the the trash.That way when I reach a goal (if I had one at the time), I breathe better and so on... So step by step I create my world only on those 4 pillars.There are so many things that trying to tweak those pillars, maybe the first one in your case is that battle against procrastination.Avoid them and you will have so long to do who makes you breathe better...\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T08:34:59.000Z\",\n        \"children\": [\n          {\n            \"id\": 10661890,\n            \"author\": \"danieltillett\",\n            \"text\": \"Obviously posting on HN is an exception.\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T09:28:38.000Z\",\n            \"children\": [\n              {\n                \"id\": 10662005,\n                \"author\": \"grp\",\n                \"text\": \"Sure! ;)As a human being, share is not a priority but it's vital to mankind. I didn't say to be a hermit, we need to cross genes sometimes!\",\n                \"points\": null,\n                \"created_at\": \"2015-12-02T10:01:46.000Z\",\n                \"children\": []\n              }\n            ]\n          }\n        ]\n      },\n      {\n        \"id\": 10661744,\n        \"author\": \"thejerz\",\n        \"text\": \"Beating procrastination is about changing a lot of small habits. The first change I'd recommend is to focus on one baby step at a time: http://www.maxims.us/take-baby-steps/Once that becomes habitual, you may find the other Maxims on productivity to be relevant: http://www.maxims.us/topics/productivity/\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T08:41:01.000Z\",\n        \"children\": [\n          {\n            \"id\": 10661791,\n            \"author\": \"grp\",\n            \"text\": \"I read those maxims and there is one that surprised me: \\\"Hire a psychotherapist\\\".What? Ok... I bring one from another context who IMO fits well here:\\\"The point of public relations slogans like \\u201cSupport our troops\\u201d is that they don\\u2019t mean anything\\u2026 That\\u2019s the whole point of good propaganda.You want to create a slogan that nobody\\u2019s going to be against, and everybody\\u2019s going to be for.Nobody knows what it means, because it doesn\\u2019t mean anything. Its crucial value is that it diverts your attention from a question that does mean something: Do you support our policy? That\\u2019s the one you\\u2019re not allowed to talk about.\\\"\\nNoam Chomsky\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T08:57:00.000Z\",\n            \"children\": [\n              {\n                \"id\": 10662811,\n                \"author\": \"mercer\",\n                \"text\": \"I think most people are not against hiring a psychotherapist, but at the same time many people don't actually do this. So it's not empty advice, in the same way that \\\"get a good night's sleep\\\" is excellent advice even if everyone agrees with it. Another one would be 'be a nice person'. The value is in the reminder, because clearly we often don't take it to heart. It reminds me a bit of the late David Foster Wallace's increasing emphasis on the value of 'basic truths' even if they seem cliche. They're still true, and we suck at living by them. So why not remind ourselves often of their value?But perhaps your argument hinges on the assumption that 'hire a psychotherapist' is advice that diverts the attention from a more important issue. If that's the case, I'd like to hear what you think this might be.\",\n                \"points\": null,\n                \"created_at\": \"2015-12-02T13:35:14.000Z\",\n                \"children\": [\n                  {\n                    \"id\": 10668353,\n                    \"author\": \"grp\",\n                    \"text\": \"Thanks for the David Foster Wallace, I doesn't know that guy, I will look deeper into it. Yep, I'm aware that those 'basic truths' are valuable and I don't say otherwise.The Chomsky quote wasn't just about that psychotherapist maxim, it's that one that made me tilted.These maxims sound to me like if the job is not done it's the worker who got a problem and need to change. I'm just trying to say that maybe it could be the nature of the work and how we see it.For example I am one of those who have really a lot of never-ending-awesome-side-projects. I'm fine with it.As soon as I realize that particular job is more fun 'not to be completed' but because it allows me to learn more, share with others, discover techniques and occasionally strange weird reasons (wage?)!\\nThe completion is just a social reward (and yeah maybe I often fear the 'what to do next' desert).The path to completion is so much more valuable to me.We need more maxims to realize all the small ignored ends on the ongoing projects.\\nSometimes an idea is cool because of one of those ends, which is already done, and it would be a shame (and a time loss) to force yourself to continue.P.S: I don't preach a do-never-finish lifestyle, it needs personal balance.\",\n                    \"points\": null,\n                    \"created_at\": \"2015-12-03T07:42:15.000Z\",\n                    \"children\": []\n                  }\n                ]\n              }\n            ]\n          }\n        ]\n      },\n      {\n        \"id\": 10662003,\n        \"author\": \"rasmuskl\",\n        \"text\": \"One thing that helped me get a better mental model for procrastination was Wait But Why's articles on the topic.It might seem silly, but just thinking in terms of the rational decision maker and the instant gratification monkey makes it more concrete in my mind and easier to resist.http://waitbutwhy.com/2013/10/why-procrastinators-procrastin...\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T10:01:35.000Z\",\n        \"children\": [\n          {\n            \"id\": 10663322,\n            \"author\": \"galfarragem\",\n            \"text\": \"Best short essay I know on this subject:http://markmanson.net/procrastination\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T15:06:07.000Z\",\n            \"children\": []\n          }\n        ]\n      },\n      {\n        \"id\": 10662331,\n        \"author\": \"paulojreis\",\n        \"text\": \"Well, I've been down that road a lot. Countless times I found myself reading about ways out of procrastination, until noticing that this was procrastination in itself. Quite frankly, I've even felt ashamed by putting this out loud: I'm delaying work by reading about how to not delay work.So, my never-ending work in progress solution: focus on discipline. No magic bullets, no special talent, no nothing. Just focus on being disciplined and have faith on us being creatures of habit (i.e. if you force yourself to do it, it will be easier in the future).  A special talent to get things done is cool, as well as being motivated, but - really - you can't rely on those to get things done. Talent comes and goes, much like motivation. Discipline, on the other hand, you can rely on.\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T11:28:27.000Z\",\n        \"children\": []\n      },\n      {\n        \"id\": 10662480,\n        \"author\": \"galfarragem\",\n        \"text\": \"GTD.I can't understand why GTD is not anymore trendy (at least in HN) once it is the most efficient system I ever used. Since I implemented it, my life changed. If you ever get curious about GTD, besides reading the original book (Get Things Done by David Allen) you can have a look at my implementation (on my github), it might be a good starting point.\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T12:15:55.000Z\",\n        \"children\": [\n          {\n            \"id\": 10662689,\n            \"author\": \"manish_gill\",\n            \"text\": \"I've been reading the original book by David Allen and have slowly started to integrate GTD into my life the past couple of weeks using Omnifocus + Google Keep, and it has already made a considerable improvement in my productivity. I've had problems with procrastination as well, but with GTD I see myself wanting to do stuff.It hasn't been \\\"life changing\\\" so far, but I almost know that it will change my life once I start practicing it rigorously.Also, will definitely check out your setup.\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T13:08:10.000Z\",\n            \"children\": []\n          },\n          {\n            \"id\": 10662846,\n            \"author\": \"mercer\",\n            \"text\": \"I've spent years applying GTD, but at some point I realized that 1) I failed at implementing it more often than not, and 2) it seems optimized for management-type situations, and doesn't work as well for, say, artists or even programmers.If it works for you, of course that's great! And I think there are tons of individual elements in GTD that are valuable even if the whole system is not applied. But for me it didn't work as a whole, and it's significantly less useful if not applied completely (but also significantly more powerful when it is).What seems to work best for me is a combination of two approaches:1. choosing up to three tasks to focus on per day, usually one major task, and two lesser tasks.\\n2. using a simpler list of (usually) smaller or less important tasks for all the stuff that I can't dedicate a day or half-day to. I used Mark Forster's AutoFocus system for this for a while, and now I settled on the 'Final Version' that this evolved into: http://markforster.squarespace.com/blog/2015/5/21/the-final-...I think a crucial part for me is that I need a certain fluidity in my approach. The more complex, 'factory-checklist-like' the system is, the better. The lack of complexity keeps me from constantly fiddling with the system, and the lack of a 'factory-like' approach keeps me from feeling like I'm a robot working through a checklist.\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T13:45:19.000Z\",\n            \"children\": []\n          }\n        ]\n      },\n      {\n        \"id\": 10662603,\n        \"author\": \"endymi0n\",\n        \"text\": \"I'm battling procrastination for 15 years now. The three only things that really worked (as in \\\"having effects beyond a few months\\\") for me:- Accepting procrastination as part of you & forgiving yourself: \\nhttps://news.ycombinator.com/item?id=10267564- Tackling only one important task per day:\\nhttp://fourhourworkweek.com/2013/11/03/productivity-hacks/- Tiny Habits:\\nhttp://tinyhabits.com/\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T12:48:12.000Z\",\n        \"children\": []\n      },\n      {\n        \"id\": 10662660,\n        \"author\": \"_deepthought42\",\n        \"text\": \"I too had the same problem, but not any more.What worked for me is this book: http://www.amazon.com/The-ONE-Thing-Surprisingly-Extraordina....I started getting things done when I ask this question to myself: 'What is the one thing I can do now so that everything becomes easier?' and then do that task.\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T13:03:05.000Z\",\n        \"children\": []\n      },\n      {\n        \"id\": 10663875,\n        \"author\": \"irox859\",\n        \"text\": \"The only way out of procrastination is to deal with general levels of anxiety. Once you learn how to get around those feelings, then you can be more productive. Note: dealing with anxiety is a daily task but it can be done if you're mindful about it.Source: former procrastinator\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T16:27:27.000Z\",\n        \"children\": [\n          {\n            \"id\": 10670210,\n            \"author\": \"dcx\",\n            \"text\": \"I think this goes to the heart of the problem. I've noticed that the root cause of my procrastination is usually fear/anxiety about failure. What do you find works for managing your daily anxiety levels?\",\n            \"points\": null,\n            \"created_at\": \"2015-12-03T15:50:59.000Z\",\n            \"children\": []\n          }\n        ]\n      },\n      {\n        \"id\": 10666118,\n        \"author\": \"codezero\",\n        \"text\": \"Something people fail to recognize or accept is that procrastination is often a manifestation of a form of anxiety. It's an actual mental health disorder, and if you see a professional, you can actually get concrete help.\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T21:52:44.000Z\",\n        \"children\": []\n      }\n    ]\n  },\n  {\n    \"id\": 10661803,\n    \"author\": \"treelovinhippie\",\n    \"text\": \"Why is every productivity/procrastination article so damn long? All I do is open it, see the length, add to Pocket, never read. The irony is strong.\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T08:59:48.000Z\",\n    \"children\": [\n      {\n        \"id\": 10662216,\n        \"author\": \"prawn\",\n        \"text\": \"Especially so when the answer should be a list, and simple lists are something almost everyone can use effectively to get things done.If you're getting paid by the word and feel that a long article is more impressive, you won't write a short list!Shame they're such a chore to read.\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T10:53:45.000Z\",\n        \"children\": []\n      }\n    ]\n  },\n  {\n    \"id\": 10661841,\n    \"author\": \"bencollier49\",\n    \"text\": \"This seems to be perpetuate the notion of learning styles (in the guise of \\\"working style\\\"), which has been debunked.\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T09:15:25.000Z\",\n    \"children\": [\n      {\n        \"id\": 10662119,\n        \"author\": \"epaga\",\n        \"text\": \"Really? Where/when was this debunked and in what way? Because anecdotally and subjectively, more visually-based approaches work better for me...\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T10:29:17.000Z\",\n        \"children\": [\n          {\n            \"id\": 10662157,\n            \"author\": \"facepalm\",\n            \"text\": \"Google might help\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T10:39:14.000Z\",\n            \"children\": [\n              {\n                \"id\": 10662192,\n                \"author\": \"epaga\",\n                \"text\": \"All I can see that was debunked is \\\"Learning styles\\\" specifically in an educational environment, i.e. the goal being acquiring knowledge & skills. https://en.wikipedia.org/wiki/Learning_stylesThat surely is something totally different when it comes to productivity, isn't it? I am far more motivated to do things \\\"my way\\\", in my own preferred style of working than any other way.\",\n                \"points\": null,\n                \"created_at\": \"2015-12-02T10:47:47.000Z\",\n                \"children\": []\n              }\n            ]\n          }\n        ]\n      }\n    ]\n  },\n  {\n    \"id\": 10662105,\n    \"author\": \"epaga\",\n    \"text\": \"I like the distinction of more \\\"visual\\\" or more \\\"tactile\\\" minded people. I'm more a visual guy and the long lists in most todo solutions always felt overwhelming. So I went and wrote my own iPad app to help me keep a simple & fast personal Kanban, as well as for visual thinking & organizing. Turns out other people like it as well...https://itunes.apple.com/us/app/mindscope-mind-mapping-outli...\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T10:26:29.000Z\",\n    \"children\": [\n      {\n        \"id\": 10663476,\n        \"author\": \"walterbell\",\n        \"text\": \"This looks like a good balance of usability and functionality.  The minimalist tutorial videos were helpful.I have used inShort, iThoughts and MagicalPad for mindmap-like issue tracking on iOS.  Glad to see that arbitrary cross-branch links are possible, to supplement the tree hierarchy.Do you plan to support iOS9 multi-tasking, web hyperlinks and iOS deep-linking into other apps and their extensions?\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T15:27:50.000Z\",\n        \"children\": [\n          {\n            \"id\": 10663553,\n            \"author\": \"epaga\",\n            \"text\": \"Thanks! Definitely plan on all of those at some point, but development has been slow since this is a weekends and evenings project and I'm currently swamped with the final stages of a house building project gone sideways... can't wait to get back to tinkering with it, especially since I've gotten tons of people telling me how useful it's become for them.\",\n            \"points\": null,\n            \"created_at\": \"2015-12-02T15:39:03.000Z\",\n            \"children\": [\n              {\n                \"id\": 10664631,\n                \"author\": \"walterbell\",\n                \"text\": \"Looking forward to enhancements as your time permits.  Four requests for your list:- An App Setting to disable animation (it can be disorienting)- After navigating a cross-link, provide either a back button, or multiple breadcrumb trails in the navbar, when there are multiple \\\"parents\\\" or inbound paths.  On Android, NoteLynX Pro supports cross-references / multiple parents, http://astrodean.blogspot.com.  This is a valuable feature that few apps attempt, so thanks for including internal cross-ref links.  With the new \\\"Back to App\\\" feature in iOS9, cross-app hyperlink support would enable use of Mindscope as a contextual launcher.- Keyboard support, e.g. Delete to go back (cross-link) or up one level in the navigation hierarchy, hotkeys (e.g. Cmd-H for home, Cmd-W to \\\"close\\\" a sub-task and go up one level in the navigation hierarchy), Cmd-N to create a new entry centered in available whitespace. Mobile Safari supports similar key combos. Especially useful on iPad Pro.- For sync, please consider open-standard CalDav\",\n                \"points\": null,\n                \"created_at\": \"2015-12-02T18:06:00.000Z\",\n                \"children\": []\n              }\n            ]\n          }\n        ]\n      }\n    ]\n  },\n  {\n    \"id\": 10662181,\n    \"author\": \"skmurphy\",\n    \"text\": \"This is a really good list, I had not appreciated the subtle distinction been timeboxing and pomodoro before. Here are three more to consider1. Meditation - helps focus and mindfulness2. Review done list at end of day and make tomorrow's todo list then.3. Recognize and manage to constraints: 40 hours of prime work in a week, 8 hours of sleep, healthy diet and regular exercise.\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T10:45:21.000Z\",\n    \"children\": []\n  },\n  {\n    \"id\": 10662294,\n    \"author\": \"thallukrish\",\n    \"text\": \"The best productivity method is to just go do what you have to do and spend all the time doing it. Every thing else in the name of a productivity method is an excuse for your mind to stay off from what you really have to do.\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T11:20:37.000Z\",\n    \"children\": []\n  },\n  {\n    \"id\": 10662354,\n    \"author\": \"arocks\",\n    \"text\": \"My biggest problem with these list making solutions are what I call the collateral tasks. For example, my list says \\\"Buy a Christmas gift for Jen\\\".When I start shopping online, I realize that I don't know much about Jen, so I need to call a friend. Lots of discussion later, I finalize on something to buy then I need to think of a personal note to write.At the checkout, my banking application tells me that my internet password needs to be changed. The whole process gets aborted!Probably, I exaggerated a little but my point being that each task involves a million micro steps which may or may not be anticipated. No wonder there is a lot of procrastination!\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T11:35:14.000Z\",\n    \"children\": [\n      {\n        \"id\": 10662432,\n        \"author\": \"ak39\",\n        \"text\": \"Spot on.  We see this a lot in coding activities. Many tasks are usually more complicated than for example \\\"import this file into database, use the imported data to produce the histogram\\\" ... there's bound to be plenty of \\\"collateral\\\" shyte en route.  Non-programmers don't usually understand this.So how to overcome this?There's no other way than to cognitively \\\"bring to front\\\" the end goal every time you hit a task hurdle that threatens your concentration or that lets you succumb to distraction.  But it takes practice to learn that you are in the  process of beginning the \\\"shirk move\\\" ... watch out for this. Can you blame yourself when all you've done your whole life subconsciously toggle to other tasks when the going gets tough.  Blame evolution for this.So two things:1.  Know upfront the discrete sub-task/destination you are hoping to achieve for a given finite stretch of time, achieve it and call it the day; and2.  Kak on yourself solid! for being distracted during a tough spell ... speak it out to yourself by enunciating that you are being distracted, mofo.  If someone else is doing the disturbing, find a quiet place next time. (Working with kids in the house can be painful).That's why I am here!\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T12:03:20.000Z\",\n        \"children\": []\n      },\n      {\n        \"id\": 10664196,\n        \"author\": \"falcolas\",\n        \"text\": \"For what it's worth, when I run into a micro task, I add it to the to-do list, and keep a running document with notes which allow it to be context-switched out. It helps, and makes it easier to see progress.\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T17:10:26.000Z\",\n        \"children\": []\n      },\n      {\n        \"id\": 10668389,\n        \"author\": \"jmnicolas\",\n        \"text\": \"I don't understand what's the problem. That you can't include all the collateral tasks in your lists (I don't think you have to do that to be effective) or that these micro steps are a form of procrastination (in your example only the long phone call appears to be a bit procastinuous, yes I reserve the right to invent my own words ;-)?\",\n        \"points\": null,\n        \"created_at\": \"2015-12-03T07:51:40.000Z\",\n        \"children\": []\n      }\n    ]\n  },\n  {\n    \"id\": 10663242,\n    \"author\": \"jelmerdejong\",\n    \"text\": \"Personally I always use articles like this to yet again change my personal to-do-list strategy, select a new fancy app/tool, pay for a year long subscription, start entering all that is on my mind, open it the next day, look at it, and close it.I know the strategy, I have plenty of apps with an active subscription, but really making it a daily habit is the struggle.Any thoughts on that?\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T14:54:06.000Z\",\n    \"children\": [\n      {\n        \"id\": 10663320,\n        \"author\": \"codyb\",\n        \"text\": \"It's really easy (and sometimes fun) to get mired in the \\\"planning\\\" phase of thing. You need to keep that drive when the things get more abstract and you'll eventually find the same drive again.For instance, choosing a method, that's easy. Doing a bunch of brainstorming and coming up with projects to apply that method too, that's easy (for me). It's that next step, where you're actually designing the infrastructure of the system that's difficult. Suddenly you're getting distracted by things like Operating Systems, web hosting, bandwidth requirements, APIs, etc. And it becomes this huge, abstract project.It's then that you need to stay focused. Even if you only commit to 20 minutes a day, you'll be surprised how far you get. I find that really it doesn't take that long for me to take an abstract problem and reduce it down to a component I can get up and running now. This reduces the amount of mental overhead I'm juggling drastically and allows me to continue.It's the same thing at work for me, have you ever had that experience where you finish a feature, and it's time to jump into the next one? And it's almost like you can't do it. You need to breathe, because you've just been so focused at such a low level on this one feature, and suddenly you have to open your brain up to imagine the entire f#$@ing system again! And you need to connect end points, think about data structures, algorithms, libraries.Another thing I recommend is trying to get some work done before you go to work. Your mind is pretty refreshed after a good nights rest and a decent breakfast, but much less so after two commutes and a good 8 hours in the office.Finally, in my area there are a ton of meetups. A lot of these are just hacker hours. You get a bit of social activity and they tend to keep my focused (since who's going to bust out Hulu and toss on Seinfeld at the monthly ViM meetup? There's someone talking about macros up there! MACROS!). I'd recommend finding some of those. The interchange of ideas, and being able to bounce ideas off other practiced programmers is another tangible benefit.And a free beer and slice of pizza (well never is definitely the wrong word here...) never hurt anyone.\",\n        \"points\": null,\n        \"created_at\": \"2015-12-02T15:05:37.000Z\",\n        \"children\": []\n      }\n    ]\n  },\n  {\n    \"id\": 10663407,\n    \"author\": \"dimgl\",\n    \"text\": \"This is great. I have a huge problem with starting projects and just dropping them. I haven't been able to figure out why I simply stop working on them and jump to the next thing but maybe this will help me get back on track.\",\n    \"points\": null,\n    \"created_at\": \"2015-12-02T15:17:56.000Z\",\n    \"children\": []\n  }\n]"
}